xrun(64): 24.03-s004: (c) Copyright 1995-2024 Cadence Design Systems, Inc.
TOOL:	xrun(64)	24.03-s004: Started on Jan 12, 2026 at 13:04:30 CET
xrun
	-f xrun.f
		-clean
		./models/clock_distribution_all_non_linearities.sv
		./tb/clock_distribution_tb.sv
		-access +rw
		-gui
		-s
		-input /home/msegper/Documents/TFM/clock_distribution/restore.tcl
xrun: *N,CLEAN: Removing existing directory ./xcelium.d.
file: ./models/clock_distribution_all_non_linearities.sv
        int mean = 0;         // Promedio de la distribución
                 |
xmvlog: *W,VARIST (./models/clock_distribution_all_non_linearities.sv,120|17): Local static variable with initializer requires 'static' keyword.
        int std_dev = 1;     // Desviación estándar, sigma
                    |
xmvlog: *W,VARIST (./models/clock_distribution_all_non_linearities.sv,121|20): Local static variable with initializer requires 'static' keyword.
        int mean = 0;         // Promedio de la distribución
                 |
xmvlog: *W,VARIST (./models/clock_distribution_all_non_linearities.sv,133|17): Local static variable with initializer requires 'static' keyword.
        int std_dev = 10;     // Desviación estándar, sigma
                    |
xmvlog: *W,VARIST (./models/clock_distribution_all_non_linearities.sv,134|20): Local static variable with initializer requires 'static' keyword.
	module worklib.clock_distribution:sv
		errors: 0, warnings: 4
file: ./tb/clock_distribution_tb.sv
	module worklib.clock_distribution_tb:sv
		errors: 0, warnings: 0
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
	Top level design units:
		cds_rnm_pkg
		clock_distribution_tb
	Building instance overlay tables: ....................
        $display("jitter temporal %s [%0d] = %0d seed = %0d media =%0d sigma = %0d", type_jitter, i, random_value, seed, mean, std_dev);
                                                                                                                |
xmelab: *W,REALCV (./models/clock_distribution_all_non_linearities.sv,127|112): Real argument converted to integer for (%d).
        $display("mismatch temporal %s [%0d] = %0d seed = %0d media =%0d sigma = %0d", type_mismatch, i, random_value, seed, mean, std_dev);
                                                                                                                    |
xmelab: *W,REALCV (./models/clock_distribution_all_non_linearities.sv,140|116): Real argument converted to integer for (%d).
 Done
	Using implicit TMP libraries; associated with library worklib
	Generating native compiled code:
		worklib.clock_distribution:sv <0x7ba1c742>
			streams: 108, words: 156524
		worklib.clock_distribution_tb:sv <0x11f75bdf>
			streams:  12, words: 13543
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                 Instances  Unique
		Modules:                 2       2
		Verilog packages:        1       1
		Registers:             144     144
		Scalar wires:           56       -
		Vectored wires:          1       -
		Always blocks:           6       6
		Initial blocks:          9       9
		Parallel blocks:         1       1
		Pseudo assignments:      9       -
		Assertions:              3       3
		Simulation timescale:  1ps
	Writing initial simulation snapshot: worklib.clock_distribution_tb:sv
xmsim: *W,NOMTDGUI: Multi-Threaded Dumping is disabled for interactive debug mode.
SVSEED default: 1
[DMSINFO] Simulating with Xcelium Mixed-Signal App...

-------------------------------------
Relinquished control to SimVision...
xcelium> 
xcelium> source /eda/cadence/2024-25/RHELx86/XCELIUM_24.03.004/tools/xcelium/files/xmsimrc
xcelium> 
xcelium> # XM-Sim Command File
xcelium> # TOOL:	xmsim(64)	24.03-s004
xcelium> #
xcelium> #
xcelium> # You can restore this configuration with:
xcelium> #
xcelium> #      xrun -f xrun.f -input restore.tcl
xcelium> #
xcelium> 
xcelium> set tcl_prompt1 {puts -nonewline "xcelium> "}
puts -nonewline "xcelium> "
xcelium> set tcl_prompt2 {puts -nonewline "> "}
puts -nonewline "> "
xcelium> set vlog_format %h
%h
xcelium> set vhdl_format %v
%v
xcelium> set real_precision 6
6
xcelium> set display_unit auto
auto
xcelium> set time_unit module
module
xcelium> set heap_garbage_size -200
-200
xcelium> set heap_garbage_time 0
0
xcelium> set assert_report_level note
note
xcelium> set assert_stop_level error
error
xcelium> set autoscope yes
yes
xcelium> set assert_1164_warnings yes
yes
xcelium> set pack_assert_off {}
xcelium> set severity_pack_assert_off {note warning}
note warning
xcelium> set assert_output_stop_level failed
failed
xcelium> set tcl_debug_level 0
0
xcelium> set relax_path_name 1
1
xcelium> set vhdl_vcdmap XX01ZX01X
XX01ZX01X
xcelium> set intovf_severity_level ERROR
ERROR
xcelium> set probe_screen_format 0
0
xcelium> set rangecnst_severity_level ERROR
ERROR
xcelium> set textio_severity_level ERROR
ERROR
xcelium> set vital_timing_checks_on 1
1
xcelium> set vlog_code_show_force 0
0
xcelium> set assert_count_attempts 1
1
xcelium> set tcl_all64 false
false
xcelium> set tcl_runerror_exit false
false
xcelium> set assert_report_incompletes 0
0
xcelium> set show_force 1
1
xcelium> set force_reset_by_reinvoke 0
0
xcelium> set tcl_relaxed_literal 0
0
xcelium> set probe_exclude_patterns {}
xcelium> set probe_packed_limit 4k
4k
xcelium> set probe_unpacked_limit 16k
16k
xcelium> set assert_internal_msg no
no
xcelium> set svseed 1
1
xcelium> set assert_reporting_mode 0
0
xcelium> set vcd_compact_mode 0
0
xcelium> set vhdl_forgen_loopindex_enum_pos 0
0
xcelium> set xmreplay_dc_debug 0
0
xcelium> set tcl_runcmd_interrupt next_command
next_command
xcelium> set tcl_sigval_prefix {#}
#
xcelium> alias . run
xcelium> alias indago verisium
xcelium> alias quit exit
xcelium> database -open -shm -into waves.shm waves -default
Created default SHM database waves
xcelium> probe -create -database waves clock_distribution_tb.dut.atb0 clock_distribution_tb.dut.atb1 clock_distribution_tb.dut.atb_ena clock_distribution_tb.dut.clkin clock_distribution_tb.dut.clkinb clock_distribution_tb.dut.clkout_binary_0 clock_distribution_tb.dut.clkout_binary_0_red clock_distribution_tb.dut.clkout_binary_1 clock_distribution_tb.dut.clkout_binary_2 clock_distribution_tb.dut.clkout_binary_3 clock_distribution_tb.dut.clkout_binary_4 clock_distribution_tb.dut.clkout_binary_5 clock_distribution_tb.dut.clkout_therm_0 clock_distribution_tb.dut.clkout_therm_1 clock_distribution_tb.dut.clkout_therm_2 clock_distribution_tb.dut.clkout_therm_3 clock_distribution_tb.dut.clkout_therm_4 clock_distribution_tb.dut.clkout_therm_5 clock_distribution_tb.dut.clkout_therm_6 clock_distribution_tb.dut.clkout_therm_7 clock_distribution_tb.dut.clkout_therm_8 clock_distribution_tb.dut.clkout_therm_9 clock_distribution_tb.dut.clkout_therm_10 clock_distribution_tb.dut.clkout_therm_11 clock_distribution_tb.dut.clkout_therm_12 clock_distribution_tb.dut.clkout_therm_13 clock_distribution_tb.dut.clkout_therm_14 clock_distribution_tb.dut.clkout_therm_15 clock_distribution_tb.dut.clkout_therm_16 clock_distribution_tb.dut.clkoutb_binary_0 clock_distribution_tb.dut.clkoutb_binary_0_red clock_distribution_tb.dut.clkoutb_binary_1 clock_distribution_tb.dut.clkoutb_binary_2 clock_distribution_tb.dut.clkoutb_binary_3 clock_distribution_tb.dut.clkoutb_binary_4 clock_distribution_tb.dut.clkoutb_binary_5 clock_distribution_tb.dut.clkoutb_therm_0 clock_distribution_tb.dut.clkoutb_therm_1 clock_distribution_tb.dut.clkoutb_therm_2 clock_distribution_tb.dut.clkoutb_therm_3 clock_distribution_tb.dut.clkoutb_therm_4 clock_distribution_tb.dut.clkoutb_therm_5 clock_distribution_tb.dut.clkoutb_therm_6 clock_distribution_tb.dut.clkoutb_therm_7 clock_distribution_tb.dut.clkoutb_therm_8 clock_distribution_tb.dut.clkoutb_therm_9 clock_distribution_tb.dut.clkoutb_therm_10 clock_distribution_tb.dut.clkoutb_therm_11 clock_distribution_tb.dut.clkoutb_therm_12 clock_distribution_tb.dut.clkoutb_therm_13 clock_distribution_tb.dut.clkoutb_therm_14 clock_distribution_tb.dut.clkoutb_therm_15 clock_distribution_tb.dut.clkoutb_therm_16 clock_distribution_tb.dut.iref_25ua clock_distribution_tb.dut.pdb clock_distribution_tb.dut.vddana_0p8 clock_distribution_tb.dut.vssana
Created probe 1
xcelium> 
xcelium> simvision -input restore.tcl.svcf
xcelium> run
mismatch temporal therm [0] =           1 seed = 129616766 media =0 sigma = 10
mismatch temporal therm [1] =           0 seed = 237957420 media =0 sigma = 10
mismatch temporal therm [2] =          11 seed = 1379569055 media =0 sigma = 10
mismatch temporal therm [3] =           6 seed = 1083003834 media =0 sigma = 10
mismatch temporal therm [4] =         -11 seed = 1436499988 media =0 sigma = 10
mismatch temporal therm [5] =          17 seed = 1734256537 media =0 sigma = 10
mismatch temporal therm [6] =           3 seed = 466026175 media =0 sigma = 10
mismatch temporal therm [7] =           6 seed = -1194537998 media =0 sigma = 10
mismatch temporal therm [8] =         -24 seed = -1994547904 media =0 sigma = 10
mismatch temporal therm [9] =         -26 seed = 2051887517 media =0 sigma = 10
mismatch temporal therm [10] =          11 seed = -1355547127 media =0 sigma = 10
mismatch temporal therm [11] =         -20 seed = 1877475193 media =0 sigma = 10
mismatch temporal therm [12] =         -14 seed = 1727671484 media =0 sigma = 10
mismatch temporal therm [13] =          -3 seed = -500328910 media =0 sigma = 10
mismatch temporal therm [14] =          15 seed = -2127066652 media =0 sigma = 10
mismatch temporal therm [15] =         -13 seed = 1479910163 media =0 sigma = 10
mismatch temporal therm [16] =          -4 seed = -502357234 media =0 sigma = 10
mismatch temporal thermb [0] =          15 seed = 1634104956 media =0 sigma = 10
mismatch temporal thermb [1] =           3 seed = -1927313332 media =0 sigma = 10
mismatch temporal thermb [2] =           6 seed = -834847021 media =0 sigma = 10
mismatch temporal thermb [3] =         -23 seed = -2115364627 media =0 sigma = 10
mismatch temporal thermb [4] =           4 seed = 597661442 media =0 sigma = 10
mismatch temporal thermb [5] =           7 seed = 1118328367 media =0 sigma = 10
mismatch temporal thermb [6] =           4 seed = 621745896 media =0 sigma = 10
mismatch temporal thermb [7] =           0 seed = 62486414 media =0 sigma = 10
mismatch temporal thermb [8] =          -6 seed = 1113444174 media =0 sigma = 10
mismatch temporal thermb [9] =         -13 seed = -1964120070 media =0 sigma = 10
mismatch temporal thermb [10] =         -10 seed = -1341725445 media =0 sigma = 10
mismatch temporal thermb [11] =           1 seed = 700542336 media =0 sigma = 10
mismatch temporal thermb [12] =          10 seed = 1449825813 media =0 sigma = 10
mismatch temporal thermb [13] =          -5 seed = -1243117787 media =0 sigma = 10
mismatch temporal thermb [14] =          -7 seed = 944834049 media =0 sigma = 10
mismatch temporal thermb [15] =           6 seed = -886686983 media =0 sigma = 10
mismatch temporal thermb [16] =         -14 seed = 1996761365 media =0 sigma = 10
mismatch temporal binary [0] =         -12 seed = 1987599480 media =0 sigma = 10
mismatch temporal binary [1] =           2 seed = 1522651986 media =0 sigma = 10
mismatch temporal binary [2] =           3 seed = 1148883081 media =0 sigma = 10
mismatch temporal binary [3] =          12 seed = -1374072306 media =0 sigma = 10
mismatch temporal binary [4] =          -4 seed = 773178278 media =0 sigma = 10
mismatch temporal binary [5] =         -18 seed = 1849499825 media =0 sigma = 10
mismatch temporal binaryb [0] =          23 seed = -2104045803 media =0 sigma = 10
mismatch temporal binaryb [1] =          13 seed = -1518319124 media =0 sigma = 10
mismatch temporal binaryb [2] =          11 seed = -1811915731 media =0 sigma = 10
mismatch temporal binaryb [3] =           4 seed = -1346899391 media =0 sigma = 10
mismatch temporal binaryb [4] =          -4 seed = 2002906927 media =0 sigma = 10
mismatch temporal binaryb [5] =          14 seed = -1636791257 media =0 sigma = 10
Iniciando tests...
Test 1: Estado apagado
clkout_therm_16 = 0, clkoutb_therm_16 = 0
Test 2: Estado encendido con atb_ena = 2'b00
jitter temporal therm [16] =           3 seed = 2049777229 media =0 sigma = 1
jitter temporal therm [15] =          -1 seed = 935010399 media =0 sigma = 1
jitter temporal therm [14] =           2 seed = 1923838383 media =0 sigma = 1
jitter temporal therm [13] =           1 seed = 1496260146 media =0 sigma = 1
jitter temporal therm [12] =          -1 seed = -1272287527 media =0 sigma = 1
jitter temporal therm [11] =          -1 seed = 1416363817 media =0 sigma = 1
jitter temporal therm [10] =           2 seed = -2031530373 media =0 sigma = 1
jitter temporal therm [9] =           1 seed = -1403276627 media =0 sigma = 1
jitter temporal therm [8] =           1 seed = -1739549836 media =0 sigma = 1
jitter temporal therm [7] =          -1 seed = 2045447604 media =0 sigma = 1
jitter temporal therm [6] =          -2 seed = 1995736582 media =0 sigma = 1
jitter temporal therm [5] =           2 seed = -1896957595 media =0 sigma = 1
jitter temporal therm [4] =           0 seed = 353525573 media =0 sigma = 1
jitter temporal therm [3] =           1 seed = -998158522 media =0 sigma = 1
jitter temporal therm [2] =           1 seed = 1266084719 media =0 sigma = 1
jitter temporal therm [1] =           2 seed = 2011445172 media =0 sigma = 1
jitter temporal therm [0] =           1 seed = 1972203375 media =0 sigma = 1
jitter temporal thermb [16] =          -1 seed = -1212714505 media =0 sigma = 1
jitter temporal thermb [15] =           0 seed = -368028907 media =0 sigma = 1
jitter temporal thermb [14] =          -1 seed = -1215744032 media =0 sigma = 1
jitter temporal thermb [13] =           2 seed = 1847150967 media =0 sigma = 1
jitter temporal thermb [12] =           0 seed = -975207532 media =0 sigma = 1
jitter temporal thermb [11] =           2 seed = -1936229351 media =0 sigma = 1
jitter temporal thermb [10] =           2 seed = -1648009150 media =0 sigma = 1
jitter temporal thermb [9] =           1 seed = -1106616374 media =0 sigma = 1
jitter temporal thermb [8] =          -1 seed = 1152259756 media =0 sigma = 1
jitter temporal thermb [7] =          -1 seed = -1882349354 media =0 sigma = 1
jitter temporal thermb [6] =           0 seed = -257353177 media =0 sigma = 1
jitter temporal thermb [5] =           3 seed = -2088317965 media =0 sigma = 1
jitter temporal thermb [4] =           0 seed = 84986204 media =0 sigma = 1
jitter temporal thermb [3] =           0 seed = -775351110 media =0 sigma = 1
jitter temporal thermb [2] =           0 seed = -775617090 media =0 sigma = 1
jitter temporal thermb [1] =          -2 seed = 1833746667 media =0 sigma = 1
jitter temporal thermb [0] =           0 seed = -572772880 media =0 sigma = 1
jitter temporal binary [5] =           0 seed = 1046028917 media =0 sigma = 1
jitter temporal binary [4] =           0 seed = -1120018967 media =0 sigma = 1
jitter temporal binary [3] =          -1 seed = 1429346394 media =0 sigma = 1
jitter temporal binary [2] =           0 seed = -1518040217 media =0 sigma = 1
jitter temporal binary [1] =          -1 seed = -1467458607 media =0 sigma = 1
jitter temporal binary [0] =           1 seed = 1121138069 media =0 sigma = 1
jitter temporal binaryb [5] =          -1 seed = 870490422 media =0 sigma = 1
jitter temporal binaryb [4] =          -1 seed = 986322041 media =0 sigma = 1
jitter temporal binaryb [3] =           0 seed = 621889643 media =0 sigma = 1
jitter temporal binaryb [2] =           0 seed = -670339373 media =0 sigma = 1
jitter temporal binaryb [1] =           0 seed = 1511046705 media =0 sigma = 1
jitter temporal binaryb [0] =          -1 seed = -968697540 media =0 sigma = 1
jitter temporal therm [16] =           0 seed = 534133530 media =0 sigma = 1
jitter temporal therm [15] =          -1 seed = 1762160747 media =0 sigma = 1
jitter temporal therm [14] =          -1 seed = 1730471090 media =0 sigma = 1
jitter temporal therm [13] =           0 seed = -896125734 media =0 sigma = 1
jitter temporal therm [12] =           0 seed = -608135500 media =0 sigma = 1
jitter temporal therm [11] =           3 seed = 2090305488 media =0 sigma = 1
jitter temporal therm [10] =           0 seed = -440723526 media =0 sigma = 1
jitter temporal therm [9] =           2 seed = -1617918997 media =0 sigma = 1
jitter temporal therm [8] =           1 seed = -1848799684 media =0 sigma = 1
jitter temporal therm [7] =          -2 seed = 2039811959 media =0 sigma = 1
jitter temporal therm [6] =          -1 seed = -1664515413 media =0 sigma = 1
jitter temporal therm [5] =           1 seed = -1143769857 media =0 sigma = 1
jitter temporal therm [4] =           0 seed = -565429652 media =0 sigma = 1
jitter temporal therm [3] =           2 seed = -1902327858 media =0 sigma = 1
jitter temporal therm [2] =          -1 seed = -939463004 media =0 sigma = 1
jitter temporal therm [1] =          -2 seed = -1856808716 media =0 sigma = 1
jitter temporal therm [0] =           2 seed = -2097960115 media =0 sigma = 1
jitter temporal thermb [16] =          -1 seed = -869419760 media =0 sigma = 1
jitter temporal thermb [15] =          -1 seed = 1718218121 media =0 sigma = 1
jitter temporal thermb [14] =          -1 seed = -2112253274 media =0 sigma = 1
jitter temporal thermb [13] =           2 seed = -1920423470 media =0 sigma = 1
jitter temporal thermb [12] =           1 seed = 1037350367 media =0 sigma = 1
jitter temporal thermb [11] =           0 seed = 360208394 media =0 sigma = 1
jitter temporal thermb [10] =          -2 seed = 1911162715 media =0 sigma = 1
jitter temporal thermb [9] =           1 seed = -763212241 media =0 sigma = 1
jitter temporal thermb [8] =           1 seed = 1252696651 media =0 sigma = 1
jitter temporal thermb [7] =           1 seed = 1308425973 media =0 sigma = 1
jitter temporal thermb [6] =           0 seed = -667567164 media =0 sigma = 1
jitter temporal thermb [5] =          -1 seed = -1649662728 media =0 sigma = 1
jitter temporal thermb [4] =           1 seed = -1040023813 media =0 sigma = 1
jitter temporal thermb [3] =           1 seed = -1083022347 media =0 sigma = 1
jitter temporal thermb [2] =          -1 seed = 1317968687 media =0 sigma = 1
jitter temporal thermb [1] =          -1 seed = -1366179993 media =0 sigma = 1
jitter temporal thermb [0] =          -3 seed = -2018622128 media =0 sigma = 1
jitter temporal binary [5] =           1 seed = -1604585771 media =0 sigma = 1
jitter temporal binary [4] =           0 seed = -624573858 media =0 sigma = 1
jitter temporal binary [3] =           1 seed = 1720464347 media =0 sigma = 1
jitter temporal binary [2] =           0 seed = 591166648 media =0 sigma = 1
jitter temporal binary [1] =           0 seed = -576723960 media =0 sigma = 1
jitter temporal binary [0] =           1 seed = -1994913693 media =0 sigma = 1
jitter temporal binaryb [5] =          -1 seed = -1108470887 media =0 sigma = 1
jitter temporal binaryb [4] =           1 seed = -2094601512 media =0 sigma = 1
jitter temporal binaryb [3] =          -2 seed = 1713961530 media =0 sigma = 1
jitter temporal binaryb [2] =          -1 seed = -1432278126 media =0 sigma = 1
jitter temporal binaryb [1] =           1 seed = -1216916531 media =0 sigma = 1
jitter temporal binaryb [0] =          -1 seed = 1551485314 media =0 sigma = 1
jitter temporal therm [16] =           0 seed = 623861470 media =0 sigma = 1
jitter temporal therm [15] =          -1 seed = 947700570 media =0 sigma = 1
jitter temporal therm [14] =          -1 seed = -1991716830 media =0 sigma = 1
jitter temporal therm [13] =           0 seed = -72881096 media =0 sigma = 1
jitter temporal therm [12] =           0 seed = -943112472 media =0 sigma = 1
jitter temporal therm [11] =          -3 seed = -2028118634 media =0 sigma = 1
jitter temporal therm [10] =           0 seed = -591545105 media =0 sigma = 1
jitter temporal therm [9] =           0 seed = 420753007 media =0 sigma = 1
jitter temporal therm [8] =           0 seed = 546669529 media =0 sigma = 1
jitter temporal therm [7] =          -1 seed = -1536421724 media =0 sigma = 1
jitter temporal therm [6] =           0 seed = -90974166 media =0 sigma = 1
jitter temporal therm [5] =           1 seed = -1507146574 media =0 sigma = 1
jitter temporal therm [4] =          -1 seed = 1648109783 media =0 sigma = 1
jitter temporal therm [3] =          -1 seed = -1373204952 media =0 sigma = 1
jitter temporal therm [2] =          -2 seed = -1632533514 media =0 sigma = 1
jitter temporal therm [1] =           0 seed = -300837932 media =0 sigma = 1
jitter temporal therm [0] =           1 seed = 1517765809 media =0 sigma = 1
jitter temporal thermb [16] =           0 seed = -987158594 media =0 sigma = 1
jitter temporal thermb [15] =          -1 seed = 1445183995 media =0 sigma = 1
jitter temporal thermb [14] =           2 seed = 1992836180 media =0 sigma = 1
jitter temporal thermb [13] =           0 seed = 753131645 media =0 sigma = 1
jitter temporal thermb [12] =           0 seed = -672052060 media =0 sigma = 1
jitter temporal thermb [11] =           1 seed = -1512143473 media =0 sigma = 1
jitter temporal thermb [10] =           0 seed = 467542078 media =0 sigma = 1
jitter temporal thermb [9] =           0 seed = -1207492603 media =0 sigma = 1
jitter temporal thermb [8] =           1 seed = -1502560086 media =0 sigma = 1
jitter temporal thermb [7] =          -1 seed = 1599327234 media =0 sigma = 1
jitter temporal thermb [6] =           0 seed = 561584596 media =0 sigma = 1
jitter temporal thermb [5] =           0 seed = 1028882996 media =0 sigma = 1
jitter temporal thermb [4] =           2 seed = -1965897994 media =0 sigma = 1
jitter temporal thermb [3] =           0 seed = -462110982 media =0 sigma = 1
jitter temporal thermb [2] =           1 seed = 1700388460 media =0 sigma = 1
jitter temporal thermb [1] =           0 seed = 216404676 media =0 sigma = 1
jitter temporal thermb [0] =          -2 seed = -1639543735 media =0 sigma = 1
jitter temporal binary [5] =          -1 seed = -1780221592 media =0 sigma = 1
jitter temporal binary [4] =           0 seed = 385938655 media =0 sigma = 1
jitter temporal binary [3] =           0 seed = 575221335 media =0 sigma = 1
jitter temporal binary [2] =           0 seed = -1081957840 media =0 sigma = 1
jitter temporal binary [1] =           1 seed = 729235816 media =0 sigma = 1
jitter temporal binary [0] =           0 seed = -428715953 media =0 sigma = 1
jitter temporal binaryb [5] =           0 seed = 1182115443 media =0 sigma = 1
jitter temporal binaryb [4] =           0 seed = -659000156 media =0 sigma = 1
jitter temporal binaryb [3] =           1 seed = 1442506570 media =0 sigma = 1
jitter temporal binaryb [2] =           0 seed = -1573261465 media =0 sigma = 1
jitter temporal binaryb [1] =          -1 seed = 1866379282 media =0 sigma = 1
jitter temporal binaryb [0] =           0 seed = -725483043 media =0 sigma = 1
jitter temporal therm [16] =           2 seed = -1839496812 media =0 sigma = 1
jitter temporal therm [15] =           0 seed = -435933567 media =0 sigma = 1
jitter temporal therm [14] =           1 seed = -1551674534 media =0 sigma = 1
jitter temporal therm [13] =           0 seed = -1237179887 media =0 sigma = 1
jitter temporal therm [12] =           0 seed = 1062503358 media =0 sigma = 1
jitter temporal therm [11] =          -1 seed = -912330566 media =0 sigma = 1
jitter temporal therm [10] =           0 seed = 197027431 media =0 sigma = 1
jitter temporal therm [9] =           0 seed = 856222717 media =0 sigma = 1
jitter temporal therm [8] =           0 seed = 1347268557 media =0 sigma = 1
jitter temporal therm [7] =           1 seed = -855600481 media =0 sigma = 1
jitter temporal therm [6] =           3 seed = 2061229439 media =0 sigma = 1
jitter temporal therm [5] =          -1 seed = 804749055 media =0 sigma = 1
jitter temporal therm [4] =           1 seed = 1307178467 media =0 sigma = 1
jitter temporal therm [3] =          -1 seed = 869409863 media =0 sigma = 1
jitter temporal therm [2] =           0 seed = 1581684091 media =0 sigma = 1
jitter temporal therm [1] =           0 seed = -1285139383 media =0 sigma = 1
jitter temporal therm [0] =           1 seed = -1708339486 media =0 sigma = 1
jitter temporal thermb [16] =          -1 seed = -1317080911 media =0 sigma = 1
jitter temporal thermb [15] =           1 seed = -1365286578 media =0 sigma = 1
jitter temporal thermb [14] =           0 seed = 2073370409 media =0 sigma = 1
jitter temporal thermb [13] =           0 seed = -1460241779 media =0 sigma = 1
jitter temporal thermb [12] =           1 seed = 1889597655 media =0 sigma = 1
jitter temporal thermb [11] =           2 seed = -1948518676 media =0 sigma = 1
jitter temporal thermb [10] =           1 seed = -1251975098 media =0 sigma = 1
jitter temporal thermb [9] =           0 seed = -356364678 media =0 sigma = 1
jitter temporal thermb [8] =           0 seed = -739250492 media =0 sigma = 1
jitter temporal thermb [7] =           0 seed = 665151898 media =0 sigma = 1
jitter temporal thermb [6] =           0 seed = -2021218778 media =0 sigma = 1
jitter temporal thermb [5] =           2 seed = 1809549673 media =0 sigma = 1
jitter temporal thermb [4] =           0 seed = -208393005 media =0 sigma = 1
jitter temporal thermb [3] =           1 seed = -823416685 media =0 sigma = 1
jitter temporal thermb [2] =          -1 seed = 1622728884 media =0 sigma = 1
jitter temporal thermb [1] =           1 seed = 975878241 media =0 sigma = 1
jitter temporal thermb [0] =           1 seed = -1983167818 media =0 sigma = 1
jitter temporal binary [5] =          -1 seed = 1647132805 media =0 sigma = 1
jitter temporal binary [4] =          -3 seed = -2059552614 media =0 sigma = 1
jitter temporal binary [3] =           0 seed = -105793891 media =0 sigma = 1
jitter temporal binary [2] =           1 seed = -1785620824 media =0 sigma = 1
jitter temporal binary [1] =           0 seed = 459731696 media =0 sigma = 1
jitter temporal binary [0] =           0 seed = 2072128576 media =0 sigma = 1
jitter temporal binaryb [5] =          -1 seed = 912630623 media =0 sigma = 1
jitter temporal binaryb [4] =          -1 seed = 1729491962 media =0 sigma = 1
jitter temporal binaryb [3] =          -2 seed = -1836139347 media =0 sigma = 1
jitter temporal binaryb [2] =          -1 seed = 1018627567 media =0 sigma = 1
jitter temporal binaryb [1] =           1 seed = 1172382813 media =0 sigma = 1
jitter temporal binaryb [0] =           1 seed = -1720972812 media =0 sigma = 1
jitter temporal therm [16] =           0 seed = -722627719 media =0 sigma = 1
jitter temporal therm [15] =          -1 seed = -1282210734 media =0 sigma = 1
jitter temporal therm [14] =           2 seed = 1891518937 media =0 sigma = 1
jitter temporal therm [13] =           2 seed = 1628354022 media =0 sigma = 1
jitter temporal therm [12] =           1 seed = 1299042132 media =0 sigma = 1
jitter temporal therm [11] =          -1 seed = 1947905262 media =0 sigma = 1
jitter temporal therm [10] =           0 seed = 278798863 media =0 sigma = 1
jitter temporal therm [9] =          -1 seed = 1212736536 media =0 sigma = 1
jitter temporal therm [8] =           2 seed = 2002902033 media =0 sigma = 1
jitter temporal therm [7] =          -2 seed = 1756385606 media =0 sigma = 1
jitter temporal therm [6] =          -1 seed = -1218613863 media =0 sigma = 1
jitter temporal therm [5] =           1 seed = 1527643772 media =0 sigma = 1
jitter temporal therm [4] =          -1 seed = 1382685746 media =0 sigma = 1
jitter temporal therm [3] =           1 seed = 879685146 media =0 sigma = 1
jitter temporal therm [2] =          -1 seed = -1317785848 media =0 sigma = 1
jitter temporal therm [1] =           2 seed = 1787803000 media =0 sigma = 1
jitter temporal therm [0] =           1 seed = 1252518165 media =0 sigma = 1
jitter temporal thermb [16] =           2 seed = 1770954312 media =0 sigma = 1
jitter temporal thermb [15] =           0 seed = -242095127 media =0 sigma = 1
jitter temporal thermb [14] =          -1 seed = -1426663230 media =0 sigma = 1
jitter temporal thermb [13] =           0 seed = 554794630 media =0 sigma = 1
jitter temporal thermb [12] =           1 seed = 1395173851 media =0 sigma = 1
jitter temporal thermb [11] =           1 seed = -1312499027 media =0 sigma = 1
jitter temporal thermb [10] =          -1 seed = 1840186533 media =0 sigma = 1
jitter temporal thermb [9] =           0 seed = 975457965 media =0 sigma = 1
jitter temporal thermb [8] =           0 seed = -729043114 media =0 sigma = 1
jitter temporal thermb [7] =          -1 seed = -1058405529 media =0 sigma = 1
jitter temporal thermb [6] =           3 seed = 2090883761 media =0 sigma = 1
jitter temporal thermb [5] =          -1 seed = -817393133 media =0 sigma = 1
jitter temporal thermb [4] =           0 seed = 317519124 media =0 sigma = 1
jitter temporal thermb [3] =          -1 seed = -1691793136 media =0 sigma = 1
jitter temporal thermb [2] =          -1 seed = -1307441290 media =0 sigma = 1
jitter temporal thermb [1] =          -2 seed = 1748694007 media =0 sigma = 1
jitter temporal thermb [0] =           1 seed = 1541871302 media =0 sigma = 1
jitter temporal binary [5] =           2 seed = -1812570427 media =0 sigma = 1
jitter temporal binary [4] =           1 seed = 2105379813 media =0 sigma = 1
jitter temporal binary [3] =           0 seed = -322601260 media =0 sigma = 1
jitter temporal binary [2] =           0 seed = -319238208 media =0 sigma = 1
jitter temporal binary [1] =           0 seed = 1766432875 media =0 sigma = 1
jitter temporal binary [0] =          -1 seed = 1675104464 media =0 sigma = 1
jitter temporal binaryb [5] =           1 seed = -2020458831 media =0 sigma = 1
jitter temporal binaryb [4] =           0 seed = -342611964 media =0 sigma = 1
jitter temporal binaryb [3] =          -1 seed = -1408298481 media =0 sigma = 1
jitter temporal binaryb [2] =           2 seed = -2145773726 media =0 sigma = 1
jitter temporal binaryb [1] =           2 seed = 1942210274 media =0 sigma = 1
jitter temporal binaryb [0] =           0 seed = 1868816905 media =0 sigma = 1
atb1 = `wrealZState, atb0 = `wrealZState
Test 3: Estado encendido con atb_ena = 2'b01
jitter temporal therm [16] =           0 seed = -782781294 media =0 sigma = 1
jitter temporal therm [15] =           1 seed = -1573322272 media =0 sigma = 1
jitter temporal therm [14] =           0 seed = 823931921 media =0 sigma = 1
jitter temporal therm [13] =           1 seed = 1008063588 media =0 sigma = 1
jitter temporal therm [12] =           0 seed = 390969478 media =0 sigma = 1
jitter temporal therm [11] =           1 seed = -1789931091 media =0 sigma = 1
jitter temporal therm [10] =          -1 seed = -1120660340 media =0 sigma = 1
jitter temporal therm [9] =          -1 seed = 1465194946 media =0 sigma = 1
jitter temporal therm [8] =           0 seed = 228645548 media =0 sigma = 1
jitter temporal therm [7] =           2 seed = 2022291480 media =0 sigma = 1
jitter temporal therm [6] =           1 seed = -1763485436 media =0 sigma = 1
jitter temporal therm [5] =           1 seed = 1613615150 media =0 sigma = 1
jitter temporal therm [4] =           0 seed = -1942279800 media =0 sigma = 1
jitter temporal therm [3] =           1 seed = 1615840624 media =0 sigma = 1
jitter temporal therm [2] =          -2 seed = 1985242313 media =0 sigma = 1
jitter temporal therm [1] =           0 seed = -1033946556 media =0 sigma = 1
jitter temporal therm [0] =           0 seed = 428157963 media =0 sigma = 1
jitter temporal thermb [16] =          -1 seed = -1612197538 media =0 sigma = 1
jitter temporal thermb [15] =           1 seed = -1242467620 media =0 sigma = 1
jitter temporal thermb [14] =          -1 seed = 1067961977 media =0 sigma = 1
jitter temporal thermb [13] =          -2 seed = -1919116590 media =0 sigma = 1
jitter temporal thermb [12] =           1 seed = 1654636036 media =0 sigma = 1
jitter temporal thermb [11] =           1 seed = -1321478412 media =0 sigma = 1
jitter temporal thermb [10] =           1 seed = 1370043607 media =0 sigma = 1
jitter temporal thermb [9] =           0 seed = 631292518 media =0 sigma = 1
jitter temporal thermb [8] =          -2 seed = 2045881920 media =0 sigma = 1
jitter temporal thermb [7] =           0 seed = 794129923 media =0 sigma = 1
jitter temporal thermb [6] =           0 seed = -441849978 media =0 sigma = 1
jitter temporal thermb [5] =          -1 seed = -2082501854 media =0 sigma = 1
jitter temporal thermb [4] =          -1 seed = -1666728030 media =0 sigma = 1
jitter temporal thermb [3] =           0 seed = 746123444 media =0 sigma = 1
jitter temporal thermb [2] =           1 seed = -1348255718 media =0 sigma = 1
jitter temporal thermb [1] =           0 seed = -753322854 media =0 sigma = 1
jitter temporal thermb [0] =           1 seed = 1873573613 media =0 sigma = 1
jitter temporal binary [5] =          -2 seed = 1683922620 media =0 sigma = 1
jitter temporal binary [4] =           1 seed = 1486249360 media =0 sigma = 1
jitter temporal binary [3] =           0 seed = -78712795 media =0 sigma = 1
jitter temporal binary [2] =           0 seed = 599416644 media =0 sigma = 1
jitter temporal binary [1] =           2 seed = 1877679010 media =0 sigma = 1
jitter temporal binary [0] =           1 seed = 1061116333 media =0 sigma = 1
jitter temporal binaryb [5] =           1 seed = -1451224288 media =0 sigma = 1
jitter temporal binaryb [4] =           0 seed = 243133933 media =0 sigma = 1
jitter temporal binaryb [3] =           3 seed = -2080267448 media =0 sigma = 1
jitter temporal binaryb [2] =           0 seed = 672166349 media =0 sigma = 1
jitter temporal binaryb [1] =           1 seed = -924598952 media =0 sigma = 1
jitter temporal binaryb [0] =          -1 seed = -1454857086 media =0 sigma = 1
jitter temporal therm [16] =          -1 seed = -2142526717 media =0 sigma = 1
jitter temporal therm [15] =           0 seed = -655278953 media =0 sigma = 1
jitter temporal therm [14] =           0 seed = -876390436 media =0 sigma = 1
jitter temporal therm [13] =           1 seed = 1038370825 media =0 sigma = 1
jitter temporal therm [12] =           1 seed = 1407994458 media =0 sigma = 1
jitter temporal therm [11] =           1 seed = 1623165109 media =0 sigma = 1
jitter temporal therm [10] =           0 seed = 179261435 media =0 sigma = 1
jitter temporal therm [9] =           1 seed = 1380918058 media =0 sigma = 1
jitter temporal therm [8] =           1 seed = -1035133533 media =0 sigma = 1
jitter temporal therm [7] =           0 seed = -353397495 media =0 sigma = 1
jitter temporal therm [6] =           0 seed = 151541371 media =0 sigma = 1
jitter temporal therm [5] =          -1 seed = -1355526763 media =0 sigma = 1
jitter temporal therm [4] =           2 seed = 1916719327 media =0 sigma = 1
jitter temporal therm [3] =          -1 seed = -1203684726 media =0 sigma = 1
jitter temporal therm [2] =          -1 seed = 761237869 media =0 sigma = 1
jitter temporal therm [1] =           1 seed = 1544120784 media =0 sigma = 1
jitter temporal therm [0] =          -1 seed = -1143576907 media =0 sigma = 1
jitter temporal thermb [16] =          -1 seed = -1530466659 media =0 sigma = 1
jitter temporal thermb [15] =           3 seed = -2137546370 media =0 sigma = 1
jitter temporal thermb [14] =           0 seed = 1053703198 media =0 sigma = 1
jitter temporal thermb [13] =           0 seed = 866670451 media =0 sigma = 1
jitter temporal thermb [12] =           1 seed = -1120129223 media =0 sigma = 1
jitter temporal thermb [11] =           1 seed = -1919344207 media =0 sigma = 1
jitter temporal thermb [10] =           0 seed = 821163831 media =0 sigma = 1
jitter temporal thermb [9] =          -1 seed = -1573167411 media =0 sigma = 1
jitter temporal thermb [8] =           0 seed = 816890204 media =0 sigma = 1
jitter temporal thermb [7] =           0 seed = -679552438 media =0 sigma = 1
jitter temporal thermb [6] =           0 seed = 1089183889 media =0 sigma = 1
jitter temporal thermb [5] =           0 seed = -539360253 media =0 sigma = 1
jitter temporal thermb [4] =           0 seed = -177576831 media =0 sigma = 1
jitter temporal thermb [3] =          -2 seed = -2056897325 media =0 sigma = 1
jitter temporal thermb [2] =           1 seed = 775479030 media =0 sigma = 1
jitter temporal thermb [1] =          -1 seed = -1074108231 media =0 sigma = 1
jitter temporal thermb [0] =           1 seed = 1588212243 media =0 sigma = 1
jitter temporal binary [5] =           2 seed = -1630481291 media =0 sigma = 1
jitter temporal binary [4] =          -2 seed = 1802802042 media =0 sigma = 1
jitter temporal binary [3] =           0 seed = 1266075906 media =0 sigma = 1
jitter temporal binary [2] =          -1 seed = 2105155049 media =0 sigma = 1
jitter temporal binary [1] =          -1 seed = 996334762 media =0 sigma = 1
jitter temporal binary [0] =           2 seed = 1778380904 media =0 sigma = 1
jitter temporal binaryb [5] =          -2 seed = -1773410059 media =0 sigma = 1
jitter temporal binaryb [4] =           0 seed = 891975778 media =0 sigma = 1
jitter temporal binaryb [3] =           0 seed = -641152026 media =0 sigma = 1
jitter temporal binaryb [2] =           1 seed = -1844928713 media =0 sigma = 1
jitter temporal binaryb [1] =           1 seed = 1848265479 media =0 sigma = 1
jitter temporal binaryb [0] =          -2 seed = -2037808222 media =0 sigma = 1
jitter temporal therm [16] =          -1 seed = -1223356912 media =0 sigma = 1
jitter temporal therm [15] =           1 seed = -944695426 media =0 sigma = 1
jitter temporal therm [14] =           1 seed = 1926564135 media =0 sigma = 1
jitter temporal therm [13] =           0 seed = -681458353 media =0 sigma = 1
jitter temporal therm [12] =           0 seed = 143604115 media =0 sigma = 1
jitter temporal therm [11] =           2 seed = -2002592530 media =0 sigma = 1
jitter temporal therm [10] =           2 seed = 1840332192 media =0 sigma = 1
jitter temporal therm [9] =          -1 seed = 1009672880 media =0 sigma = 1
jitter temporal therm [8] =          -1 seed = -830584863 media =0 sigma = 1
jitter temporal therm [7] =           0 seed = 530959924 media =0 sigma = 1
jitter temporal therm [6] =           1 seed = 866778734 media =0 sigma = 1
jitter temporal therm [5] =           1 seed = 1880546009 media =0 sigma = 1
jitter temporal therm [4] =           1 seed = -1440311872 media =0 sigma = 1
jitter temporal therm [3] =           0 seed = -319706516 media =0 sigma = 1
jitter temporal therm [2] =          -2 seed = -1866205631 media =0 sigma = 1
jitter temporal therm [1] =           0 seed = -591233672 media =0 sigma = 1
jitter temporal therm [0] =           0 seed = 725746214 media =0 sigma = 1
jitter temporal thermb [16] =          -1 seed = -1048510774 media =0 sigma = 1
jitter temporal thermb [15] =          -1 seed = 1321109615 media =0 sigma = 1
jitter temporal thermb [14] =           0 seed = -1802780114 media =0 sigma = 1
jitter temporal thermb [13] =           1 seed = 1830005582 media =0 sigma = 1
jitter temporal thermb [12] =           0 seed = 629631260 media =0 sigma = 1
jitter temporal thermb [11] =           1 seed = 1271346986 media =0 sigma = 1
jitter temporal thermb [10] =           0 seed = -338377307 media =0 sigma = 1
jitter temporal thermb [9] =           0 seed = -982483438 media =0 sigma = 1
jitter temporal thermb [8] =          -1 seed = -1404896672 media =0 sigma = 1
jitter temporal thermb [7] =          -2 seed = 2072348813 media =0 sigma = 1
jitter temporal thermb [6] =           1 seed = 1262208642 media =0 sigma = 1
jitter temporal thermb [5] =           1 seed = -1095918324 media =0 sigma = 1
jitter temporal thermb [4] =           0 seed = -399833313 media =0 sigma = 1
jitter temporal thermb [3] =           0 seed = 855750036 media =0 sigma = 1
jitter temporal thermb [2] =          -2 seed = -1819881434 media =0 sigma = 1
jitter temporal thermb [1] =          -1 seed = 1202650962 media =0 sigma = 1
jitter temporal thermb [0] =           0 seed = -415602951 media =0 sigma = 1
jitter temporal binary [5] =          -1 seed = 966862969 media =0 sigma = 1
jitter temporal binary [4] =           1 seed = 834827150 media =0 sigma = 1
jitter temporal binary [3] =           1 seed = -1618800505 media =0 sigma = 1
jitter temporal binary [2] =           1 seed = 803299221 media =0 sigma = 1
jitter temporal binary [1] =          -2 seed = -1628319612 media =0 sigma = 1
jitter temporal binary [0] =          -2 seed = 2122276541 media =0 sigma = 1
jitter temporal binaryb [5] =           0 seed = 806266819 media =0 sigma = 1
jitter temporal binaryb [4] =           0 seed = -812034839 media =0 sigma = 1
jitter temporal binaryb [3] =           0 seed = 630143630 media =0 sigma = 1
jitter temporal binaryb [2] =          -2 seed = 2069533256 media =0 sigma = 1
jitter temporal binaryb [1] =           0 seed = 412775786 media =0 sigma = 1
jitter temporal binaryb [0] =           0 seed = 435319535 media =0 sigma = 1
jitter temporal therm [16] =           0 seed = 714491268 media =0 sigma = 1
jitter temporal therm [15] =           0 seed = -247359507 media =0 sigma = 1
jitter temporal therm [14] =          -1 seed = -2071886925 media =0 sigma = 1
jitter temporal therm [13] =          -1 seed = 1468778682 media =0 sigma = 1
jitter temporal therm [12] =          -1 seed = 1684169761 media =0 sigma = 1
jitter temporal therm [11] =          -3 seed = -2045291293 media =0 sigma = 1
jitter temporal therm [10] =          -1 seed = -874266277 media =0 sigma = 1
jitter temporal therm [9] =           1 seed = -1758384191 media =0 sigma = 1
jitter temporal therm [8] =           0 seed = -588691352 media =0 sigma = 1
jitter temporal therm [7] =           0 seed = 1508250047 media =0 sigma = 1
jitter temporal therm [6] =           1 seed = -1913210952 media =0 sigma = 1
jitter temporal therm [5] =           0 seed = -1017517007 media =0 sigma = 1
jitter temporal therm [4] =           0 seed = -404565814 media =0 sigma = 1
jitter temporal therm [3] =          -1 seed = 831523819 media =0 sigma = 1
jitter temporal therm [2] =           0 seed = -197714497 media =0 sigma = 1
jitter temporal therm [1] =           1 seed = -1236289776 media =0 sigma = 1
jitter temporal therm [0] =           1 seed = -1469847612 media =0 sigma = 1
jitter temporal thermb [16] =           0 seed = -1069334403 media =0 sigma = 1
jitter temporal thermb [15] =           0 seed = 1097658554 media =0 sigma = 1
jitter temporal thermb [14] =           1 seed = -1094186514 media =0 sigma = 1
jitter temporal thermb [13] =           1 seed = 1534349602 media =0 sigma = 1
jitter temporal thermb [12] =           0 seed = 561776682 media =0 sigma = 1
jitter temporal thermb [11] =           0 seed = -635553319 media =0 sigma = 1
jitter temporal thermb [10] =          -1 seed = -1100236935 media =0 sigma = 1
jitter temporal thermb [9] =           0 seed = -1986442609 media =0 sigma = 1
jitter temporal thermb [8] =          -1 seed = -1315501582 media =0 sigma = 1
jitter temporal thermb [7] =          -1 seed = -1133677004 media =0 sigma = 1
jitter temporal thermb [6] =          -1 seed = 1076112250 media =0 sigma = 1
jitter temporal thermb [5] =          -1 seed = 1369259006 media =0 sigma = 1
jitter temporal thermb [4] =           1 seed = 1581061668 media =0 sigma = 1
jitter temporal thermb [3] =          -1 seed = 1299549942 media =0 sigma = 1
jitter temporal thermb [2] =           0 seed = -1574025877 media =0 sigma = 1
jitter temporal thermb [1] =           1 seed = -1654828354 media =0 sigma = 1
jitter temporal thermb [0] =           0 seed = -1113012195 media =0 sigma = 1
jitter temporal binary [5] =          -1 seed = -1203231203 media =0 sigma = 1
jitter temporal binary [4] =           1 seed = 2070427240 media =0 sigma = 1
jitter temporal binary [3] =           1 seed = 1899657485 media =0 sigma = 1
jitter temporal binary [2] =           1 seed = -1743916092 media =0 sigma = 1
jitter temporal binary [1] =           1 seed = 1598056150 media =0 sigma = 1
jitter temporal binary [0] =           1 seed = 1715777649 media =0 sigma = 1
jitter temporal binaryb [5] =           1 seed = -1343538797 media =0 sigma = 1
jitter temporal binaryb [4] =           0 seed = -407472576 media =0 sigma = 1
jitter temporal binaryb [3] =           1 seed = -809161324 media =0 sigma = 1
jitter temporal binaryb [2] =          -2 seed = -1867864040 media =0 sigma = 1
jitter temporal binaryb [1] =           0 seed = -303715725 media =0 sigma = 1
jitter temporal binaryb [0] =          -1 seed = -1021844634 media =0 sigma = 1
jitter temporal therm [16] =           1 seed = -913286735 media =0 sigma = 1
jitter temporal therm [15] =           0 seed = 1616715977 media =0 sigma = 1
jitter temporal therm [14] =          -1 seed = -1995376623 media =0 sigma = 1
jitter temporal therm [13] =           2 seed = -1954311262 media =0 sigma = 1
jitter temporal therm [12] =           2 seed = -1832344561 media =0 sigma = 1
jitter temporal therm [11] =           0 seed = 1398575074 media =0 sigma = 1
jitter temporal therm [10] =           0 seed = -261789627 media =0 sigma = 1
jitter temporal therm [9] =          -1 seed = -2089520284 media =0 sigma = 1
jitter temporal therm [8] =           0 seed = 613274758 media =0 sigma = 1
jitter temporal therm [7] =           0 seed = 169527191 media =0 sigma = 1
jitter temporal therm [6] =           0 seed = -706522125 media =0 sigma = 1
jitter temporal therm [5] =           1 seed = -813424435 media =0 sigma = 1
jitter temporal therm [4] =          -1 seed = 1409606389 media =0 sigma = 1
jitter temporal therm [3] =           1 seed = -1095073982 media =0 sigma = 1
jitter temporal therm [2] =           2 seed = 1999182810 media =0 sigma = 1
jitter temporal therm [1] =           1 seed = -1117505490 media =0 sigma = 1
jitter temporal therm [0] =           1 seed = -1305477130 media =0 sigma = 1
jitter temporal thermb [16] =          -1 seed = 2006205211 media =0 sigma = 1
jitter temporal thermb [15] =          -1 seed = 1349797218 media =0 sigma = 1
jitter temporal thermb [14] =           0 seed = -1581676011 media =0 sigma = 1
jitter temporal thermb [13] =          -2 seed = -1938925649 media =0 sigma = 1
jitter temporal thermb [12] =          -1 seed = -1483982839 media =0 sigma = 1
jitter temporal thermb [11] =           1 seed = -1903588700 media =0 sigma = 1
jitter temporal thermb [10] =           0 seed = 110473068 media =0 sigma = 1
jitter temporal thermb [9] =          -1 seed = 1476929196 media =0 sigma = 1
jitter temporal thermb [8] =          -2 seed = -2047236145 media =0 sigma = 1
jitter temporal thermb [7] =          -1 seed = 2069461347 media =0 sigma = 1
jitter temporal thermb [6] =          -1 seed = 1613747141 media =0 sigma = 1
jitter temporal thermb [5] =           1 seed = 1549148611 media =0 sigma = 1
jitter temporal thermb [4] =          -2 seed = -2054543269 media =0 sigma = 1
jitter temporal thermb [3] =           1 seed = -1385933478 media =0 sigma = 1
jitter temporal thermb [2] =          -1 seed = -732391233 media =0 sigma = 1
jitter temporal thermb [1] =           0 seed = -1201857809 media =0 sigma = 1
jitter temporal thermb [0] =           1 seed = -1886622634 media =0 sigma = 1
jitter temporal binary [5] =           0 seed = -319502275 media =0 sigma = 1
jitter temporal binary [4] =           1 seed = -1304556117 media =0 sigma = 1
jitter temporal binary [3] =           0 seed = 280829602 media =0 sigma = 1
jitter temporal binary [2] =           1 seed = -1502631143 media =0 sigma = 1
jitter temporal binary [1] =           1 seed = 2034675389 media =0 sigma = 1
jitter temporal binary [0] =           0 seed = 1017266693 media =0 sigma = 1
jitter temporal binaryb [5] =           0 seed = 697293175 media =0 sigma = 1
jitter temporal binaryb [4] =          -1 seed = 1411539191 media =0 sigma = 1
jitter temporal binaryb [3] =          -1 seed = -1266457212 media =0 sigma = 1
jitter temporal binaryb [2] =           1 seed = 1578494195 media =0 sigma = 1
jitter temporal binaryb [1] =          -1 seed = 1176005799 media =0 sigma = 1
jitter temporal binaryb [0] =           0 seed = -1358174663 media =0 sigma = 1
atb1 = 0.80, atb0 = 0.00
Test 4: Estado encendido con atb_ena = 2'b10
jitter temporal therm [16] =           1 seed = -1149344495 media =0 sigma = 1
jitter temporal therm [15] =           1 seed = 1086836525 media =0 sigma = 1
jitter temporal therm [14] =          -1 seed = 1147602193 media =0 sigma = 1
jitter temporal therm [13] =           0 seed = -324159891 media =0 sigma = 1
jitter temporal therm [12] =           0 seed = 962349220 media =0 sigma = 1
jitter temporal therm [11] =           0 seed = -1200312914 media =0 sigma = 1
jitter temporal therm [10] =           1 seed = -1440436348 media =0 sigma = 1
jitter temporal therm [9] =           1 seed = -897883882 media =0 sigma = 1
jitter temporal therm [8] =          -1 seed = -1081071527 media =0 sigma = 1
jitter temporal therm [7] =           0 seed = -341550344 media =0 sigma = 1
jitter temporal therm [6] =          -1 seed = -2064473145 media =0 sigma = 1
jitter temporal therm [5] =          -2 seed = 1738687982 media =0 sigma = 1
jitter temporal therm [4] =           1 seed = -1424158885 media =0 sigma = 1
jitter temporal therm [3] =          -1 seed = -1788889057 media =0 sigma = 1
jitter temporal therm [2] =           0 seed = -553208740 media =0 sigma = 1
jitter temporal therm [1] =          -1 seed = -927694133 media =0 sigma = 1
jitter temporal therm [0] =           1 seed = -1434702741 media =0 sigma = 1
jitter temporal thermb [16] =           0 seed = 247374588 media =0 sigma = 1
jitter temporal thermb [15] =           0 seed = 1279543833 media =0 sigma = 1
jitter temporal thermb [14] =          -1 seed = -2020956141 media =0 sigma = 1
jitter temporal thermb [13] =           0 seed = -531775146 media =0 sigma = 1
jitter temporal thermb [12] =           0 seed = -474879300 media =0 sigma = 1
jitter temporal thermb [11] =          -1 seed = -1856317514 media =0 sigma = 1
jitter temporal thermb [10] =           0 seed = -658156177 media =0 sigma = 1
jitter temporal thermb [9] =           0 seed = -767809819 media =0 sigma = 1
jitter temporal thermb [8] =           0 seed = 1399143998 media =0 sigma = 1
jitter temporal thermb [7] =          -1 seed = -1968235861 media =0 sigma = 1
jitter temporal thermb [6] =          -2 seed = -1878283124 media =0 sigma = 1
jitter temporal thermb [5] =          -1 seed = -1153891679 media =0 sigma = 1
jitter temporal thermb [4] =           1 seed = 1659333910 media =0 sigma = 1
jitter temporal thermb [3] =           1 seed = 1982786512 media =0 sigma = 1
jitter temporal thermb [2] =          -1 seed = 1627463456 media =0 sigma = 1
jitter temporal thermb [1] =          -1 seed = -1006307362 media =0 sigma = 1
jitter temporal thermb [0] =          -1 seed = 1534666451 media =0 sigma = 1
jitter temporal binary [5] =          -2 seed = 2007319436 media =0 sigma = 1
jitter temporal binary [4] =           0 seed = 935020915 media =0 sigma = 1
jitter temporal binary [3] =           1 seed = 1560551476 media =0 sigma = 1
jitter temporal binary [2] =           1 seed = 1572806543 media =0 sigma = 1
jitter temporal binary [1] =           1 seed = 1678133160 media =0 sigma = 1
jitter temporal binary [0] =           0 seed = 1080425366 media =0 sigma = 1
jitter temporal binaryb [5] =           1 seed = 1602700529 media =0 sigma = 1
jitter temporal binaryb [4] =           0 seed = 992624930 media =0 sigma = 1
jitter temporal binaryb [3] =           0 seed = 1188552742 media =0 sigma = 1
jitter temporal binaryb [2] =           0 seed = -281681530 media =0 sigma = 1
jitter temporal binaryb [1] =           0 seed = -422431533 media =0 sigma = 1
jitter temporal binaryb [0] =           0 seed = 614960723 media =0 sigma = 1
jitter temporal therm [16] =          -1 seed = -1609097535 media =0 sigma = 1
jitter temporal therm [15] =           0 seed = -87999761 media =0 sigma = 1
jitter temporal therm [14] =          -2 seed = 1746149153 media =0 sigma = 1
jitter temporal therm [13] =           0 seed = 875981275 media =0 sigma = 1
jitter temporal therm [12] =           1 seed = -1009799528 media =0 sigma = 1
jitter temporal therm [11] =           1 seed = -1420283058 media =0 sigma = 1
jitter temporal therm [10] =           2 seed = -1930266250 media =0 sigma = 1
jitter temporal therm [9] =          -1 seed = 1521524746 media =0 sigma = 1
jitter temporal therm [8] =           1 seed = 2101753257 media =0 sigma = 1
jitter temporal therm [7] =           0 seed = -1759474662 media =0 sigma = 1
jitter temporal therm [6] =           0 seed = 526178778 media =0 sigma = 1
jitter temporal therm [5] =          -1 seed = -1664206260 media =0 sigma = 1
jitter temporal therm [4] =           1 seed = -1944084846 media =0 sigma = 1
jitter temporal therm [3] =           0 seed = 1226940649 media =0 sigma = 1
jitter temporal therm [2] =           0 seed = -1765890639 media =0 sigma = 1
jitter temporal therm [1] =           1 seed = -1479587807 media =0 sigma = 1
jitter temporal therm [0] =           0 seed = 1613284613 media =0 sigma = 1
jitter temporal thermb [16] =           0 seed = 230134331 media =0 sigma = 1
jitter temporal thermb [15] =           0 seed = 815642698 media =0 sigma = 1
jitter temporal thermb [14] =          -1 seed = -838883759 media =0 sigma = 1
jitter temporal thermb [13] =           2 seed = -1991125141 media =0 sigma = 1
jitter temporal thermb [12] =          -1 seed = 1256245619 media =0 sigma = 1
jitter temporal thermb [11] =           0 seed = 1330502261 media =0 sigma = 1
jitter temporal thermb [10] =           1 seed = 1168929411 media =0 sigma = 1
jitter temporal thermb [9] =          -1 seed = 1169400012 media =0 sigma = 1
jitter temporal thermb [8] =          -1 seed = -1042242599 media =0 sigma = 1
jitter temporal thermb [7] =           1 seed = 775711776 media =0 sigma = 1
jitter temporal thermb [6] =           0 seed = 96567794 media =0 sigma = 1
jitter temporal thermb [5] =           0 seed = 1116709830 media =0 sigma = 1
jitter temporal thermb [4] =          -1 seed = -1997199658 media =0 sigma = 1
jitter temporal thermb [3] =           0 seed = 898218149 media =0 sigma = 1
jitter temporal thermb [2] =          -1 seed = -1240410693 media =0 sigma = 1
jitter temporal thermb [1] =           1 seed = 1095868011 media =0 sigma = 1
jitter temporal thermb [0] =           0 seed = 728211396 media =0 sigma = 1
jitter temporal binary [5] =           0 seed = -378987700 media =0 sigma = 1
jitter temporal binary [4] =          -1 seed = 1027259729 media =0 sigma = 1
jitter temporal binary [3] =           0 seed = -132686291 media =0 sigma = 1
jitter temporal binary [2] =           0 seed = 440949495 media =0 sigma = 1
jitter temporal binary [1] =           0 seed = -734577954 media =0 sigma = 1
jitter temporal binary [0] =           1 seed = 1412985034 media =0 sigma = 1
jitter temporal binaryb [5] =          -2 seed = 1920199027 media =0 sigma = 1
jitter temporal binaryb [4] =           0 seed = 897519056 media =0 sigma = 1
jitter temporal binaryb [3] =           0 seed = 682125074 media =0 sigma = 1
jitter temporal binaryb [2] =          -1 seed = 1140774831 media =0 sigma = 1
jitter temporal binaryb [1] =          -1 seed = -1687222554 media =0 sigma = 1
jitter temporal binaryb [0] =           0 seed = 717002343 media =0 sigma = 1
jitter temporal therm [16] =          -2 seed = -1724979321 media =0 sigma = 1
jitter temporal therm [15] =           1 seed = 1620429115 media =0 sigma = 1
jitter temporal therm [14] =           1 seed = 1509263112 media =0 sigma = 1
jitter temporal therm [13] =          -1 seed = 1586566185 media =0 sigma = 1
jitter temporal therm [12] =           0 seed = -297680802 media =0 sigma = 1
jitter temporal therm [11] =           1 seed = -1484540560 media =0 sigma = 1
jitter temporal therm [10] =           0 seed = 1078288698 media =0 sigma = 1
jitter temporal therm [9] =           0 seed = 476031360 media =0 sigma = 1
jitter temporal therm [8] =           0 seed = 352561249 media =0 sigma = 1
jitter temporal therm [7] =           0 seed = 339530857 media =0 sigma = 1
jitter temporal therm [6] =          -1 seed = -1715288096 media =0 sigma = 1
jitter temporal therm [5] =           0 seed = -144602643 media =0 sigma = 1
jitter temporal therm [4] =           1 seed = 806549836 media =0 sigma = 1
jitter temporal therm [3] =          -2 seed = -1959479192 media =0 sigma = 1
jitter temporal therm [2] =           0 seed = -1785300275 media =0 sigma = 1
jitter temporal therm [1] =          -2 seed = -1760339399 media =0 sigma = 1
jitter temporal therm [0] =           0 seed = -741559499 media =0 sigma = 1
jitter temporal thermb [16] =           1 seed = -1191344393 media =0 sigma = 1
jitter temporal thermb [15] =           1 seed = -1696883387 media =0 sigma = 1
jitter temporal thermb [14] =          -1 seed = 1591974071 media =0 sigma = 1
jitter temporal thermb [13] =           1 seed = -1194614902 media =0 sigma = 1
jitter temporal thermb [12] =           2 seed = 1847194545 media =0 sigma = 1
jitter temporal thermb [11] =          -1 seed = 1179112069 media =0 sigma = 1
jitter temporal thermb [10] =          -2 seed = -1681705412 media =0 sigma = 1
jitter temporal thermb [9] =          -1 seed = -1887546480 media =0 sigma = 1
jitter temporal thermb [8] =           0 seed = 487378835 media =0 sigma = 1
jitter temporal thermb [7] =           0 seed = -479352988 media =0 sigma = 1
jitter temporal thermb [6] =          -1 seed = 1774187014 media =0 sigma = 1
jitter temporal thermb [5] =           1 seed = 1465220416 media =0 sigma = 1
jitter temporal thermb [4] =           0 seed = -2037299594 media =0 sigma = 1
jitter temporal thermb [3] =           0 seed = 195346566 media =0 sigma = 1
jitter temporal thermb [2] =          -1 seed = 1772701818 media =0 sigma = 1
jitter temporal thermb [1] =           0 seed = -241989277 media =0 sigma = 1
jitter temporal thermb [0] =          -1 seed = -1576463778 media =0 sigma = 1
jitter temporal binary [5] =           0 seed = -600317991 media =0 sigma = 1
jitter temporal binary [4] =           0 seed = 514288533 media =0 sigma = 1
jitter temporal binary [3] =           0 seed = 473007226 media =0 sigma = 1
jitter temporal binary [2] =           0 seed = 628680427 media =0 sigma = 1
jitter temporal binary [1] =           0 seed = 494685382 media =0 sigma = 1
jitter temporal binary [0] =           0 seed = 920140497 media =0 sigma = 1
jitter temporal binaryb [5] =          -1 seed = -1595964897 media =0 sigma = 1
jitter temporal binaryb [4] =           0 seed = -357426045 media =0 sigma = 1
jitter temporal binaryb [3] =          -1 seed = -1529205315 media =0 sigma = 1
jitter temporal binaryb [2] =          -1 seed = -1352203687 media =0 sigma = 1
jitter temporal binaryb [1] =          -2 seed = -1796250194 media =0 sigma = 1
jitter temporal binaryb [0] =          -1 seed = 1444305353 media =0 sigma = 1
jitter temporal therm [16] =          -1 seed = 897330670 media =0 sigma = 1
jitter temporal therm [15] =           0 seed = 545630748 media =0 sigma = 1
jitter temporal therm [14] =           0 seed = -523493050 media =0 sigma = 1
jitter temporal therm [13] =          -2 seed = -1753355345 media =0 sigma = 1
jitter temporal therm [12] =          -1 seed = 1862331021 media =0 sigma = 1
jitter temporal therm [11] =          -1 seed = -1020771887 media =0 sigma = 1
jitter temporal therm [10] =           1 seed = -1607183064 media =0 sigma = 1
jitter temporal therm [9] =          -1 seed = -1385591905 media =0 sigma = 1
jitter temporal therm [8] =           0 seed = -373624555 media =0 sigma = 1
jitter temporal therm [7] =           0 seed = 47773220 media =0 sigma = 1
jitter temporal therm [6] =           1 seed = 803093301 media =0 sigma = 1
jitter temporal therm [5] =           2 seed = -2094064726 media =0 sigma = 1
jitter temporal therm [4] =           0 seed = -126621261 media =0 sigma = 1
jitter temporal therm [3] =          -1 seed = 951181647 media =0 sigma = 1
jitter temporal therm [2] =           0 seed = -1184899705 media =0 sigma = 1
jitter temporal therm [1] =           0 seed = 1868045378 media =0 sigma = 1
jitter temporal therm [0] =           1 seed = 695333255 media =0 sigma = 1
jitter temporal thermb [16] =           0 seed = 421558046 media =0 sigma = 1
jitter temporal thermb [15] =           1 seed = -1341965584 media =0 sigma = 1
jitter temporal thermb [14] =          -1 seed = 1340112536 media =0 sigma = 1
jitter temporal thermb [13] =           1 seed = 1729538291 media =0 sigma = 1
jitter temporal thermb [12] =           1 seed = 1375615318 media =0 sigma = 1
jitter temporal thermb [11] =          -1 seed = 1024715394 media =0 sigma = 1
jitter temporal thermb [10] =          -1 seed = -1032980663 media =0 sigma = 1
jitter temporal thermb [9] =          -2 seed = 2013399542 media =0 sigma = 1
jitter temporal thermb [8] =           1 seed = 1302871880 media =0 sigma = 1
jitter temporal thermb [7] =          -1 seed = 1919971688 media =0 sigma = 1
jitter temporal thermb [6] =           2 seed = 1988010694 media =0 sigma = 1
jitter temporal thermb [5] =           1 seed = -1626919103 media =0 sigma = 1
jitter temporal thermb [4] =           0 seed = 938352522 media =0 sigma = 1
jitter temporal thermb [3] =           1 seed = -1354210783 media =0 sigma = 1
jitter temporal thermb [2] =          -1 seed = 1095849229 media =0 sigma = 1
jitter temporal thermb [1] =           0 seed = 384545826 media =0 sigma = 1
jitter temporal thermb [0] =          -1 seed = -1705994808 media =0 sigma = 1
jitter temporal binary [5] =           0 seed = 892429579 media =0 sigma = 1
jitter temporal binary [4] =           2 seed = -1937837668 media =0 sigma = 1
jitter temporal binary [3] =           0 seed = -951317953 media =0 sigma = 1
jitter temporal binary [2] =           0 seed = -613715451 media =0 sigma = 1
jitter temporal binary [1] =          -1 seed = -2111674723 media =0 sigma = 1
jitter temporal binary [0] =           0 seed = -347630143 media =0 sigma = 1
jitter temporal binaryb [5] =           1 seed = 843158849 media =0 sigma = 1
jitter temporal binaryb [4] =           1 seed = 1466931780 media =0 sigma = 1
jitter temporal binaryb [3] =           0 seed = 242280285 media =0 sigma = 1
jitter temporal binaryb [2] =           1 seed = -1411886690 media =0 sigma = 1
jitter temporal binaryb [1] =           0 seed = -94613244 media =0 sigma = 1
jitter temporal binaryb [0] =           0 seed = -719426050 media =0 sigma = 1
jitter temporal therm [16] =          -2 seed = 1678971728 media =0 sigma = 1
jitter temporal therm [15] =           0 seed = 633826184 media =0 sigma = 1
jitter temporal therm [14] =           0 seed = 719533137 media =0 sigma = 1
jitter temporal therm [13] =          -2 seed = -1750309920 media =0 sigma = 1
jitter temporal therm [12] =           0 seed = 241259840 media =0 sigma = 1
jitter temporal therm [11] =           0 seed = 309483834 media =0 sigma = 1
jitter temporal therm [10] =           1 seed = 1102942983 media =0 sigma = 1
jitter temporal therm [9] =          -1 seed = 1023472953 media =0 sigma = 1
jitter temporal therm [8] =           1 seed = -1590867471 media =0 sigma = 1
jitter temporal therm [7] =          -2 seed = 1940697873 media =0 sigma = 1
jitter temporal therm [6] =           2 seed = -1625782528 media =0 sigma = 1
jitter temporal therm [5] =          -2 seed = 1767231680 media =0 sigma = 1
jitter temporal therm [4] =           0 seed = -1218449106 media =0 sigma = 1
jitter temporal therm [3] =          -1 seed = -1114162516 media =0 sigma = 1
jitter temporal therm [2] =           1 seed = -1552474956 media =0 sigma = 1
jitter temporal therm [1] =           1 seed = -938762537 media =0 sigma = 1
jitter temporal therm [0] =          -2 seed = -2089106819 media =0 sigma = 1
jitter temporal thermb [16] =          -1 seed = -2079119682 media =0 sigma = 1
jitter temporal thermb [15] =           1 seed = 1214311019 media =0 sigma = 1
jitter temporal thermb [14] =           0 seed = 1803486324 media =0 sigma = 1
jitter temporal thermb [13] =           0 seed = -273624152 media =0 sigma = 1
jitter temporal thermb [12] =           1 seed = 1534088169 media =0 sigma = 1
jitter temporal thermb [11] =          -1 seed = 1492465150 media =0 sigma = 1
jitter temporal thermb [10] =           0 seed = 541408934 media =0 sigma = 1
jitter temporal thermb [9] =           0 seed = 282593122 media =0 sigma = 1
jitter temporal thermb [8] =           1 seed = -1566582353 media =0 sigma = 1
jitter temporal thermb [7] =          -1 seed = 999217377 media =0 sigma = 1
jitter temporal thermb [6] =           1 seed = -1139753123 media =0 sigma = 1
jitter temporal thermb [5] =          -1 seed = -2035349066 media =0 sigma = 1
jitter temporal thermb [4] =          -1 seed = -1386496131 media =0 sigma = 1
jitter temporal thermb [3] =          -1 seed = -1420424288 media =0 sigma = 1
jitter temporal thermb [2] =           0 seed = 943829610 media =0 sigma = 1
jitter temporal thermb [1] =           2 seed = -1751674898 media =0 sigma = 1
jitter temporal thermb [0] =          -1 seed = 1613290200 media =0 sigma = 1
jitter temporal binary [5] =           0 seed = 804166807 media =0 sigma = 1
jitter temporal binary [4] =           0 seed = 1489808293 media =0 sigma = 1
jitter temporal binary [3] =          -1 seed = 1627629115 media =0 sigma = 1
jitter temporal binary [2] =           1 seed = 1088541541 media =0 sigma = 1
jitter temporal binary [1] =          -1 seed = 1590436725 media =0 sigma = 1
jitter temporal binary [0] =           0 seed = -645567174 media =0 sigma = 1
jitter temporal binaryb [5] =           0 seed = -262641550 media =0 sigma = 1
jitter temporal binaryb [4] =           1 seed = 1435239794 media =0 sigma = 1
jitter temporal binaryb [3] =           0 seed = -550060639 media =0 sigma = 1
jitter temporal binaryb [2] =           1 seed = 1007759506 media =0 sigma = 1
jitter temporal binaryb [1] =          -1 seed = -1061971331 media =0 sigma = 1
jitter temporal binaryb [0] =          -1 seed = -1967243541 media =0 sigma = 1
atb1 = 0.80, atb0 = 0.00
Test 5: Estado encendido con atb_ena = 2'b11
jitter temporal therm [16] =           0 seed = 1318916393 media =0 sigma = 1
jitter temporal therm [15] =           1 seed = 1086084880 media =0 sigma = 1
jitter temporal therm [14] =           1 seed = -1307846413 media =0 sigma = 1
jitter temporal therm [13] =           0 seed = 469212145 media =0 sigma = 1
jitter temporal therm [12] =           0 seed = 476769347 media =0 sigma = 1
jitter temporal therm [11] =           0 seed = 547235443 media =0 sigma = 1
jitter temporal therm [10] =           1 seed = -976069737 media =0 sigma = 1
jitter temporal therm [9] =          -1 seed = -1834461331 media =0 sigma = 1
jitter temporal therm [8] =          -1 seed = 2106877683 media =0 sigma = 1
jitter temporal therm [7] =           0 seed = -159749407 media =0 sigma = 1
jitter temporal therm [6] =           1 seed = -1309533631 media =0 sigma = 1
jitter temporal therm [5] =          -2 seed = -1948592102 media =0 sigma = 1
jitter temporal therm [4] =           2 seed = 2104625534 media =0 sigma = 1
jitter temporal therm [3] =           0 seed = -1102294449 media =0 sigma = 1
jitter temporal therm [2] =           0 seed = 1679345995 media =0 sigma = 1
jitter temporal therm [1] =           1 seed = 1886009724 media =0 sigma = 1
jitter temporal therm [0] =           0 seed = -54655866 media =0 sigma = 1
jitter temporal thermb [16] =           2 seed = 1818204033 media =0 sigma = 1
jitter temporal thermb [15] =           0 seed = -1212170899 media =0 sigma = 1
jitter temporal thermb [14] =           0 seed = -1634794116 media =0 sigma = 1
jitter temporal thermb [13] =          -1 seed = -1974977209 media =0 sigma = 1
jitter temporal thermb [12] =          -1 seed = -1876888972 media =0 sigma = 1
jitter temporal thermb [11] =           2 seed = 1851738889 media =0 sigma = 1
jitter temporal thermb [10] =          -2 seed = -2110523260 media =0 sigma = 1
jitter temporal thermb [9] =          -1 seed = 1558378425 media =0 sigma = 1
jitter temporal thermb [8] =           1 seed = -1835836698 media =0 sigma = 1
jitter temporal thermb [7] =           0 seed = 547652617 media =0 sigma = 1
jitter temporal thermb [6] =           0 seed = -335676661 media =0 sigma = 1
jitter temporal thermb [5] =           1 seed = 1488506791 media =0 sigma = 1
jitter temporal thermb [4] =          -2 seed = 1900202587 media =0 sigma = 1
jitter temporal thermb [3] =           0 seed = 433272103 media =0 sigma = 1
jitter temporal thermb [2] =          -1 seed = -1172904608 media =0 sigma = 1
jitter temporal thermb [1] =           0 seed = -162328872 media =0 sigma = 1
jitter temporal thermb [0] =           1 seed = 1316958749 media =0 sigma = 1
jitter temporal binary [5] =           2 seed = 2106241132 media =0 sigma = 1
jitter temporal binary [4] =           0 seed = -279848043 media =0 sigma = 1
jitter temporal binary [3] =          -1 seed = 1575165728 media =0 sigma = 1
jitter temporal binary [2] =           0 seed = 1271016473 media =0 sigma = 1
jitter temporal binary [1] =           0 seed = -125739753 media =0 sigma = 1
jitter temporal binary [0] =          -2 seed = -1869779333 media =0 sigma = 1
jitter temporal binaryb [5] =           1 seed = 1729846609 media =0 sigma = 1
jitter temporal binaryb [4] =          -1 seed = -958400907 media =0 sigma = 1
jitter temporal binaryb [3] =           0 seed = 793927465 media =0 sigma = 1
jitter temporal binaryb [2] =           0 seed = -83639747 media =0 sigma = 1
jitter temporal binaryb [1] =          -1 seed = 1174442302 media =0 sigma = 1
jitter temporal binaryb [0] =           0 seed = 1187251253 media =0 sigma = 1
jitter temporal therm [16] =           0 seed = 300793082 media =0 sigma = 1
jitter temporal therm [15] =           0 seed = 179496723 media =0 sigma = 1
jitter temporal therm [14] =           1 seed = -1203464780 media =0 sigma = 1
jitter temporal therm [13] =          -1 seed = -2118519781 media =0 sigma = 1
jitter temporal therm [12] =           1 seed = 1850457268 media =0 sigma = 1
jitter temporal therm [11] =          -1 seed = -2140970311 media =0 sigma = 1
jitter temporal therm [10] =          -1 seed = 1325878256 media =0 sigma = 1
jitter temporal therm [9] =           0 seed = -334404622 media =0 sigma = 1
jitter temporal therm [8] =          -1 seed = -1138387965 media =0 sigma = 1
jitter temporal therm [7] =           0 seed = 557082492 media =0 sigma = 1
jitter temporal therm [6] =           0 seed = -390713660 media =0 sigma = 1
jitter temporal therm [5] =          -1 seed = -1989649453 media =0 sigma = 1
jitter temporal therm [4] =          -1 seed = -1485253588 media =0 sigma = 1
jitter temporal therm [3] =           0 seed = -131208601 media =0 sigma = 1
jitter temporal therm [2] =           0 seed = -258267641 media =0 sigma = 1
jitter temporal therm [1] =          -2 seed = 1845890661 media =0 sigma = 1
jitter temporal therm [0] =           0 seed = 510174375 media =0 sigma = 1
jitter temporal thermb [16] =           2 seed = -2096441242 media =0 sigma = 1
jitter temporal thermb [15] =          -1 seed = 920104009 media =0 sigma = 1
jitter temporal thermb [14] =          -2 seed = 1966041534 media =0 sigma = 1
jitter temporal thermb [13] =           0 seed = -1732795692 media =0 sigma = 1
jitter temporal thermb [12] =           2 seed = 2037638053 media =0 sigma = 1
jitter temporal thermb [11] =          -1 seed = -847576496 media =0 sigma = 1
jitter temporal thermb [10] =           0 seed = -343968638 media =0 sigma = 1
jitter temporal thermb [9] =           0 seed = -1735613500 media =0 sigma = 1
jitter temporal thermb [8] =           0 seed = -680889458 media =0 sigma = 1
jitter temporal thermb [7] =           1 seed = 1792398871 media =0 sigma = 1
jitter temporal thermb [6] =           1 seed = -1579784296 media =0 sigma = 1
jitter temporal thermb [5] =          -1 seed = -1497379088 media =0 sigma = 1
jitter temporal thermb [4] =          -1 seed = -1458831482 media =0 sigma = 1
jitter temporal thermb [3] =          -1 seed = -1229812404 media =0 sigma = 1
jitter temporal thermb [2] =           0 seed = 350892275 media =0 sigma = 1
jitter temporal thermb [1] =           0 seed = -363196122 media =0 sigma = 1
jitter temporal thermb [0] =          -1 seed = -1469664891 media =0 sigma = 1
jitter temporal binary [5] =          -2 seed = 1754704635 media =0 sigma = 1
jitter temporal binary [4] =          -3 seed = -2047979791 media =0 sigma = 1
jitter temporal binary [3] =           0 seed = -267268991 media =0 sigma = 1
jitter temporal binary [2] =           0 seed = 364508174 media =0 sigma = 1
jitter temporal binary [1] =           0 seed = 585737571 media =0 sigma = 1
jitter temporal binary [0] =          -1 seed = -1082474455 media =0 sigma = 1
jitter temporal binaryb [5] =           0 seed = -82608229 media =0 sigma = 1
jitter temporal binaryb [4] =          -1 seed = -900291660 media =0 sigma = 1
jitter temporal binaryb [3] =          -1 seed = 2058007327 media =0 sigma = 1
jitter temporal binaryb [2] =          -1 seed = 1197403456 media =0 sigma = 1
jitter temporal binaryb [1] =          -2 seed = 2114994229 media =0 sigma = 1
jitter temporal binaryb [0] =           0 seed = 1450837271 media =0 sigma = 1
jitter temporal therm [16] =           0 seed = -495849300 media =0 sigma = 1
jitter temporal therm [15] =           0 seed = 399222323 media =0 sigma = 1
jitter temporal therm [14] =           0 seed = -1487783545 media =0 sigma = 1
jitter temporal therm [13] =          -1 seed = -1634993624 media =0 sigma = 1
jitter temporal therm [12] =          -1 seed = 863522703 media =0 sigma = 1
jitter temporal therm [11] =           1 seed = -1600605984 media =0 sigma = 1
jitter temporal therm [10] =           0 seed = -537793876 media =0 sigma = 1
jitter temporal therm [9] =          -1 seed = 1168739310 media =0 sigma = 1
jitter temporal therm [8] =           0 seed = 82036793 media =0 sigma = 1
jitter temporal therm [7] =           1 seed = 1104129391 media =0 sigma = 1
jitter temporal therm [6] =          -1 seed = -1318084291 media =0 sigma = 1
jitter temporal therm [5] =           2 seed = 2036649724 media =0 sigma = 1
jitter temporal therm [4] =           1 seed = -1911221212 media =0 sigma = 1
jitter temporal therm [3] =           0 seed = -725009053 media =0 sigma = 1
jitter temporal therm [2] =           1 seed = 1533968544 media =0 sigma = 1
jitter temporal therm [1] =           3 seed = 2109389449 media =0 sigma = 1
jitter temporal therm [0] =          -1 seed = 1844043846 media =0 sigma = 1
jitter temporal thermb [16] =           0 seed = 740172366 media =0 sigma = 1
jitter temporal thermb [15] =           0 seed = -1750570775 media =0 sigma = 1
jitter temporal thermb [14] =           1 seed = -1497115666 media =0 sigma = 1
jitter temporal thermb [13] =          -1 seed = -1572816521 media =0 sigma = 1
jitter temporal thermb [12] =           1 seed = -1049820546 media =0 sigma = 1
jitter temporal thermb [11] =           1 seed = -967184901 media =0 sigma = 1
jitter temporal thermb [10] =           1 seed = -2016772902 media =0 sigma = 1
jitter temporal thermb [9] =           0 seed = 482338516 media =0 sigma = 1
jitter temporal thermb [8] =           1 seed = -1541649171 media =0 sigma = 1
jitter temporal thermb [7] =          -2 seed = -2065798101 media =0 sigma = 1
jitter temporal thermb [6] =          -1 seed = -1411943519 media =0 sigma = 1
jitter temporal thermb [5] =           0 seed = 726042665 media =0 sigma = 1
jitter temporal thermb [4] =           1 seed = 1860024399 media =0 sigma = 1
jitter temporal thermb [3] =           2 seed = -1827962647 media =0 sigma = 1
jitter temporal thermb [2] =          -1 seed = 873922458 media =0 sigma = 1
jitter temporal thermb [1] =           1 seed = 1786243745 media =0 sigma = 1
jitter temporal thermb [0] =           1 seed = 1648435723 media =0 sigma = 1
jitter temporal binary [5] =           1 seed = 1447976265 media =0 sigma = 1
jitter temporal binary [4] =          -1 seed = -944003766 media =0 sigma = 1
jitter temporal binary [3] =           0 seed = 515961324 media =0 sigma = 1
jitter temporal binary [2] =           0 seed = 663747413 media =0 sigma = 1
jitter temporal binary [1] =           1 seed = -1801165631 media =0 sigma = 1
jitter temporal binary [0] =          -1 seed = -1594228636 media =0 sigma = 1
jitter temporal binaryb [5] =           0 seed = 520576649 media =0 sigma = 1
jitter temporal binaryb [4] =          -1 seed = -1367785915 media =0 sigma = 1
jitter temporal binaryb [3] =           1 seed = -1652484536 media =0 sigma = 1
jitter temporal binaryb [2] =           0 seed = -815189698 media =0 sigma = 1
jitter temporal binaryb [1] =          -1 seed = -1450547110 media =0 sigma = 1
jitter temporal binaryb [0] =           0 seed = 417742502 media =0 sigma = 1
jitter temporal therm [16] =           0 seed = 621140847 media =0 sigma = 1
jitter temporal therm [15] =          -1 seed = 1863783700 media =0 sigma = 1
jitter temporal therm [14] =           1 seed = 1401659135 media =0 sigma = 1
jitter temporal therm [13] =          -1 seed = -1429481097 media =0 sigma = 1
jitter temporal therm [12] =          -1 seed = 1936753895 media =0 sigma = 1
jitter temporal therm [11] =           1 seed = 2046740297 media =0 sigma = 1
jitter temporal therm [10] =           0 seed = 762983794 media =0 sigma = 1
jitter temporal therm [9] =           0 seed = 155450461 media =0 sigma = 1
jitter temporal therm [8] =           1 seed = 1101778724 media =0 sigma = 1
jitter temporal therm [7] =           0 seed = 427245420 media =0 sigma = 1
jitter temporal therm [6] =           0 seed = 436047000 media =0 sigma = 1
jitter temporal therm [5] =          -2 seed = -1903327263 media =0 sigma = 1
jitter temporal therm [4] =          -1 seed = 1781464028 media =0 sigma = 1
jitter temporal therm [3] =           0 seed = -73724566 media =0 sigma = 1
jitter temporal therm [2] =          -1 seed = 1522153057 media =0 sigma = 1
jitter temporal therm [1] =           0 seed = 784598505 media =0 sigma = 1
jitter temporal therm [0] =          -1 seed = -1300870170 media =0 sigma = 1
jitter temporal thermb [16] =           2 seed = 1926490734 media =0 sigma = 1
jitter temporal thermb [15] =           1 seed = -1030569758 media =0 sigma = 1
jitter temporal thermb [14] =           0 seed = 517410145 media =0 sigma = 1
jitter temporal thermb [13] =           0 seed = -1356265317 media =0 sigma = 1
jitter temporal thermb [12] =           0 seed = 870348095 media =0 sigma = 1
jitter temporal thermb [11] =           0 seed = 1322637592 media =0 sigma = 1
jitter temporal thermb [10] =           0 seed = 1725646598 media =0 sigma = 1
jitter temporal thermb [9] =           1 seed = 1822793853 media =0 sigma = 1
jitter temporal thermb [8] =           1 seed = -1650100631 media =0 sigma = 1
jitter temporal thermb [7] =           0 seed = -1272437242 media =0 sigma = 1
jitter temporal thermb [6] =           1 seed = 1505702472 media =0 sigma = 1
jitter temporal thermb [5] =           1 seed = -1675801203 media =0 sigma = 1
jitter temporal thermb [4] =           1 seed = -1881620400 media =0 sigma = 1
jitter temporal thermb [3] =           2 seed = -1737154846 media =0 sigma = 1
jitter temporal thermb [2] =          -2 seed = 1982760141 media =0 sigma = 1
jitter temporal thermb [1] =           1 seed = 1514490405 media =0 sigma = 1
jitter temporal thermb [0] =           0 seed = -627647168 media =0 sigma = 1
jitter temporal binary [5] =           0 seed = 357164651 media =0 sigma = 1
jitter temporal binary [4] =           0 seed = 401499665 media =0 sigma = 1
jitter temporal binary [3] =          -1 seed = 987496791 media =0 sigma = 1
jitter temporal binary [2] =          -1 seed = -1574687148 media =0 sigma = 1
jitter temporal binary [1] =           1 seed = 1420638000 media =0 sigma = 1
jitter temporal binary [0] =           1 seed = 2098670106 media =0 sigma = 1
jitter temporal binaryb [5] =           0 seed = -1068579431 media =0 sigma = 1
jitter temporal binaryb [4] =           1 seed = 1616191875 media =0 sigma = 1
jitter temporal binaryb [3] =           0 seed = -2039448460 media =0 sigma = 1
jitter temporal binaryb [2] =          -1 seed = -1538621492 media =0 sigma = 1
jitter temporal binaryb [1] =           2 seed = 2015175603 media =0 sigma = 1
jitter temporal binaryb [0] =          -1 seed = -858844959 media =0 sigma = 1
jitter temporal therm [16] =           0 seed = 128904796 media =0 sigma = 1
jitter temporal therm [15] =           0 seed = 1293340328 media =0 sigma = 1
jitter temporal therm [14] =           2 seed = 1982103083 media =0 sigma = 1
jitter temporal therm [13] =           2 seed = 1808410411 media =0 sigma = 1
jitter temporal therm [12] =           0 seed = -214366052 media =0 sigma = 1
jitter temporal therm [11] =           0 seed = -193275198 media =0 sigma = 1
jitter temporal therm [10] =           0 seed = -800747338 media =0 sigma = 1
jitter temporal therm [9] =          -1 seed = -2052390121 media =0 sigma = 1
jitter temporal therm [8] =           1 seed = 2001102963 media =0 sigma = 1
jitter temporal therm [7] =           0 seed = 1263449300 media =0 sigma = 1
jitter temporal therm [6] =           2 seed = 2057235817 media =0 sigma = 1
jitter temporal therm [5] =           2 seed = -1744647266 media =0 sigma = 1
jitter temporal therm [4] =          -1 seed = -1372358128 media =0 sigma = 1
jitter temporal therm [3] =           0 seed = 884721586 media =0 sigma = 1
jitter temporal therm [2] =          -1 seed = -1385930625 media =0 sigma = 1
jitter temporal therm [1] =           0 seed = -1066728072 media =0 sigma = 1
jitter temporal therm [0] =          -2 seed = -1799699715 media =0 sigma = 1
jitter temporal thermb [16] =          -2 seed = -2125644496 media =0 sigma = 1
jitter temporal thermb [15] =          -2 seed = -1630602332 media =0 sigma = 1
jitter temporal thermb [14] =           2 seed = -1902875075 media =0 sigma = 1
jitter temporal thermb [13] =          -1 seed = 1158092613 media =0 sigma = 1
jitter temporal thermb [12] =           0 seed = 1239223306 media =0 sigma = 1
jitter temporal thermb [11] =           2 seed = 2026003314 media =0 sigma = 1
jitter temporal thermb [10] =           0 seed = 1481743265 media =0 sigma = 1
jitter temporal thermb [9] =          -1 seed = -2068701723 media =0 sigma = 1
jitter temporal thermb [8] =          -2 seed = -1736354056 media =0 sigma = 1
jitter temporal thermb [7] =          -1 seed = 1505104579 media =0 sigma = 1
jitter temporal thermb [6] =          -1 seed = 1044633652 media =0 sigma = 1
jitter temporal thermb [5] =           0 seed = -1553938386 media =0 sigma = 1
jitter temporal thermb [4] =          -1 seed = -798982084 media =0 sigma = 1
jitter temporal thermb [3] =          -1 seed = -1453867615 media =0 sigma = 1
jitter temporal thermb [2] =          -1 seed = -816640851 media =0 sigma = 1
jitter temporal thermb [1] =          -2 seed = -2129088904 media =0 sigma = 1
jitter temporal thermb [0] =           0 seed = 1945875157 media =0 sigma = 1
jitter temporal binary [5] =          -1 seed = 1424011098 media =0 sigma = 1
jitter temporal binary [4] =           0 seed = -1783964675 media =0 sigma = 1
jitter temporal binary [3] =           0 seed = 708362150 media =0 sigma = 1
jitter temporal binary [2] =           1 seed = -1181971043 media =0 sigma = 1
jitter temporal binary [1] =          -2 seed = 1705099994 media =0 sigma = 1
jitter temporal binary [0] =           0 seed = -372243519 media =0 sigma = 1
jitter temporal binaryb [5] =           0 seed = 291532268 media =0 sigma = 1
jitter temporal binaryb [4] =           1 seed = -1214936140 media =0 sigma = 1
jitter temporal binaryb [3] =           0 seed = 788761400 media =0 sigma = 1
jitter temporal binaryb [2] =           1 seed = 1864846272 media =0 sigma = 1
jitter temporal binaryb [1] =           0 seed = 2069358775 media =0 sigma = 1
jitter temporal binaryb [0] =           0 seed = -1758687810 media =0 sigma = 1
jitter temporal therm [16] =           0 seed = 443439112 media =0 sigma = 1
jitter temporal therm [15] =           0 seed = -344282069 media =0 sigma = 1
jitter temporal therm [14] =           1 seed = -1277696137 media =0 sigma = 1
jitter temporal therm [13] =          -1 seed = 1572395358 media =0 sigma = 1
jitter temporal therm [12] =           0 seed = -1396402289 media =0 sigma = 1
jitter temporal therm [11] =           1 seed = -1784274426 media =0 sigma = 1
jitter temporal therm [10] =           0 seed = -869312619 media =0 sigma = 1
jitter temporal therm [9] =           0 seed = -312873378 media =0 sigma = 1
jitter temporal therm [8] =           0 seed = 642861354 media =0 sigma = 1
jitter temporal therm [7] =           0 seed = -173411192 media =0 sigma = 1
jitter temporal therm [6] =           2 seed = 1828413504 media =0 sigma = 1
jitter temporal therm [5] =           2 seed = 1946054198 media =0 sigma = 1
jitter temporal therm [4] =           1 seed = -1490365787 media =0 sigma = 1
jitter temporal therm [3] =          -1 seed = -1583843497 media =0 sigma = 1
jitter temporal therm [2] =           0 seed = 561306110 media =0 sigma = 1
jitter temporal therm [1] =           0 seed = -1741758384 media =0 sigma = 1
jitter temporal therm [0] =           2 seed = 1832150781 media =0 sigma = 1
jitter temporal thermb [16] =          -1 seed = -1413979326 media =0 sigma = 1
jitter temporal thermb [15] =           1 seed = 1114990045 media =0 sigma = 1
jitter temporal thermb [14] =           0 seed = -860349636 media =0 sigma = 1
jitter temporal thermb [13] =           0 seed = -359351298 media =0 sigma = 1
jitter temporal thermb [12] =           0 seed = 401771605 media =0 sigma = 1
jitter temporal thermb [11] =           0 seed = 502571951 media =0 sigma = 1
jitter temporal thermb [10] =           0 seed = 739101330 media =0 sigma = 1
jitter temporal thermb [9] =           0 seed = -4997516 media =0 sigma = 1
jitter temporal thermb [8] =           0 seed = -1870221227 media =0 sigma = 1
jitter temporal thermb [7] =          -1 seed = -1134064038 media =0 sigma = 1
jitter temporal thermb [6] =           0 seed = 705182584 media =0 sigma = 1
jitter temporal thermb [5] =           1 seed = 964630258 media =0 sigma = 1
jitter temporal thermb [4] =           1 seed = 2106019084 media =0 sigma = 1
jitter temporal thermb [3] =           0 seed = 765142362 media =0 sigma = 1
jitter temporal thermb [2] =           1 seed = -1027644809 media =0 sigma = 1
jitter temporal thermb [1] =          -1 seed = -1400157586 media =0 sigma = 1
jitter temporal thermb [0] =           1 seed = 1375712512 media =0 sigma = 1
jitter temporal binary [5] =          -1 seed = 1301702521 media =0 sigma = 1
jitter temporal binary [4] =           0 seed = -423611981 media =0 sigma = 1
jitter temporal binary [3] =          -1 seed = -1311109075 media =0 sigma = 1
jitter temporal binary [2] =           0 seed = -283165728 media =0 sigma = 1
jitter temporal binary [1] =          -1 seed = -1587857564 media =0 sigma = 1
jitter temporal binary [0] =          -1 seed = -1592683897 media =0 sigma = 1
jitter temporal binaryb [5] =           1 seed = -949533577 media =0 sigma = 1
jitter temporal binaryb [4] =           0 seed = -1968277908 media =0 sigma = 1
jitter temporal binaryb [3] =          -1 seed = -1044991638 media =0 sigma = 1
jitter temporal binaryb [2] =           1 seed = -1769466224 media =0 sigma = 1
jitter temporal binaryb [1] =           0 seed = 482012285 media =0 sigma = 1
jitter temporal binaryb [0] =           0 seed = -276913990 media =0 sigma = 1
jitter temporal therm [16] =          -1 seed = 1114263718 media =0 sigma = 1
jitter temporal therm [15] =           1 seed = 2145933668 media =0 sigma = 1
jitter temporal therm [14] =          -1 seed = -1478135388 media =0 sigma = 1
jitter temporal therm [13] =           0 seed = 1179491436 media =0 sigma = 1
jitter temporal therm [12] =           0 seed = -828240688 media =0 sigma = 1
jitter temporal therm [11] =           1 seed = -1803761055 media =0 sigma = 1
jitter temporal therm [10] =          -1 seed = -1595361756 media =0 sigma = 1
jitter temporal therm [9] =          -1 seed = -917940512 media =0 sigma = 1
jitter temporal therm [8] =           0 seed = -842571413 media =0 sigma = 1
jitter temporal therm [7] =           0 seed = -378813219 media =0 sigma = 1
jitter temporal therm [6] =           1 seed = -989243837 media =0 sigma = 1
jitter temporal therm [5] =           0 seed = -854993606 media =0 sigma = 1
jitter temporal therm [4] =           1 seed = 925454632 media =0 sigma = 1
jitter temporal therm [3] =          -1 seed = -875642927 media =0 sigma = 1
jitter temporal therm [2] =           0 seed = -923889633 media =0 sigma = 1
jitter temporal therm [1] =           0 seed = -483974426 media =0 sigma = 1
jitter temporal therm [0] =           0 seed = 715895770 media =0 sigma = 1
jitter temporal thermb [16] =          -2 seed = -1685042979 media =0 sigma = 1
jitter temporal thermb [15] =          -2 seed = 1981651529 media =0 sigma = 1
jitter temporal thermb [14] =           0 seed = 851509448 media =0 sigma = 1
jitter temporal thermb [13] =           1 seed = 954137889 media =0 sigma = 1
jitter temporal thermb [12] =           0 seed = -345598697 media =0 sigma = 1
jitter temporal thermb [11] =           1 seed = -1581451534 media =0 sigma = 1
jitter temporal thermb [10] =           0 seed = -1991547137 media =0 sigma = 1
jitter temporal thermb [9] =           1 seed = -1456471757 media =0 sigma = 1
jitter temporal thermb [8] =          -2 seed = 1862081746 media =0 sigma = 1
jitter temporal thermb [7] =           0 seed = 694203409 media =0 sigma = 1
jitter temporal thermb [6] =           0 seed = 125585773 media =0 sigma = 1
jitter temporal thermb [5] =           2 seed = -1872292823 media =0 sigma = 1
jitter temporal thermb [4] =           1 seed = 1231515621 media =0 sigma = 1
jitter temporal thermb [3] =           1 seed = -1787906684 media =0 sigma = 1
jitter temporal thermb [2] =           2 seed = -2055371919 media =0 sigma = 1
jitter temporal thermb [1] =           1 seed = -727033468 media =0 sigma = 1
jitter temporal thermb [0] =          -1 seed = 827466716 media =0 sigma = 1
jitter temporal binary [5] =           0 seed = 770934588 media =0 sigma = 1
jitter temporal binary [4] =          -1 seed = -1290565029 media =0 sigma = 1
jitter temporal binary [3] =           0 seed = -239047844 media =0 sigma = 1
jitter temporal binary [2] =          -1 seed = -1262908799 media =0 sigma = 1
jitter temporal binary [1] =           0 seed = 920304904 media =0 sigma = 1
jitter temporal binary [0] =          -1 seed = -2116425729 media =0 sigma = 1
jitter temporal binaryb [5] =           0 seed = 199159372 media =0 sigma = 1
jitter temporal binaryb [4] =          -1 seed = -1809481110 media =0 sigma = 1
jitter temporal binaryb [3] =           0 seed = 963325629 media =0 sigma = 1
jitter temporal binaryb [2] =          -1 seed = -850615123 media =0 sigma = 1
jitter temporal binaryb [1] =          -2 seed = 1915712261 media =0 sigma = 1
jitter temporal binaryb [0] =          -2 seed = 1851578886 media =0 sigma = 1
jitter temporal therm [16] =           0 seed = -387211292 media =0 sigma = 1
jitter temporal therm [15] =           1 seed = 1560054161 media =0 sigma = 1
jitter temporal therm [14] =           1 seed = -1185681735 media =0 sigma = 1
jitter temporal therm [13] =           0 seed = 1098632392 media =0 sigma = 1
jitter temporal therm [12] =          -1 seed = -766749025 media =0 sigma = 1
jitter temporal therm [11] =          -1 seed = 1958545152 media =0 sigma = 1
jitter temporal therm [10] =           1 seed = 1199935435 media =0 sigma = 1
jitter temporal therm [9] =           1 seed = -1206919999 media =0 sigma = 1
jitter temporal therm [8] =           0 seed = 1366527581 media =0 sigma = 1
jitter temporal therm [7] =           0 seed = 546901541 media =0 sigma = 1
jitter temporal therm [6] =           0 seed = -1932765249 media =0 sigma = 1
jitter temporal therm [5] =           0 seed = 1529171180 media =0 sigma = 1
jitter temporal therm [4] =          -1 seed = 1000618111 media =0 sigma = 1
jitter temporal therm [3] =           3 seed = 2106653177 media =0 sigma = 1
jitter temporal therm [2] =           0 seed = 525641567 media =0 sigma = 1
jitter temporal therm [1] =           1 seed = -1631142181 media =0 sigma = 1
jitter temporal therm [0] =          -1 seed = 1861292094 media =0 sigma = 1
jitter temporal thermb [16] =           0 seed = 785751846 media =0 sigma = 1
jitter temporal thermb [15] =           1 seed = 1282267887 media =0 sigma = 1
jitter temporal thermb [14] =           0 seed = -1098345342 media =0 sigma = 1
jitter temporal thermb [13] =          -1 seed = 1313950802 media =0 sigma = 1
jitter temporal thermb [12] =           1 seed = -982125111 media =0 sigma = 1
jitter temporal thermb [11] =           0 seed = -212295175 media =0 sigma = 1
jitter temporal thermb [10] =          -1 seed = -855674202 media =0 sigma = 1
jitter temporal thermb [9] =           1 seed = 1544254220 media =0 sigma = 1
jitter temporal thermb [8] =           1 seed = 1748369928 media =0 sigma = 1
jitter temporal thermb [7] =           1 seed = -1655482241 media =0 sigma = 1
jitter temporal thermb [6] =           3 seed = -2034611038 media =0 sigma = 1
jitter temporal thermb [5] =           0 seed = -979771902 media =0 sigma = 1
jitter temporal thermb [4] =          -1 seed = 1234421980 media =0 sigma = 1
jitter temporal thermb [3] =           0 seed = 671341674 media =0 sigma = 1
jitter temporal thermb [2] =           0 seed = 724272380 media =0 sigma = 1
jitter temporal thermb [1] =           1 seed = 1770556463 media =0 sigma = 1
jitter temporal thermb [0] =          -1 seed = -902008041 media =0 sigma = 1
jitter temporal binary [5] =          -1 seed = 1234150874 media =0 sigma = 1
jitter temporal binary [4] =           0 seed = -1340683178 media =0 sigma = 1
jitter temporal binary [3] =           1 seed = 1642482653 media =0 sigma = 1
jitter temporal binary [2] =           0 seed = -523644737 media =0 sigma = 1
jitter temporal binary [1] =          -1 seed = 1797093065 media =0 sigma = 1
jitter temporal binary [0] =          -2 seed = -1967999144 media =0 sigma = 1
jitter temporal binaryb [5] =          -1 seed = 1040602980 media =0 sigma = 1
jitter temporal binaryb [4] =           0 seed = 626255048 media =0 sigma = 1
jitter temporal binaryb [3] =           1 seed = -1187903079 media =0 sigma = 1
jitter temporal binaryb [2] =           1 seed = -1331731824 media =0 sigma = 1
jitter temporal binaryb [1] =          -1 seed = -1076984886 media =0 sigma = 1
jitter temporal binaryb [0] =           0 seed = 1349663603 media =0 sigma = 1
jitter temporal therm [16] =           1 seed = 1911691772 media =0 sigma = 1
jitter temporal therm [15] =           1 seed = 1417509191 media =0 sigma = 1
jitter temporal therm [14] =          -2 seed = 1854605593 media =0 sigma = 1
jitter temporal therm [13] =           0 seed = 581112453 media =0 sigma = 1
jitter temporal therm [12] =           2 seed = -1910198980 media =0 sigma = 1
jitter temporal therm [11] =           1 seed = 1765693752 media =0 sigma = 1
jitter temporal therm [10] =           1 seed = 1395443544 media =0 sigma = 1
jitter temporal therm [9] =           0 seed = -1190824352 media =0 sigma = 1
jitter temporal therm [8] =          -2 seed = 2060387274 media =0 sigma = 1
jitter temporal therm [7] =           0 seed = -1101407563 media =0 sigma = 1
jitter temporal therm [6] =          -2 seed = 2080263053 media =0 sigma = 1
jitter temporal therm [5] =           0 seed = -1227735138 media =0 sigma = 1
jitter temporal therm [4] =           1 seed = 1499676640 media =0 sigma = 1
jitter temporal therm [3] =          -2 seed = -2075481451 media =0 sigma = 1
jitter temporal therm [2] =           1 seed = -1071416286 media =0 sigma = 1
jitter temporal therm [1] =          -1 seed = 1654210900 media =0 sigma = 1
jitter temporal therm [0] =           1 seed = 1113250289 media =0 sigma = 1
jitter temporal thermb [16] =           1 seed = 1077431079 media =0 sigma = 1
jitter temporal thermb [15] =           2 seed = 1948471906 media =0 sigma = 1
jitter temporal thermb [14] =           0 seed = -1280435772 media =0 sigma = 1
jitter temporal thermb [13] =           1 seed = -1247739111 media =0 sigma = 1
jitter temporal thermb [12] =          -1 seed = 1837303640 media =0 sigma = 1
jitter temporal thermb [11] =           1 seed = -1299493067 media =0 sigma = 1
jitter temporal thermb [10] =           0 seed = -532948009 media =0 sigma = 1
jitter temporal thermb [9] =           1 seed = 1198750836 media =0 sigma = 1
jitter temporal thermb [8] =           1 seed = 748020019 media =0 sigma = 1
jitter temporal thermb [7] =          -2 seed = 1911999023 media =0 sigma = 1
jitter temporal thermb [6] =          -2 seed = 1655484555 media =0 sigma = 1
jitter temporal thermb [5] =           0 seed = 1493701706 media =0 sigma = 1
jitter temporal thermb [4] =           0 seed = 1656516949 media =0 sigma = 1
jitter temporal thermb [3] =           2 seed = 1732476609 media =0 sigma = 1
jitter temporal thermb [2] =           1 seed = 1818479948 media =0 sigma = 1
jitter temporal thermb [1] =          -2 seed = -1806689147 media =0 sigma = 1
jitter temporal thermb [0] =           2 seed = -1928301623 media =0 sigma = 1
jitter temporal binary [5] =           0 seed = 148837953 media =0 sigma = 1
jitter temporal binary [4] =           1 seed = -833635721 media =0 sigma = 1
jitter temporal binary [3] =           1 seed = -1300584279 media =0 sigma = 1
jitter temporal binary [2] =           0 seed = -643489033 media =0 sigma = 1
jitter temporal binary [1] =           0 seed = 828434025 media =0 sigma = 1
jitter temporal binary [0] =          -1 seed = 1033114589 media =0 sigma = 1
jitter temporal binaryb [5] =           0 seed = -607924072 media =0 sigma = 1
jitter temporal binaryb [4] =           1 seed = 1549054515 media =0 sigma = 1
jitter temporal binaryb [3] =           2 seed = 2045316325 media =0 sigma = 1
jitter temporal binaryb [2] =           1 seed = 1309742551 media =0 sigma = 1
jitter temporal binaryb [1] =           0 seed = 687879185 media =0 sigma = 1
jitter temporal binaryb [0] =           1 seed = -1441710277 media =0 sigma = 1
jitter temporal therm [16] =           0 seed = -1536768684 media =0 sigma = 1
jitter temporal therm [15] =          -2 seed = 1933696521 media =0 sigma = 1
jitter temporal therm [14] =           1 seed = 1628257115 media =0 sigma = 1
jitter temporal therm [13] =          -1 seed = 2135638196 media =0 sigma = 1
jitter temporal therm [12] =           1 seed = -1272323905 media =0 sigma = 1
jitter temporal therm [11] =           0 seed = 953748273 media =0 sigma = 1
jitter temporal therm [10] =           1 seed = -2031001119 media =0 sigma = 1
jitter temporal therm [9] =           0 seed = -764072709 media =0 sigma = 1
jitter temporal therm [8] =          -1 seed = -1080786803 media =0 sigma = 1
jitter temporal therm [7] =          -1 seed = -1414366360 media =0 sigma = 1
jitter temporal therm [6] =           1 seed = 1242850726 media =0 sigma = 1
jitter temporal therm [5] =           0 seed = 1120496938 media =0 sigma = 1
jitter temporal therm [4] =          -1 seed = 1153362323 media =0 sigma = 1
jitter temporal therm [3] =           0 seed = 484778664 media =0 sigma = 1
jitter temporal therm [2] =          -2 seed = 1919442842 media =0 sigma = 1
jitter temporal therm [1] =           0 seed = -1472304842 media =0 sigma = 1
jitter temporal therm [0] =           1 seed = 1194123602 media =0 sigma = 1
jitter temporal thermb [16] =          -1 seed = -1625343196 media =0 sigma = 1
jitter temporal thermb [15] =           1 seed = 1331823862 media =0 sigma = 1
jitter temporal thermb [14] =           1 seed = 977339451 media =0 sigma = 1
jitter temporal thermb [13] =           0 seed = 370681474 media =0 sigma = 1
jitter temporal thermb [12] =           0 seed = 1386557537 media =0 sigma = 1
jitter temporal thermb [11] =           1 seed = -2033524673 media =0 sigma = 1
jitter temporal thermb [10] =           0 seed = 368127063 media =0 sigma = 1
jitter temporal thermb [9] =          -2 seed = -1731249413 media =0 sigma = 1
jitter temporal thermb [8] =           0 seed = 1814132025 media =0 sigma = 1
jitter temporal thermb [7] =          -2 seed = -1939788834 media =0 sigma = 1
jitter temporal thermb [6] =          -1 seed = -1523380602 media =0 sigma = 1
jitter temporal thermb [5] =           1 seed = -1922894622 media =0 sigma = 1
jitter temporal thermb [4] =          -1 seed = 1353961329 media =0 sigma = 1
jitter temporal thermb [3] =           1 seed = -1424961034 media =0 sigma = 1
jitter temporal thermb [2] =          -1 seed = 965487586 media =0 sigma = 1
jitter temporal thermb [1] =          -2 seed = 1686146498 media =0 sigma = 1
jitter temporal thermb [0] =          -1 seed = -1697229406 media =0 sigma = 1
jitter temporal binary [5] =           1 seed = -765427625 media =0 sigma = 1
jitter temporal binary [4] =          -2 seed = -2090414559 media =0 sigma = 1
jitter temporal binary [3] =          -1 seed = -1114298617 media =0 sigma = 1
jitter temporal binary [2] =          -1 seed = -1847148021 media =0 sigma = 1
jitter temporal binary [1] =           1 seed = 1518295433 media =0 sigma = 1
jitter temporal binary [0] =           0 seed = -889069813 media =0 sigma = 1
jitter temporal binaryb [5] =           0 seed = 213388001 media =0 sigma = 1
jitter temporal binaryb [4] =           1 seed = 1703034358 media =0 sigma = 1
jitter temporal binaryb [3] =          -1 seed = 1505109675 media =0 sigma = 1
jitter temporal binaryb [2] =           0 seed = -187577030 media =0 sigma = 1
jitter temporal binaryb [1] =           0 seed = 664813170 media =0 sigma = 1
jitter temporal binaryb [0] =           0 seed = -730641567 media =0 sigma = 1
atb1 = 0.00, atb0 = 0.00
Tests completados.
Simulation complete via $finish(1) at time 3 NS + 0
./tb/clock_distribution_tb.sv:144         $finish;
xcelium> ^C
xcelium> exit
TOOL:	xrun(64)	24.03-s004: Exiting on Jan 12, 2026 at 13:10:49 CET  (total: 00:06:19)
