xrun(64): 24.03-s004: (c) Copyright 1995-2024 Cadence Design Systems, Inc.
TOOL:	xrun(64)	24.03-s004: Started on Jan 03, 2026 at 13:23:27 CET
xrun
	-f xrun.f
		-clean
		./models/clock_distribution_mismatch.sv
		./tb/clock_distribution_tb.sv
		-access +rw
		-gui
		-s
		-input /home/msegper/Documents/TFM/clock_distribution/restore.tcl
	-s
xrun: *N,CLEAN: Removing existing directory ./xcelium.d.
file: ./models/clock_distribution_mismatch.sv
	module worklib.clock_distribution:sv
		errors: 0, warnings: 0
file: ./tb/clock_distribution_tb.sv
	module worklib.clock_distribution_tb:sv
		errors: 0, warnings: 0
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
	Top level design units:
		cds_rnm_pkg
		clock_distribution_tb
	Building instance overlay tables: ....................
        $display("Raw binary mismatch = %0d", temp);
                                                 |
xmelab: *W,REALCV (./models/clock_distribution_mismatch.sv,130|49): Real argument converted to integer for (%d).
 Done
	Using implicit TMP libraries; associated with library worklib
	Generating native compiled code:
		worklib.clock_distribution:sv <0x2e37febf>
			streams:  11, words: 55974
		worklib.clock_distribution_tb:sv <0x35627bc4>
			streams:  12, words: 13543
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                 Instances  Unique
		Modules:                 2       2
		Verilog packages:        1       1
		Registers:             119     119
		Scalar wires:           56       -
		Vectored wires:          1       -
		Always blocks:           6       6
		Initial blocks:          5       5
		Parallel blocks:         1       1
		Pseudo assignments:      9       -
		Assertions:              3       3
		Simulation timescale:  1ps
	Writing initial simulation snapshot: worklib.clock_distribution_tb:sv
xmsim: *W,NOMTDGUI: Multi-Threaded Dumping is disabled for interactive debug mode.
SVSEED default: 1
[DMSINFO] Simulating with Xcelium Mixed-Signal App...
xcelium> 
xcelium> source /eda/cadence/2024-25/RHELx86/XCELIUM_24.03.004/tools/xcelium/files/xmsimrc
xcelium> 
xcelium> # XM-Sim Command File
xcelium> # TOOL:	xmsim(64)	24.03-s004
xcelium> #
xcelium> #
xcelium> # You can restore this configuration with:
xcelium> #
xcelium> #      xrun -f xrun.f -input restore.tcl
xcelium> #
xcelium> 
xcelium> set tcl_prompt1 {puts -nonewline "xcelium> "}
puts -nonewline "xcelium> "
xcelium> set tcl_prompt2 {puts -nonewline "> "}
puts -nonewline "> "
xcelium> set vlog_format %h
%h
xcelium> set vhdl_format %v
%v
xcelium> set real_precision 6
6
xcelium> set display_unit auto
auto
xcelium> set time_unit module
module
xcelium> set heap_garbage_size -200
-200
xcelium> set heap_garbage_time 0
0
xcelium> set assert_report_level note
note
xcelium> set assert_stop_level error
error
xcelium> set autoscope yes
yes
xcelium> set assert_1164_warnings yes
yes
xcelium> set pack_assert_off {}
xcelium> set severity_pack_assert_off {note warning}
note warning
xcelium> set assert_output_stop_level failed
failed
xcelium> set tcl_debug_level 0
0
xcelium> set relax_path_name 1
1
xcelium> set vhdl_vcdmap XX01ZX01X
XX01ZX01X
xcelium> set intovf_severity_level ERROR
ERROR
xcelium> set probe_screen_format 0
0
xcelium> set rangecnst_severity_level ERROR
ERROR
xcelium> set textio_severity_level ERROR
ERROR
xcelium> set vital_timing_checks_on 1
1
xcelium> set vlog_code_show_force 0
0
xcelium> set assert_count_attempts 1
1
xcelium> set tcl_all64 false
false
xcelium> set tcl_runerror_exit false
false
xcelium> set assert_report_incompletes 0
0
xcelium> set show_force 1
1
xcelium> set force_reset_by_reinvoke 0
0
xcelium> set tcl_relaxed_literal 0
0
xcelium> set probe_exclude_patterns {}
xcelium> set probe_packed_limit 4k
4k
xcelium> set probe_unpacked_limit 16k
16k
xcelium> set assert_internal_msg no
no
xcelium> set svseed 1
1
xcelium> set assert_reporting_mode 0
0
xcelium> set vcd_compact_mode 0
0
xcelium> set vhdl_forgen_loopindex_enum_pos 0
0
xcelium> set xmreplay_dc_debug 0
0
xcelium> set tcl_runcmd_interrupt next_command
next_command
xcelium> set tcl_sigval_prefix {#}
#
xcelium> alias . run
xcelium> alias indago verisium
xcelium> alias quit exit
xcelium> database -open -shm -into waves.shm waves -default
Created default SHM database waves
xcelium> probe -create -database waves clock_distribution_tb.dut.atb0 clock_distribution_tb.dut.atb1 clock_distribution_tb.dut.atb_ena clock_distribution_tb.dut.clkin clock_distribution_tb.dut.clkinb clock_distribution_tb.dut.clkout_binary_0 clock_distribution_tb.dut.clkout_binary_0_red clock_distribution_tb.dut.clkout_binary_1 clock_distribution_tb.dut.clkout_binary_2 clock_distribution_tb.dut.clkout_binary_3 clock_distribution_tb.dut.clkout_binary_4 clock_distribution_tb.dut.clkout_binary_5 clock_distribution_tb.dut.clkout_therm_0 clock_distribution_tb.dut.clkout_therm_1 clock_distribution_tb.dut.clkout_therm_2 clock_distribution_tb.dut.clkout_therm_3 clock_distribution_tb.dut.clkout_therm_4 clock_distribution_tb.dut.clkout_therm_5 clock_distribution_tb.dut.clkout_therm_6 clock_distribution_tb.dut.clkout_therm_7 clock_distribution_tb.dut.clkout_therm_8 clock_distribution_tb.dut.clkout_therm_9 clock_distribution_tb.dut.clkout_therm_10 clock_distribution_tb.dut.clkout_therm_11 clock_distribution_tb.dut.clkout_therm_12 clock_distribution_tb.dut.clkout_therm_13 clock_distribution_tb.dut.clkout_therm_14 clock_distribution_tb.dut.clkout_therm_15 clock_distribution_tb.dut.clkout_therm_16 clock_distribution_tb.dut.clkoutb_binary_0 clock_distribution_tb.dut.clkoutb_binary_0_red clock_distribution_tb.dut.clkoutb_binary_1 clock_distribution_tb.dut.clkoutb_binary_2 clock_distribution_tb.dut.clkoutb_binary_3 clock_distribution_tb.dut.clkoutb_binary_4 clock_distribution_tb.dut.clkoutb_binary_5 clock_distribution_tb.dut.clkoutb_therm_0 clock_distribution_tb.dut.clkoutb_therm_1 clock_distribution_tb.dut.clkoutb_therm_2 clock_distribution_tb.dut.clkoutb_therm_3 clock_distribution_tb.dut.clkoutb_therm_4 clock_distribution_tb.dut.clkoutb_therm_5 clock_distribution_tb.dut.clkoutb_therm_6 clock_distribution_tb.dut.clkoutb_therm_7 clock_distribution_tb.dut.clkoutb_therm_8 clock_distribution_tb.dut.clkoutb_therm_9 clock_distribution_tb.dut.clkoutb_therm_10 clock_distribution_tb.dut.clkoutb_therm_11 clock_distribution_tb.dut.clkoutb_therm_12 clock_distribution_tb.dut.clkoutb_therm_13 clock_distribution_tb.dut.clkoutb_therm_14 clock_distribution_tb.dut.clkoutb_therm_15 clock_distribution_tb.dut.clkoutb_therm_16 clock_distribution_tb.dut.iref_25ua clock_distribution_tb.dut.pdb clock_distribution_tb.dut.vddana_0p8 clock_distribution_tb.dut.vssana
Created probe 1
xcelium> 
xcelium> simvision -input restore.tcl.svcf
xmsim: *E,TCLERR: SimVision initialization failed.
xcelium> 
-------------------------------------
Relinquished control to SimVision...
# Restoring simulation environment...
xcelium> input -quiet .reinvoke.sim
xcelium> file delete .reinvoke.sim
xcelium> run
Iniciando tests...
Test 1: Estado apagado
clkout_therm_16 = x, clkoutb_therm_16 = x
Test 2: Estado encendido con atb_ena = 2'b00
Raw binary mismatch =        3082
Binary mismatch= 0.0108
Raw binary mismatch =        3818
Binary mismatch= 0.0182
Raw binary mismatch =        2019
Binary mismatch= 0.0002
Raw binary mismatch =        1727
Binary mismatch= -0.0027
Raw binary mismatch =        3004
Binary mismatch= 0.0100
Raw binary mismatch =        3644
Binary mismatch= 0.0164
Raw binary mismatch =         883
Binary mismatch= -0.0112
Raw binary mismatch =        1948
Binary mismatch= -0.0005
Raw binary mismatch =        1920
Binary mismatch= -0.0008
Raw binary mismatch =        3949
Binary mismatch= 0.0195
Raw binary mismatch =        2773
Binary mismatch= 0.0077
Raw binary mismatch =        3466
Binary mismatch= 0.0147
Raw binary mismatch =         629
Binary mismatch= -0.0137
Raw binary mismatch =        1720
Binary mismatch= -0.0028
Raw binary mismatch =        3478
Binary mismatch= 0.0148
Raw binary mismatch =         258
Binary mismatch= -0.0174
Raw binary mismatch =        3960
Binary mismatch= 0.0196
Raw binary mismatch =        3572
Binary mismatch= 0.0157
Raw binary mismatch =        3490
Binary mismatch= 0.0149
Raw binary mismatch =        2680
Binary mismatch= 0.0068
Raw binary mismatch =        1120
Binary mismatch= -0.0088
Raw binary mismatch =        3123
Binary mismatch= 0.0112
Raw binary mismatch =        3261
Binary mismatch= 0.0126
Raw binary mismatch =         382
Binary mismatch= -0.0162
Raw binary mismatch =         449
Binary mismatch= -0.0155
Raw binary mismatch =        2853
Binary mismatch= 0.0085
Raw binary mismatch =         330
Binary mismatch= -0.0167
Raw binary mismatch =         193
Binary mismatch= -0.0181
Raw binary mismatch =        2988
Binary mismatch= 0.0099
Raw binary mismatch =        1557
Binary mismatch= -0.0044
Raw binary mismatch =          71
Binary mismatch= -0.0193
Raw binary mismatch =        1353
Binary mismatch= -0.0065
Raw binary mismatch =        2411
Binary mismatch= 0.0041
Raw binary mismatch =        3944
Binary mismatch= 0.0194
Raw binary mismatch =         973
Binary mismatch= -0.0103
Raw binary mismatch =        1723
Binary mismatch= -0.0028
Raw binary mismatch =        3719
Binary mismatch= 0.0172
Raw binary mismatch =        1347
Binary mismatch= -0.0065
Raw binary mismatch =         402
Binary mismatch= -0.0160
Raw binary mismatch =        3544
Binary mismatch= 0.0154
Raw binary mismatch =        2371
Binary mismatch= 0.0037
Raw binary mismatch =        2532
Binary mismatch= 0.0053
Raw binary mismatch =        1768
Binary mismatch= -0.0023
Raw binary mismatch =        3165
Binary mismatch= 0.0117
Raw binary mismatch =        2753
Binary mismatch= 0.0075
Raw binary mismatch =        1093
Binary mismatch= -0.0091
Raw binary mismatch =        1629
Binary mismatch= -0.0037
Raw binary mismatch =        3395
Binary mismatch= 0.0140
Raw binary mismatch =        3186
Binary mismatch= 0.0119
Raw binary mismatch =        1297
Binary mismatch= -0.0070
Raw binary mismatch =        3427
Binary mismatch= 0.0143
Raw binary mismatch =        2708
Binary mismatch= 0.0071
Raw binary mismatch =        3870
Binary mismatch= 0.0187
Raw binary mismatch =        1567
Binary mismatch= -0.0043
Raw binary mismatch =        1144
Binary mismatch= -0.0086
Raw binary mismatch =        2471
Binary mismatch= 0.0047
Raw binary mismatch =         370
Binary mismatch= -0.0163
Raw binary mismatch =         957
Binary mismatch= -0.0104
Raw binary mismatch =        3560
Binary mismatch= 0.0156
Raw binary mismatch =         956
Binary mismatch= -0.0104
Raw binary mismatch =        3518
Binary mismatch= 0.0152
Raw binary mismatch =        2292
Binary mismatch= 0.0029
Raw binary mismatch =        3081
Binary mismatch= 0.0108
Raw binary mismatch =        2452
Binary mismatch= 0.0045
Raw binary mismatch =        2239
Binary mismatch= 0.0024
Raw binary mismatch =        1912
Binary mismatch= -0.0009
Raw binary mismatch =        1152
Binary mismatch= -0.0085
Raw binary mismatch =        3126
Binary mismatch= 0.0113
Raw binary mismatch =        2048
Binary mismatch= 0.0005
Raw binary mismatch =        1801
Binary mismatch= -0.0020
Raw binary mismatch =        1786
Binary mismatch= -0.0021
Raw binary mismatch =         859
Binary mismatch= -0.0114
Raw binary mismatch =        3253
Binary mismatch= 0.0125
Raw binary mismatch =        1396
Binary mismatch= -0.0060
Raw binary mismatch =        1780
Binary mismatch= -0.0022
Raw binary mismatch =          68
Binary mismatch= -0.0193
Raw binary mismatch =        2209
Binary mismatch= 0.0021
Raw binary mismatch =        1553
Binary mismatch= -0.0045
Raw binary mismatch =         374
Binary mismatch= -0.0163
Raw binary mismatch =        3616
Binary mismatch= 0.0162
Raw binary mismatch =         367
Binary mismatch= -0.0163
Raw binary mismatch =        3652
Binary mismatch= 0.0165
Raw binary mismatch =        3729
Binary mismatch= 0.0173
Raw binary mismatch =        1897
Binary mismatch= -0.0010
Raw binary mismatch =        3962
Binary mismatch= 0.0196
Raw binary mismatch =        3775
Binary mismatch= 0.0177
Raw binary mismatch =        2951
Binary mismatch= 0.0095
Raw binary mismatch =        2086
Binary mismatch= 0.0009
Raw binary mismatch =        2887
Binary mismatch= 0.0089
Raw binary mismatch =        1628
Binary mismatch= -0.0037
Raw binary mismatch =         834
Binary mismatch= -0.0117
Raw binary mismatch =        3112
Binary mismatch= 0.0111
Raw binary mismatch =         423
Binary mismatch= -0.0158
Raw binary mismatch =         965
Binary mismatch= -0.0103
Raw binary mismatch =        2009
Binary mismatch= 0.0001
Raw binary mismatch =        3599
Binary mismatch= 0.0160
Raw binary mismatch =         472
Binary mismatch= -0.0153
Raw binary mismatch =        1122
Binary mismatch= -0.0088
Raw binary mismatch =         641
Binary mismatch= -0.0136
Raw binary mismatch =        2230
Binary mismatch= 0.0023
Raw binary mismatch =         638
Binary mismatch= -0.0136
Raw binary mismatch =        3781
Binary mismatch= 0.0178
Raw binary mismatch =        3277
Binary mismatch= 0.0128
Raw binary mismatch =        1771
Binary mismatch= -0.0023
Raw binary mismatch =        1642
Binary mismatch= -0.0036
Raw binary mismatch =        1342
Binary mismatch= -0.0066
Raw binary mismatch =        2075
Binary mismatch= 0.0008
Raw binary mismatch =         603
Binary mismatch= -0.0140
Raw binary mismatch =        2166
Binary mismatch= 0.0017
Raw binary mismatch =        2066
Binary mismatch= 0.0007
Raw binary mismatch =        2264
Binary mismatch= 0.0026
Raw binary mismatch =        2003
Binary mismatch= 0.0000
Raw binary mismatch =        2950
Binary mismatch= 0.0095
Raw binary mismatch =        2550
Binary mismatch= 0.0055
Raw binary mismatch =        1055
Binary mismatch= -0.0095
Raw binary mismatch =         364
Binary mismatch= -0.0164
Raw binary mismatch =        2921
Binary mismatch= 0.0092
Raw binary mismatch =        1545
Binary mismatch= -0.0046
Raw binary mismatch =        1527
Binary mismatch= -0.0047
Raw binary mismatch =        1325
Binary mismatch= -0.0067
Raw binary mismatch =        2716
Binary mismatch= 0.0072
Raw binary mismatch =        3253
Binary mismatch= 0.0125
Raw binary mismatch =         946
Binary mismatch= -0.0105
Raw binary mismatch =        1958
Binary mismatch= -0.0004
Raw binary mismatch =        2888
Binary mismatch= 0.0089
Raw binary mismatch =        2420
Binary mismatch= 0.0042
Raw binary mismatch =         526
Binary mismatch= -0.0147
Raw binary mismatch =        2516
Binary mismatch= 0.0052
Raw binary mismatch =        1249
Binary mismatch= -0.0075
Raw binary mismatch =          39
Binary mismatch= -0.0196
Raw binary mismatch =         310
Binary mismatch= -0.0169
Raw binary mismatch =        3010
Binary mismatch= 0.0101
Raw binary mismatch =        3015
Binary mismatch= 0.0101
Raw binary mismatch =         223
Binary mismatch= -0.0178
Raw binary mismatch =        1696
Binary mismatch= -0.0030
Raw binary mismatch =         868
Binary mismatch= -0.0113
Raw binary mismatch =        3143
Binary mismatch= 0.0114
Raw binary mismatch =        3190
Binary mismatch= 0.0119
Raw binary mismatch =         238
Binary mismatch= -0.0176
Raw binary mismatch =          60
Binary mismatch= -0.0194
Raw binary mismatch =         409
Binary mismatch= -0.0159
Raw binary mismatch =        3572
Binary mismatch= 0.0157
Raw binary mismatch =        3983
Binary mismatch= 0.0198
Raw binary mismatch =        3416
Binary mismatch= 0.0142
Raw binary mismatch =        1439
Binary mismatch= -0.0056
Raw binary mismatch =         933
Binary mismatch= -0.0107
Raw binary mismatch =        1136
Binary mismatch= -0.0086
Raw binary mismatch =        2258
Binary mismatch= 0.0026
Raw binary mismatch =        3800
Binary mismatch= 0.0180
Raw binary mismatch =        1120
Binary mismatch= -0.0088
Raw binary mismatch =        2010
Binary mismatch= 0.0001
Raw binary mismatch =           5
Binary mismatch= -0.0199
Raw binary mismatch =         845
Binary mismatch= -0.0115
Raw binary mismatch =        1254
Binary mismatch= -0.0075
Raw binary mismatch =        1279
Binary mismatch= -0.0072
Raw binary mismatch =        3757
Binary mismatch= 0.0176
Raw binary mismatch =        3948
Binary mismatch= 0.0195
Raw binary mismatch =        2799
Binary mismatch= 0.0080
Raw binary mismatch =        1660
Binary mismatch= -0.0034
Raw binary mismatch =        2816
Binary mismatch= 0.0082
Raw binary mismatch =        2335
Binary mismatch= 0.0034
Raw binary mismatch =        2321
Binary mismatch= 0.0032
Raw binary mismatch =        2665
Binary mismatch= 0.0066
Raw binary mismatch =        3760
Binary mismatch= 0.0176
Raw binary mismatch =        1516
Binary mismatch= -0.0048
Raw binary mismatch =        1405
Binary mismatch= -0.0060
Raw binary mismatch =        3288
Binary mismatch= 0.0129
Raw binary mismatch =        3501
Binary mismatch= 0.0150
Raw binary mismatch =         180
Binary mismatch= -0.0182
Raw binary mismatch =         960
Binary mismatch= -0.0104
Raw binary mismatch =        3067
Binary mismatch= 0.0107
Raw binary mismatch =        2753
Binary mismatch= 0.0075
Raw binary mismatch =        1014
Binary mismatch= -0.0099
Raw binary mismatch =         641
Binary mismatch= -0.0136
Raw binary mismatch =        3068
Binary mismatch= 0.0107
Raw binary mismatch =        2771
Binary mismatch= 0.0077
Raw binary mismatch =        3723
Binary mismatch= 0.0172
Raw binary mismatch =         839
Binary mismatch= -0.0116
Raw binary mismatch =        2341
Binary mismatch= 0.0034
Raw binary mismatch =        2535
Binary mismatch= 0.0053
Raw binary mismatch =        3178
Binary mismatch= 0.0118
Raw binary mismatch =        1970
Binary mismatch= -0.0003
Raw binary mismatch =        2296
Binary mismatch= 0.0030
Raw binary mismatch =        3483
Binary mismatch= 0.0148
Raw binary mismatch =        3907
Binary mismatch= 0.0191
Raw binary mismatch =        3839
Binary mismatch= 0.0184
Raw binary mismatch =        1653
Binary mismatch= -0.0035
Raw binary mismatch =        1449
Binary mismatch= -0.0055
Raw binary mismatch =        2374
Binary mismatch= 0.0037
Raw binary mismatch =        2375
Binary mismatch= 0.0037
Raw binary mismatch =        2457
Binary mismatch= 0.0046
Raw binary mismatch =        3114
Binary mismatch= 0.0111
Raw binary mismatch =        1378
Binary mismatch= -0.0062
Raw binary mismatch =        1995
Binary mismatch= -0.0001
Raw binary mismatch =         228
Binary mismatch= -0.0177
Raw binary mismatch =        1599
Binary mismatch= -0.0040
Raw binary mismatch =         945
Binary mismatch= -0.0106
Raw binary mismatch =        2247
Binary mismatch= 0.0025
Raw binary mismatch =          23
Binary mismatch= -0.0198
Raw binary mismatch =        3224
Binary mismatch= 0.0122
Raw binary mismatch =        3231
Binary mismatch= 0.0123
Raw binary mismatch =        1173
Binary mismatch= -0.0083
Raw binary mismatch =        1760
Binary mismatch= -0.0024
Raw binary mismatch =        2938
Binary mismatch= 0.0094
Raw binary mismatch =         198
Binary mismatch= -0.0180
Raw binary mismatch =        1286
Binary mismatch= -0.0071
Raw binary mismatch =         576
Binary mismatch= -0.0142
Raw binary mismatch =         171
Binary mismatch= -0.0183
Raw binary mismatch =        3499
Binary mismatch= 0.0150
Raw binary mismatch =        1751
Binary mismatch= -0.0025
Raw binary mismatch =        3552
Binary mismatch= 0.0155
Raw binary mismatch =        2335
Binary mismatch= 0.0034
Raw binary mismatch =        3039
Binary mismatch= 0.0104
Raw binary mismatch =        3407
Binary mismatch= 0.0141
Raw binary mismatch =          89
Binary mismatch= -0.0191
Raw binary mismatch =        1330
Binary mismatch= -0.0067
Raw binary mismatch =        1312
Binary mismatch= -0.0069
Raw binary mismatch =        2371
Binary mismatch= 0.0037
Raw binary mismatch =        2702
Binary mismatch= 0.0070
Raw binary mismatch =        2929
Binary mismatch= 0.0093
Raw binary mismatch =        2327
Binary mismatch= 0.0033
Raw binary mismatch =        2899
Binary mismatch= 0.0090
Raw binary mismatch =        3023
Binary mismatch= 0.0102
Raw binary mismatch =        1424
Binary mismatch= -0.0058
Raw binary mismatch =        3609
Binary mismatch= 0.0161
Raw binary mismatch =        3436
Binary mismatch= 0.0144
Raw binary mismatch =        3190
Binary mismatch= 0.0119
Raw binary mismatch =        2290
Binary mismatch= 0.0029
Raw binary mismatch =        3273
Binary mismatch= 0.0127
Raw binary mismatch =        3686
Binary mismatch= 0.0169
Raw binary mismatch =        2475
Binary mismatch= 0.0047
Raw binary mismatch =        1351
Binary mismatch= -0.0065
Raw binary mismatch =        1970
Binary mismatch= -0.0003
Raw binary mismatch =        1701
Binary mismatch= -0.0030
Raw binary mismatch =        2305
Binary mismatch= 0.0031
Raw binary mismatch =        1575
Binary mismatch= -0.0043
Raw binary mismatch =        2991
Binary mismatch= 0.0099
Raw binary mismatch =        1626
Binary mismatch= -0.0037
Raw binary mismatch =        1528
Binary mismatch= -0.0047
Raw binary mismatch =        3994
Binary mismatch= 0.0199
atb1 = `wrealZState, atb0 = `wrealZState
Test 3: Estado encendido con atb_ena = 2'b01
Raw binary mismatch =        2196
Binary mismatch= 0.0020
Raw binary mismatch =        3370
Binary mismatch= 0.0137
Raw binary mismatch =        1054
Binary mismatch= -0.0095
Raw binary mismatch =        3357
Binary mismatch= 0.0136
Raw binary mismatch =         510
Binary mismatch= -0.0149
Raw binary mismatch =        1390
Binary mismatch= -0.0061
Raw binary mismatch =         294
Binary mismatch= -0.0171
Raw binary mismatch =         386
Binary mismatch= -0.0161
Raw binary mismatch =        1968
Binary mismatch= -0.0003
Raw binary mismatch =        3326
Binary mismatch= 0.0133
Raw binary mismatch =        1828
Binary mismatch= -0.0017
Raw binary mismatch =        1274
Binary mismatch= -0.0073
Raw binary mismatch =         616
Binary mismatch= -0.0138
Raw binary mismatch =        1541
Binary mismatch= -0.0046
Raw binary mismatch =         458
Binary mismatch= -0.0154
Raw binary mismatch =        3384
Binary mismatch= 0.0138
Raw binary mismatch =         909
Binary mismatch= -0.0109
Raw binary mismatch =        3291
Binary mismatch= 0.0129
Raw binary mismatch =         821
Binary mismatch= -0.0118
Raw binary mismatch =        1944
Binary mismatch= -0.0006
Raw binary mismatch =        3636
Binary mismatch= 0.0164
Raw binary mismatch =        3011
Binary mismatch= 0.0101
Raw binary mismatch =        3154
Binary mismatch= 0.0115
Raw binary mismatch =        3781
Binary mismatch= 0.0178
Raw binary mismatch =        1149
Binary mismatch= -0.0085
Raw binary mismatch =        2156
Binary mismatch= 0.0016
Raw binary mismatch =         469
Binary mismatch= -0.0153
Raw binary mismatch =        1459
Binary mismatch= -0.0054
Raw binary mismatch =        1941
Binary mismatch= -0.0006
Raw binary mismatch =         849
Binary mismatch= -0.0115
Raw binary mismatch =        3906
Binary mismatch= 0.0191
Raw binary mismatch =        3012
Binary mismatch= 0.0101
Raw binary mismatch =        1972
Binary mismatch= -0.0003
Raw binary mismatch =        2459
Binary mismatch= 0.0046
Raw binary mismatch =         614
Binary mismatch= -0.0139
Raw binary mismatch =           5
Binary mismatch= -0.0199
Raw binary mismatch =        1471
Binary mismatch= -0.0053
Raw binary mismatch =        1436
Binary mismatch= -0.0056
Raw binary mismatch =        2397
Binary mismatch= 0.0040
Raw binary mismatch =        2288
Binary mismatch= 0.0029
Raw binary mismatch =        3525
Binary mismatch= 0.0152
Raw binary mismatch =        3956
Binary mismatch= 0.0196
Raw binary mismatch =        1260
Binary mismatch= -0.0074
Raw binary mismatch =          10
Binary mismatch= -0.0199
Raw binary mismatch =         964
Binary mismatch= -0.0104
Raw binary mismatch =        2958
Binary mismatch= 0.0096
Raw binary mismatch =        1382
Binary mismatch= -0.0062
Raw binary mismatch =        2020
Binary mismatch= 0.0002
Raw binary mismatch =        3339
Binary mismatch= 0.0134
Raw binary mismatch =        2292
Binary mismatch= 0.0029
Raw binary mismatch =         685
Binary mismatch= -0.0132
Raw binary mismatch =          48
Binary mismatch= -0.0195
Raw binary mismatch =          27
Binary mismatch= -0.0197
Raw binary mismatch =        1852
Binary mismatch= -0.0015
Raw binary mismatch =         989
Binary mismatch= -0.0101
Raw binary mismatch =          37
Binary mismatch= -0.0196
Raw binary mismatch =        2075
Binary mismatch= 0.0008
Raw binary mismatch =        3800
Binary mismatch= 0.0180
Raw binary mismatch =         905
Binary mismatch= -0.0109
Raw binary mismatch =        2028
Binary mismatch= 0.0003
Raw binary mismatch =         820
Binary mismatch= -0.0118
Raw binary mismatch =        2352
Binary mismatch= 0.0035
Raw binary mismatch =        3471
Binary mismatch= 0.0147
Raw binary mismatch =         501
Binary mismatch= -0.0150
Raw binary mismatch =        1117
Binary mismatch= -0.0088
Raw binary mismatch =        2811
Binary mismatch= 0.0081
Raw binary mismatch =        1790
Binary mismatch= -0.0021
Raw binary mismatch =        2269
Binary mismatch= 0.0027
Raw binary mismatch =        3833
Binary mismatch= 0.0183
Raw binary mismatch =         346
Binary mismatch= -0.0165
Raw binary mismatch =         428
Binary mismatch= -0.0157
Raw binary mismatch =        3785
Binary mismatch= 0.0179
Raw binary mismatch =        3605
Binary mismatch= 0.0160
Raw binary mismatch =        2299
Binary mismatch= 0.0030
Raw binary mismatch =         511
Binary mismatch= -0.0149
Raw binary mismatch =        3149
Binary mismatch= 0.0115
Raw binary mismatch =        3725
Binary mismatch= 0.0173
Raw binary mismatch =        1174
Binary mismatch= -0.0083
Raw binary mismatch =        3975
Binary mismatch= 0.0198
Raw binary mismatch =        2378
Binary mismatch= 0.0038
Raw binary mismatch =        2182
Binary mismatch= 0.0018
Raw binary mismatch =        3344
Binary mismatch= 0.0134
Raw binary mismatch =        1280
Binary mismatch= -0.0072
Raw binary mismatch =        1290
Binary mismatch= -0.0071
Raw binary mismatch =        2067
Binary mismatch= 0.0007
Raw binary mismatch =        1245
Binary mismatch= -0.0076
Raw binary mismatch =         466
Binary mismatch= -0.0153
Raw binary mismatch =        2756
Binary mismatch= 0.0076
Raw binary mismatch =        1266
Binary mismatch= -0.0073
Raw binary mismatch =        2039
Binary mismatch= 0.0004
Raw binary mismatch =        1234
Binary mismatch= -0.0077
Raw binary mismatch =        3388
Binary mismatch= 0.0139
Raw binary mismatch =        2093
Binary mismatch= 0.0009
Raw binary mismatch =        1995
Binary mismatch= -0.0001
Raw binary mismatch =        2593
Binary mismatch= 0.0059
Raw binary mismatch =        3297
Binary mismatch= 0.0130
Raw binary mismatch =        1546
Binary mismatch= -0.0045
Raw binary mismatch =        1098
Binary mismatch= -0.0090
Raw binary mismatch =         850
Binary mismatch= -0.0115
Raw binary mismatch =        3988
Binary mismatch= 0.0199
Raw binary mismatch =        2788
Binary mismatch= 0.0079
Raw binary mismatch =        1740
Binary mismatch= -0.0026
Raw binary mismatch =        1211
Binary mismatch= -0.0079
Raw binary mismatch =        3278
Binary mismatch= 0.0128
Raw binary mismatch =        1125
Binary mismatch= -0.0088
Raw binary mismatch =        2920
Binary mismatch= 0.0092
Raw binary mismatch =          30
Binary mismatch= -0.0197
Raw binary mismatch =          65
Binary mismatch= -0.0193
Raw binary mismatch =        3081
Binary mismatch= 0.0108
Raw binary mismatch =        2412
Binary mismatch= 0.0041
Raw binary mismatch =        2802
Binary mismatch= 0.0080
Raw binary mismatch =        1034
Binary mismatch= -0.0097
Raw binary mismatch =        1861
Binary mismatch= -0.0014
Raw binary mismatch =          66
Binary mismatch= -0.0193
Raw binary mismatch =        3244
Binary mismatch= 0.0124
Raw binary mismatch =        2944
Binary mismatch= 0.0094
Raw binary mismatch =        1292
Binary mismatch= -0.0071
Raw binary mismatch =         432
Binary mismatch= -0.0157
Raw binary mismatch =        3679
Binary mismatch= 0.0168
Raw binary mismatch =        3352
Binary mismatch= 0.0135
Raw binary mismatch =         655
Binary mismatch= -0.0135
Raw binary mismatch =        3319
Binary mismatch= 0.0132
Raw binary mismatch =        2485
Binary mismatch= 0.0049
Raw binary mismatch =         832
Binary mismatch= -0.0117
Raw binary mismatch =        3862
Binary mismatch= 0.0186
Raw binary mismatch =        1558
Binary mismatch= -0.0044
Raw binary mismatch =        2394
Binary mismatch= 0.0039
Raw binary mismatch =        2854
Binary mismatch= 0.0085
Raw binary mismatch =        1002
Binary mismatch= -0.0100
Raw binary mismatch =         934
Binary mismatch= -0.0107
Raw binary mismatch =        2288
Binary mismatch= 0.0029
Raw binary mismatch =        1648
Binary mismatch= -0.0035
Raw binary mismatch =        1997
Binary mismatch= -0.0000
Raw binary mismatch =        3805
Binary mismatch= 0.0181
Raw binary mismatch =        1177
Binary mismatch= -0.0082
Raw binary mismatch =        1891
Binary mismatch= -0.0011
Raw binary mismatch =        1790
Binary mismatch= -0.0021
Raw binary mismatch =         238
Binary mismatch= -0.0176
Raw binary mismatch =        2867
Binary mismatch= 0.0087
Raw binary mismatch =        3039
Binary mismatch= 0.0104
Raw binary mismatch =          88
Binary mismatch= -0.0191
Raw binary mismatch =        2213
Binary mismatch= 0.0021
Raw binary mismatch =         917
Binary mismatch= -0.0108
Raw binary mismatch =        3486
Binary mismatch= 0.0149
Raw binary mismatch =        3580
Binary mismatch= 0.0158
Raw binary mismatch =         839
Binary mismatch= -0.0116
Raw binary mismatch =        2109
Binary mismatch= 0.0011
Raw binary mismatch =        3225
Binary mismatch= 0.0123
Raw binary mismatch =        1305
Binary mismatch= -0.0069
Raw binary mismatch =        2919
Binary mismatch= 0.0092
Raw binary mismatch =        2502
Binary mismatch= 0.0050
Raw binary mismatch =          33
Binary mismatch= -0.0197
Raw binary mismatch =        1486
Binary mismatch= -0.0051
Raw binary mismatch =        1282
Binary mismatch= -0.0072
Raw binary mismatch =          44
Binary mismatch= -0.0196
Raw binary mismatch =        3756
Binary mismatch= 0.0176
Raw binary mismatch =        2374
Binary mismatch= 0.0037
Raw binary mismatch =        1632
Binary mismatch= -0.0037
Raw binary mismatch =        3017
Binary mismatch= 0.0102
Raw binary mismatch =        2975
Binary mismatch= 0.0097
Raw binary mismatch =        2152
Binary mismatch= 0.0015
Raw binary mismatch =         354
Binary mismatch= -0.0165
Raw binary mismatch =        3316
Binary mismatch= 0.0132
Raw binary mismatch =        3259
Binary mismatch= 0.0126
Raw binary mismatch =         601
Binary mismatch= -0.0140
Raw binary mismatch =        2665
Binary mismatch= 0.0066
Raw binary mismatch =         349
Binary mismatch= -0.0165
Raw binary mismatch =        2877
Binary mismatch= 0.0088
Raw binary mismatch =        1625
Binary mismatch= -0.0037
Raw binary mismatch =        2319
Binary mismatch= 0.0032
Raw binary mismatch =        1748
Binary mismatch= -0.0025
Raw binary mismatch =        3902
Binary mismatch= 0.0190
Raw binary mismatch =        1795
Binary mismatch= -0.0021
Raw binary mismatch =        2762
Binary mismatch= 0.0076
Raw binary mismatch =        1730
Binary mismatch= -0.0027
Raw binary mismatch =         723
Binary mismatch= -0.0128
Raw binary mismatch =         719
Binary mismatch= -0.0128
Raw binary mismatch =        3278
Binary mismatch= 0.0128
Raw binary mismatch =        1932
Binary mismatch= -0.0007
Raw binary mismatch =         620
Binary mismatch= -0.0138
Raw binary mismatch =        2226
Binary mismatch= 0.0023
Raw binary mismatch =         778
Binary mismatch= -0.0122
Raw binary mismatch =        3093
Binary mismatch= 0.0109
Raw binary mismatch =        1078
Binary mismatch= -0.0092
Raw binary mismatch =        3643
Binary mismatch= 0.0164
Raw binary mismatch =        3240
Binary mismatch= 0.0124
Raw binary mismatch =        2522
Binary mismatch= 0.0052
Raw binary mismatch =          59
Binary mismatch= -0.0194
Raw binary mismatch =          21
Binary mismatch= -0.0198
Raw binary mismatch =        3535
Binary mismatch= 0.0154
Raw binary mismatch =        3958
Binary mismatch= 0.0196
Raw binary mismatch =        1632
Binary mismatch= -0.0037
Raw binary mismatch =         838
Binary mismatch= -0.0116
Raw binary mismatch =        1369
Binary mismatch= -0.0063
Raw binary mismatch =        2059
Binary mismatch= 0.0006
Raw binary mismatch =        2870
Binary mismatch= 0.0087
Raw binary mismatch =        1896
Binary mismatch= -0.0010
Raw binary mismatch =        3151
Binary mismatch= 0.0115
Raw binary mismatch =        1861
Binary mismatch= -0.0014
Raw binary mismatch =         948
Binary mismatch= -0.0105
Raw binary mismatch =        2453
Binary mismatch= 0.0045
Raw binary mismatch =        3054
Binary mismatch= 0.0105
Raw binary mismatch =        2274
Binary mismatch= 0.0027
Raw binary mismatch =         300
Binary mismatch= -0.0170
Raw binary mismatch =        2650
Binary mismatch= 0.0065
Raw binary mismatch =        3629
Binary mismatch= 0.0163
Raw binary mismatch =        2777
Binary mismatch= 0.0078
Raw binary mismatch =        2987
Binary mismatch= 0.0099
Raw binary mismatch =         981
Binary mismatch= -0.0102
Raw binary mismatch =         652
Binary mismatch= -0.0135
Raw binary mismatch =         395
Binary mismatch= -0.0160
Raw binary mismatch =        2761
Binary mismatch= 0.0076
Raw binary mismatch =        3691
Binary mismatch= 0.0169
Raw binary mismatch =        3067
Binary mismatch= 0.0107
Raw binary mismatch =        1637
Binary mismatch= -0.0036
Raw binary mismatch =        1322
Binary mismatch= -0.0068
Raw binary mismatch =        3377
Binary mismatch= 0.0138
Raw binary mismatch =        2869
Binary mismatch= 0.0087
Raw binary mismatch =        1504
Binary mismatch= -0.0050
Raw binary mismatch =         671
Binary mismatch= -0.0133
Raw binary mismatch =          38
Binary mismatch= -0.0196
Raw binary mismatch =        3551
Binary mismatch= 0.0155
Raw binary mismatch =         515
Binary mismatch= -0.0149
Raw binary mismatch =        1093
Binary mismatch= -0.0091
Raw binary mismatch =        1396
Binary mismatch= -0.0060
Raw binary mismatch =        3980
Binary mismatch= 0.0198
Raw binary mismatch =        3070
Binary mismatch= 0.0107
Raw binary mismatch =        2915
Binary mismatch= 0.0092
Raw binary mismatch =        1589
Binary mismatch= -0.0041
Raw binary mismatch =         506
Binary mismatch= -0.0149
Raw binary mismatch =        1006
Binary mismatch= -0.0099
Raw binary mismatch =         910
Binary mismatch= -0.0109
Raw binary mismatch =        1962
Binary mismatch= -0.0004
Raw binary mismatch =        2996
Binary mismatch= 0.0100
Raw binary mismatch =         830
Binary mismatch= -0.0117
Raw binary mismatch =         998
Binary mismatch= -0.0100
Raw binary mismatch =        1988
Binary mismatch= -0.0001
Raw binary mismatch =        3279
Binary mismatch= 0.0128
Raw binary mismatch =         706
Binary mismatch= -0.0129
Raw binary mismatch =          56
Binary mismatch= -0.0194
atb1 = 0.80, atb0 = 0.00
Test 4: Estado encendido con atb_ena = 2'b10
Raw binary mismatch =         550
Binary mismatch= -0.0145
Raw binary mismatch =         289
Binary mismatch= -0.0171
Raw binary mismatch =        2807
Binary mismatch= 0.0081
Raw binary mismatch =        1748
Binary mismatch= -0.0025
Raw binary mismatch =          97
Binary mismatch= -0.0190
Raw binary mismatch =        3117
Binary mismatch= 0.0112
Raw binary mismatch =         724
Binary mismatch= -0.0128
Raw binary mismatch =         918
Binary mismatch= -0.0108
Raw binary mismatch =        1394
Binary mismatch= -0.0061
Raw binary mismatch =        2402
Binary mismatch= 0.0040
Raw binary mismatch =        2957
Binary mismatch= 0.0096
Raw binary mismatch =        2505
Binary mismatch= 0.0050
Raw binary mismatch =        2340
Binary mismatch= 0.0034
Raw binary mismatch =        1383
Binary mismatch= -0.0062
Raw binary mismatch =         603
Binary mismatch= -0.0140
Raw binary mismatch =         370
Binary mismatch= -0.0163
Raw binary mismatch =        1566
Binary mismatch= -0.0043
Raw binary mismatch =        3519
Binary mismatch= 0.0152
Raw binary mismatch =        3893
Binary mismatch= 0.0189
Raw binary mismatch =         243
Binary mismatch= -0.0176
Raw binary mismatch =        3621
Binary mismatch= 0.0162
Raw binary mismatch =         361
Binary mismatch= -0.0164
Raw binary mismatch =        1580
Binary mismatch= -0.0042
Raw binary mismatch =        2952
Binary mismatch= 0.0095
Raw binary mismatch =        3129
Binary mismatch= 0.0113
Raw binary mismatch =        3648
Binary mismatch= 0.0165
Raw binary mismatch =        2253
Binary mismatch= 0.0025
Raw binary mismatch =        2121
Binary mismatch= 0.0012
Raw binary mismatch =        2517
Binary mismatch= 0.0052
Raw binary mismatch =        1371
Binary mismatch= -0.0063
Raw binary mismatch =        2660
Binary mismatch= 0.0066
Raw binary mismatch =          76
Binary mismatch= -0.0192
Raw binary mismatch =        3089
Binary mismatch= 0.0109
Raw binary mismatch =        1964
Binary mismatch= -0.0004
Raw binary mismatch =        2517
Binary mismatch= 0.0052
Raw binary mismatch =        1634
Binary mismatch= -0.0037
Raw binary mismatch =        1154
Binary mismatch= -0.0085
Raw binary mismatch =        1219
Binary mismatch= -0.0078
Raw binary mismatch =        1955
Binary mismatch= -0.0004
Raw binary mismatch =        2903
Binary mismatch= 0.0090
Raw binary mismatch =         374
Binary mismatch= -0.0163
Raw binary mismatch =        3051
Binary mismatch= 0.0105
Raw binary mismatch =        1451
Binary mismatch= -0.0055
Raw binary mismatch =        1236
Binary mismatch= -0.0076
Raw binary mismatch =         667
Binary mismatch= -0.0133
Raw binary mismatch =        3306
Binary mismatch= 0.0131
Raw binary mismatch =        1224
Binary mismatch= -0.0078
Raw binary mismatch =        3071
Binary mismatch= 0.0107
Raw binary mismatch =        2050
Binary mismatch= 0.0005
Raw binary mismatch =        3605
Binary mismatch= 0.0160
Raw binary mismatch =        3218
Binary mismatch= 0.0122
Raw binary mismatch =         838
Binary mismatch= -0.0116
Raw binary mismatch =         407
Binary mismatch= -0.0159
Raw binary mismatch =        1127
Binary mismatch= -0.0087
Raw binary mismatch =         149
Binary mismatch= -0.0185
Raw binary mismatch =        2077
Binary mismatch= 0.0008
Raw binary mismatch =        2059
Binary mismatch= 0.0006
Raw binary mismatch =         148
Binary mismatch= -0.0185
Raw binary mismatch =         189
Binary mismatch= -0.0181
Raw binary mismatch =        2734
Binary mismatch= 0.0073
Raw binary mismatch =        3812
Binary mismatch= 0.0181
Raw binary mismatch =        1676
Binary mismatch= -0.0032
Raw binary mismatch =        2423
Binary mismatch= 0.0042
Raw binary mismatch =        2396
Binary mismatch= 0.0040
Raw binary mismatch =        1560
Binary mismatch= -0.0044
Raw binary mismatch =        2343
Binary mismatch= 0.0034
Raw binary mismatch =        1853
Binary mismatch= -0.0015
Raw binary mismatch =        3704
Binary mismatch= 0.0170
Raw binary mismatch =        1092
Binary mismatch= -0.0091
Raw binary mismatch =        3213
Binary mismatch= 0.0121
Raw binary mismatch =        3508
Binary mismatch= 0.0151
Raw binary mismatch =        2142
Binary mismatch= 0.0014
Raw binary mismatch =        2900
Binary mismatch= 0.0090
Raw binary mismatch =        1903
Binary mismatch= -0.0010
Raw binary mismatch =        3213
Binary mismatch= 0.0121
Raw binary mismatch =        1239
Binary mismatch= -0.0076
Raw binary mismatch =        2495
Binary mismatch= 0.0050
Raw binary mismatch =        3853
Binary mismatch= 0.0185
Raw binary mismatch =        1510
Binary mismatch= -0.0049
Raw binary mismatch =        1207
Binary mismatch= -0.0079
Raw binary mismatch =        2378
Binary mismatch= 0.0038
Raw binary mismatch =        2385
Binary mismatch= 0.0039
Raw binary mismatch =        2280
Binary mismatch= 0.0028
Raw binary mismatch =         702
Binary mismatch= -0.0130
Raw binary mismatch =        1347
Binary mismatch= -0.0065
Raw binary mismatch =        3600
Binary mismatch= 0.0160
Raw binary mismatch =        3369
Binary mismatch= 0.0137
Raw binary mismatch =         568
Binary mismatch= -0.0143
Raw binary mismatch =        2597
Binary mismatch= 0.0060
Raw binary mismatch =         430
Binary mismatch= -0.0157
Raw binary mismatch =        2825
Binary mismatch= 0.0083
Raw binary mismatch =        1407
Binary mismatch= -0.0059
Raw binary mismatch =        1145
Binary mismatch= -0.0086
Raw binary mismatch =        3257
Binary mismatch= 0.0126
Raw binary mismatch =        1815
Binary mismatch= -0.0019
Raw binary mismatch =        3606
Binary mismatch= 0.0161
Raw binary mismatch =        1151
Binary mismatch= -0.0085
Raw binary mismatch =         601
Binary mismatch= -0.0140
Raw binary mismatch =        2071
Binary mismatch= 0.0007
Raw binary mismatch =         248
Binary mismatch= -0.0175
Raw binary mismatch =        3274
Binary mismatch= 0.0127
Raw binary mismatch =        1972
Binary mismatch= -0.0003
Raw binary mismatch =        3019
Binary mismatch= 0.0102
Raw binary mismatch =        2305
Binary mismatch= 0.0031
Raw binary mismatch =        3053
Binary mismatch= 0.0105
Raw binary mismatch =        3332
Binary mismatch= 0.0133
Raw binary mismatch =        1687
Binary mismatch= -0.0031
Raw binary mismatch =        2416
Binary mismatch= 0.0042
Raw binary mismatch =        2407
Binary mismatch= 0.0041
Raw binary mismatch =          68
Binary mismatch= -0.0193
Raw binary mismatch =        3241
Binary mismatch= 0.0124
Raw binary mismatch =        3744
Binary mismatch= 0.0174
Raw binary mismatch =         309
Binary mismatch= -0.0169
Raw binary mismatch =        2698
Binary mismatch= 0.0070
Raw binary mismatch =          11
Binary mismatch= -0.0199
Raw binary mismatch =         676
Binary mismatch= -0.0132
Raw binary mismatch =        3182
Binary mismatch= 0.0118
Raw binary mismatch =        3626
Binary mismatch= 0.0163
Raw binary mismatch =        2787
Binary mismatch= 0.0079
Raw binary mismatch =        3310
Binary mismatch= 0.0131
Raw binary mismatch =        3399
Binary mismatch= 0.0140
Raw binary mismatch =        2483
Binary mismatch= 0.0048
Raw binary mismatch =        3890
Binary mismatch= 0.0189
Raw binary mismatch =        3274
Binary mismatch= 0.0127
Raw binary mismatch =        1966
Binary mismatch= -0.0003
Raw binary mismatch =        1071
Binary mismatch= -0.0093
Raw binary mismatch =        3382
Binary mismatch= 0.0138
Raw binary mismatch =        3842
Binary mismatch= 0.0184
Raw binary mismatch =        1041
Binary mismatch= -0.0096
Raw binary mismatch =         453
Binary mismatch= -0.0155
Raw binary mismatch =        2314
Binary mismatch= 0.0031
Raw binary mismatch =         697
Binary mismatch= -0.0130
Raw binary mismatch =        3350
Binary mismatch= 0.0135
Raw binary mismatch =         921
Binary mismatch= -0.0108
Raw binary mismatch =        1700
Binary mismatch= -0.0030
Raw binary mismatch =        1586
Binary mismatch= -0.0041
Raw binary mismatch =         514
Binary mismatch= -0.0149
Raw binary mismatch =        3208
Binary mismatch= 0.0121
Raw binary mismatch =        2100
Binary mismatch= 0.0010
Raw binary mismatch =        2025
Binary mismatch= 0.0003
Raw binary mismatch =        2772
Binary mismatch= 0.0077
Raw binary mismatch =        1455
Binary mismatch= -0.0054
Raw binary mismatch =         298
Binary mismatch= -0.0170
Raw binary mismatch =        3351
Binary mismatch= 0.0135
Raw binary mismatch =        2517
Binary mismatch= 0.0052
Raw binary mismatch =        3307
Binary mismatch= 0.0131
Raw binary mismatch =        2724
Binary mismatch= 0.0072
Raw binary mismatch =        1920
Binary mismatch= -0.0008
Raw binary mismatch =        1365
Binary mismatch= -0.0063
Raw binary mismatch =         778
Binary mismatch= -0.0122
Raw binary mismatch =         145
Binary mismatch= -0.0186
Raw binary mismatch =        1139
Binary mismatch= -0.0086
Raw binary mismatch =         631
Binary mismatch= -0.0137
Raw binary mismatch =         373
Binary mismatch= -0.0163
Raw binary mismatch =          56
Binary mismatch= -0.0194
Raw binary mismatch =        2579
Binary mismatch= 0.0058
Raw binary mismatch =         728
Binary mismatch= -0.0127
Raw binary mismatch =        1749
Binary mismatch= -0.0025
Raw binary mismatch =        2724
Binary mismatch= 0.0072
Raw binary mismatch =        1063
Binary mismatch= -0.0094
Raw binary mismatch =        3698
Binary mismatch= 0.0170
Raw binary mismatch =         592
Binary mismatch= -0.0141
Raw binary mismatch =         284
Binary mismatch= -0.0172
Raw binary mismatch =        2578
Binary mismatch= 0.0058
Raw binary mismatch =        2364
Binary mismatch= 0.0036
Raw binary mismatch =        3494
Binary mismatch= 0.0149
Raw binary mismatch =        3206
Binary mismatch= 0.0121
Raw binary mismatch =         916
Binary mismatch= -0.0108
Raw binary mismatch =        1863
Binary mismatch= -0.0014
Raw binary mismatch =        1235
Binary mismatch= -0.0076
Raw binary mismatch =        2975
Binary mismatch= 0.0097
Raw binary mismatch =        3558
Binary mismatch= 0.0156
Raw binary mismatch =        3904
Binary mismatch= 0.0190
Raw binary mismatch =        2610
Binary mismatch= 0.0061
Raw binary mismatch =        2118
Binary mismatch= 0.0012
Raw binary mismatch =        2656
Binary mismatch= 0.0066
Raw binary mismatch =        2611
Binary mismatch= 0.0061
Raw binary mismatch =        2294
Binary mismatch= 0.0029
Raw binary mismatch =        1392
Binary mismatch= -0.0061
Raw binary mismatch =        3252
Binary mismatch= 0.0125
Raw binary mismatch =        3332
Binary mismatch= 0.0133
Raw binary mismatch =        2673
Binary mismatch= 0.0067
Raw binary mismatch =        3731
Binary mismatch= 0.0173
Raw binary mismatch =          51
Binary mismatch= -0.0195
Raw binary mismatch =         214
Binary mismatch= -0.0179
Raw binary mismatch =        1071
Binary mismatch= -0.0093
Raw binary mismatch =        3965
Binary mismatch= 0.0197
Raw binary mismatch =        3749
Binary mismatch= 0.0175
Raw binary mismatch =         199
Binary mismatch= -0.0180
Raw binary mismatch =        1498
Binary mismatch= -0.0050
Raw binary mismatch =        1948
Binary mismatch= -0.0005
Raw binary mismatch =        2899
Binary mismatch= 0.0090
Raw binary mismatch =         145
Binary mismatch= -0.0186
Raw binary mismatch =        1748
Binary mismatch= -0.0025
Raw binary mismatch =         358
Binary mismatch= -0.0164
Raw binary mismatch =        1528
Binary mismatch= -0.0047
Raw binary mismatch =        1863
Binary mismatch= -0.0014
Raw binary mismatch =        3293
Binary mismatch= 0.0129
Raw binary mismatch =        3138
Binary mismatch= 0.0114
Raw binary mismatch =        3389
Binary mismatch= 0.0139
Raw binary mismatch =         877
Binary mismatch= -0.0112
Raw binary mismatch =         395
Binary mismatch= -0.0160
Raw binary mismatch =        1104
Binary mismatch= -0.0090
Raw binary mismatch =        3319
Binary mismatch= 0.0132
Raw binary mismatch =         914
Binary mismatch= -0.0109
Raw binary mismatch =        1698
Binary mismatch= -0.0030
Raw binary mismatch =        2596
Binary mismatch= 0.0060
Raw binary mismatch =        2754
Binary mismatch= 0.0075
Raw binary mismatch =         814
Binary mismatch= -0.0119
Raw binary mismatch =        3475
Binary mismatch= 0.0147
Raw binary mismatch =         604
Binary mismatch= -0.0140
Raw binary mismatch =        2531
Binary mismatch= 0.0053
Raw binary mismatch =         392
Binary mismatch= -0.0161
Raw binary mismatch =        3003
Binary mismatch= 0.0100
Raw binary mismatch =        3589
Binary mismatch= 0.0159
Raw binary mismatch =        2733
Binary mismatch= 0.0073
Raw binary mismatch =         399
Binary mismatch= -0.0160
Raw binary mismatch =        2849
Binary mismatch= 0.0085
Raw binary mismatch =         949
Binary mismatch= -0.0105
Raw binary mismatch =        2143
Binary mismatch= 0.0014
Raw binary mismatch =        2050
Binary mismatch= 0.0005
Raw binary mismatch =        1018
Binary mismatch= -0.0098
Raw binary mismatch =         144
Binary mismatch= -0.0186
Raw binary mismatch =        3810
Binary mismatch= 0.0181
Raw binary mismatch =         267
Binary mismatch= -0.0173
Raw binary mismatch =        1479
Binary mismatch= -0.0052
Raw binary mismatch =        2693
Binary mismatch= 0.0069
Raw binary mismatch =         268
Binary mismatch= -0.0173
Raw binary mismatch =        1726
Binary mismatch= -0.0027
Raw binary mismatch =        1363
Binary mismatch= -0.0064
Raw binary mismatch =        1936
Binary mismatch= -0.0006
Raw binary mismatch =        1506
Binary mismatch= -0.0049
Raw binary mismatch =        1629
Binary mismatch= -0.0037
Raw binary mismatch =        2327
Binary mismatch= 0.0033
Raw binary mismatch =         216
Binary mismatch= -0.0178
Raw binary mismatch =         208
Binary mismatch= -0.0179
Raw binary mismatch =         117
Binary mismatch= -0.0188
Raw binary mismatch =        3095
Binary mismatch= 0.0109
Raw binary mismatch =        3728
Binary mismatch= 0.0173
Raw binary mismatch =          17
Binary mismatch= -0.0198
atb1 = 0.80, atb0 = 0.00
Test 5: Estado encendido con atb_ena = 2'b11
Raw binary mismatch =        3207
Binary mismatch= 0.0121
Raw binary mismatch =        3439
Binary mismatch= 0.0144
Raw binary mismatch =        1543
Binary mismatch= -0.0046
Raw binary mismatch =        2308
Binary mismatch= 0.0031
Raw binary mismatch =        3599
Binary mismatch= 0.0160
Raw binary mismatch =        1253
Binary mismatch= -0.0075
Raw binary mismatch =         257
Binary mismatch= -0.0174
Raw binary mismatch =        1868
Binary mismatch= -0.0013
Raw binary mismatch =        2483
Binary mismatch= 0.0048
Raw binary mismatch =        1581
Binary mismatch= -0.0042
Raw binary mismatch =        1776
Binary mismatch= -0.0022
Raw binary mismatch =        1333
Binary mismatch= -0.0067
Raw binary mismatch =        2511
Binary mismatch= 0.0051
Raw binary mismatch =        2372
Binary mismatch= 0.0037
Raw binary mismatch =        1296
Binary mismatch= -0.0070
Raw binary mismatch =        1068
Binary mismatch= -0.0093
Raw binary mismatch =        1275
Binary mismatch= -0.0073
Raw binary mismatch =        1577
Binary mismatch= -0.0042
Raw binary mismatch =        3832
Binary mismatch= 0.0183
Raw binary mismatch =         701
Binary mismatch= -0.0130
Raw binary mismatch =        1933
Binary mismatch= -0.0007
Raw binary mismatch =        3889
Binary mismatch= 0.0189
Raw binary mismatch =        3067
Binary mismatch= 0.0107
Raw binary mismatch =         940
Binary mismatch= -0.0106
Raw binary mismatch =         950
Binary mismatch= -0.0105
Raw binary mismatch =        3762
Binary mismatch= 0.0176
Raw binary mismatch =        3399
Binary mismatch= 0.0140
Raw binary mismatch =        2716
Binary mismatch= 0.0072
Raw binary mismatch =        2018
Binary mismatch= 0.0002
Raw binary mismatch =         858
Binary mismatch= -0.0114
Raw binary mismatch =         744
Binary mismatch= -0.0126
Raw binary mismatch =        1419
Binary mismatch= -0.0058
Raw binary mismatch =        1595
Binary mismatch= -0.0040
Raw binary mismatch =         727
Binary mismatch= -0.0127
Raw binary mismatch =        3715
Binary mismatch= 0.0171
Raw binary mismatch =        1650
Binary mismatch= -0.0035
Raw binary mismatch =        2309
Binary mismatch= 0.0031
Raw binary mismatch =        1744
Binary mismatch= -0.0026
Raw binary mismatch =         509
Binary mismatch= -0.0149
Raw binary mismatch =         839
Binary mismatch= -0.0116
Raw binary mismatch =        1697
Binary mismatch= -0.0030
Raw binary mismatch =         840
Binary mismatch= -0.0116
Raw binary mismatch =         852
Binary mismatch= -0.0115
Raw binary mismatch =         508
Binary mismatch= -0.0149
Raw binary mismatch =        2668
Binary mismatch= 0.0067
Raw binary mismatch =        1407
Binary mismatch= -0.0059
Raw binary mismatch =        3203
Binary mismatch= 0.0120
Raw binary mismatch =        1535
Binary mismatch= -0.0046
Raw binary mismatch =        2044
Binary mismatch= 0.0004
Raw binary mismatch =        3187
Binary mismatch= 0.0119
Raw binary mismatch =        1914
Binary mismatch= -0.0009
Raw binary mismatch =         409
Binary mismatch= -0.0159
Raw binary mismatch =         603
Binary mismatch= -0.0140
Raw binary mismatch =        3244
Binary mismatch= 0.0124
Raw binary mismatch =        1183
Binary mismatch= -0.0082
Raw binary mismatch =          88
Binary mismatch= -0.0191
Raw binary mismatch =         146
Binary mismatch= -0.0185
Raw binary mismatch =        1585
Binary mismatch= -0.0042
Raw binary mismatch =        3889
Binary mismatch= 0.0189
Raw binary mismatch =        3581
Binary mismatch= 0.0158
Raw binary mismatch =        3357
Binary mismatch= 0.0136
Raw binary mismatch =         897
Binary mismatch= -0.0110
Raw binary mismatch =        3236
Binary mismatch= 0.0124
Raw binary mismatch =        2187
Binary mismatch= 0.0019
Raw binary mismatch =         649
Binary mismatch= -0.0135
Raw binary mismatch =         611
Binary mismatch= -0.0139
Raw binary mismatch =        1559
Binary mismatch= -0.0044
Raw binary mismatch =        2353
Binary mismatch= 0.0035
Raw binary mismatch =        1834
Binary mismatch= -0.0017
Raw binary mismatch =        2062
Binary mismatch= 0.0006
Raw binary mismatch =         697
Binary mismatch= -0.0130
Raw binary mismatch =          11
Binary mismatch= -0.0199
Raw binary mismatch =        3172
Binary mismatch= 0.0117
Raw binary mismatch =        2883
Binary mismatch= 0.0088
Raw binary mismatch =         417
Binary mismatch= -0.0158
Raw binary mismatch =        2592
Binary mismatch= 0.0059
Raw binary mismatch =        3332
Binary mismatch= 0.0133
Raw binary mismatch =        2638
Binary mismatch= 0.0064
Raw binary mismatch =         947
Binary mismatch= -0.0105
Raw binary mismatch =         899
Binary mismatch= -0.0110
Raw binary mismatch =         678
Binary mismatch= -0.0132
Raw binary mismatch =        2699
Binary mismatch= 0.0070
Raw binary mismatch =        1503
Binary mismatch= -0.0050
Raw binary mismatch =        3412
Binary mismatch= 0.0141
Raw binary mismatch =        1807
Binary mismatch= -0.0019
Raw binary mismatch =        1150
Binary mismatch= -0.0085
Raw binary mismatch =         996
Binary mismatch= -0.0100
Raw binary mismatch =        1055
Binary mismatch= -0.0095
Raw binary mismatch =         178
Binary mismatch= -0.0182
Raw binary mismatch =        2871
Binary mismatch= 0.0087
Raw binary mismatch =        2279
Binary mismatch= 0.0028
Raw binary mismatch =        2874
Binary mismatch= 0.0087
Raw binary mismatch =        1262
Binary mismatch= -0.0074
Raw binary mismatch =         950
Binary mismatch= -0.0105
Raw binary mismatch =         799
Binary mismatch= -0.0120
Raw binary mismatch =         680
Binary mismatch= -0.0132
Raw binary mismatch =         319
Binary mismatch= -0.0168
Raw binary mismatch =        2742
Binary mismatch= 0.0074
Raw binary mismatch =        3447
Binary mismatch= 0.0145
Raw binary mismatch =        3781
Binary mismatch= 0.0178
Raw binary mismatch =         776
Binary mismatch= -0.0122
Raw binary mismatch =        2155
Binary mismatch= 0.0015
Raw binary mismatch =         744
Binary mismatch= -0.0126
Raw binary mismatch =         287
Binary mismatch= -0.0171
Raw binary mismatch =        1448
Binary mismatch= -0.0055
Raw binary mismatch =        3610
Binary mismatch= 0.0161
Raw binary mismatch =        1100
Binary mismatch= -0.0090
Raw binary mismatch =        2862
Binary mismatch= 0.0086
Raw binary mismatch =        3085
Binary mismatch= 0.0109
Raw binary mismatch =        1446
Binary mismatch= -0.0055
Raw binary mismatch =         431
Binary mismatch= -0.0157
Raw binary mismatch =         512
Binary mismatch= -0.0149
Raw binary mismatch =        1442
Binary mismatch= -0.0056
Raw binary mismatch =        1356
Binary mismatch= -0.0064
Raw binary mismatch =        3323
Binary mismatch= 0.0132
Raw binary mismatch =        3587
Binary mismatch= 0.0159
Raw binary mismatch =         495
Binary mismatch= -0.0150
Raw binary mismatch =        1703
Binary mismatch= -0.0030
Raw binary mismatch =        3315
Binary mismatch= 0.0132
Raw binary mismatch =        1565
Binary mismatch= -0.0043
Raw binary mismatch =        3446
Binary mismatch= 0.0145
Raw binary mismatch =        1324
Binary mismatch= -0.0068
Raw binary mismatch =        3514
Binary mismatch= 0.0151
Raw binary mismatch =        2387
Binary mismatch= 0.0039
Raw binary mismatch =        2614
Binary mismatch= 0.0061
Raw binary mismatch =         749
Binary mismatch= -0.0125
Raw binary mismatch =        1004
Binary mismatch= -0.0100
Raw binary mismatch =         357
Binary mismatch= -0.0164
Raw binary mismatch =        3274
Binary mismatch= 0.0127
Raw binary mismatch =        2808
Binary mismatch= 0.0081
Raw binary mismatch =        2658
Binary mismatch= 0.0066
Raw binary mismatch =        2606
Binary mismatch= 0.0061
Raw binary mismatch =         968
Binary mismatch= -0.0103
Raw binary mismatch =        3991
Binary mismatch= 0.0199
Raw binary mismatch =         464
Binary mismatch= -0.0154
Raw binary mismatch =        1574
Binary mismatch= -0.0043
Raw binary mismatch =        1700
Binary mismatch= -0.0030
Raw binary mismatch =        2319
Binary mismatch= 0.0032
Raw binary mismatch =        2376
Binary mismatch= 0.0038
Raw binary mismatch =        1218
Binary mismatch= -0.0078
Raw binary mismatch =         749
Binary mismatch= -0.0125
Raw binary mismatch =        1860
Binary mismatch= -0.0014
Raw binary mismatch =        2006
Binary mismatch= 0.0001
Raw binary mismatch =        1040
Binary mismatch= -0.0096
Raw binary mismatch =        1836
Binary mismatch= -0.0016
Raw binary mismatch =        1242
Binary mismatch= -0.0076
Raw binary mismatch =        1960
Binary mismatch= -0.0004
Raw binary mismatch =         481
Binary mismatch= -0.0152
Raw binary mismatch =         923
Binary mismatch= -0.0108
Raw binary mismatch =        3206
Binary mismatch= 0.0121
Raw binary mismatch =         437
Binary mismatch= -0.0156
Raw binary mismatch =        3198
Binary mismatch= 0.0120
Raw binary mismatch =         452
Binary mismatch= -0.0155
Raw binary mismatch =        1727
Binary mismatch= -0.0027
Raw binary mismatch =        3590
Binary mismatch= 0.0159
Raw binary mismatch =        1672
Binary mismatch= -0.0033
Raw binary mismatch =         145
Binary mismatch= -0.0186
Raw binary mismatch =        1008
Binary mismatch= -0.0099
Raw binary mismatch =         957
Binary mismatch= -0.0104
Raw binary mismatch =        1007
Binary mismatch= -0.0099
Raw binary mismatch =        1943
Binary mismatch= -0.0006
Raw binary mismatch =        3821
Binary mismatch= 0.0182
Raw binary mismatch =        3750
Binary mismatch= 0.0175
Raw binary mismatch =         237
Binary mismatch= -0.0176
Raw binary mismatch =        2874
Binary mismatch= 0.0087
Raw binary mismatch =         728
Binary mismatch= -0.0127
Raw binary mismatch =         537
Binary mismatch= -0.0146
Raw binary mismatch =        1482
Binary mismatch= -0.0052
Raw binary mismatch =        2024
Binary mismatch= 0.0002
Raw binary mismatch =        3710
Binary mismatch= 0.0171
Raw binary mismatch =        1402
Binary mismatch= -0.0060
Raw binary mismatch =        1401
Binary mismatch= -0.0060
Raw binary mismatch =        3259
Binary mismatch= 0.0126
Raw binary mismatch =          56
Binary mismatch= -0.0194
Raw binary mismatch =         186
Binary mismatch= -0.0181
Raw binary mismatch =        2042
Binary mismatch= 0.0004
Raw binary mismatch =        3769
Binary mismatch= 0.0177
Raw binary mismatch =         557
Binary mismatch= -0.0144
Raw binary mismatch =         405
Binary mismatch= -0.0159
Raw binary mismatch =        1049
Binary mismatch= -0.0095
Raw binary mismatch =        1973
Binary mismatch= -0.0003
Raw binary mismatch =        1933
Binary mismatch= -0.0007
Raw binary mismatch =        2996
Binary mismatch= 0.0100
Raw binary mismatch =        1420
Binary mismatch= -0.0058
Raw binary mismatch =        1838
Binary mismatch= -0.0016
Raw binary mismatch =        2358
Binary mismatch= 0.0036
Raw binary mismatch =        1227
Binary mismatch= -0.0077
Raw binary mismatch =        3735
Binary mismatch= 0.0174
Raw binary mismatch =        2701
Binary mismatch= 0.0070
Raw binary mismatch =        2033
Binary mismatch= 0.0003
Raw binary mismatch =         218
Binary mismatch= -0.0178
Raw binary mismatch =        3881
Binary mismatch= 0.0188
Raw binary mismatch =        1164
Binary mismatch= -0.0084
Raw binary mismatch =        1183
Binary mismatch= -0.0082
Raw binary mismatch =         713
Binary mismatch= -0.0129
Raw binary mismatch =        2673
Binary mismatch= 0.0067
Raw binary mismatch =        3070
Binary mismatch= 0.0107
Raw binary mismatch =        2761
Binary mismatch= 0.0076
Raw binary mismatch =        2711
Binary mismatch= 0.0071
Raw binary mismatch =        1322
Binary mismatch= -0.0068
Raw binary mismatch =         101
Binary mismatch= -0.0190
Raw binary mismatch =         803
Binary mismatch= -0.0120
Raw binary mismatch =        3652
Binary mismatch= 0.0165
Raw binary mismatch =        3554
Binary mismatch= 0.0155
Raw binary mismatch =         238
Binary mismatch= -0.0176
Raw binary mismatch =        1150
Binary mismatch= -0.0085
Raw binary mismatch =         384
Binary mismatch= -0.0162
Raw binary mismatch =        1698
Binary mismatch= -0.0030
Raw binary mismatch =        3727
Binary mismatch= 0.0173
Raw binary mismatch =        2650
Binary mismatch= 0.0065
Raw binary mismatch =        2441
Binary mismatch= 0.0044
Raw binary mismatch =        3294
Binary mismatch= 0.0129
Raw binary mismatch =        1740
Binary mismatch= -0.0026
Raw binary mismatch =        2944
Binary mismatch= 0.0094
Raw binary mismatch =        3464
Binary mismatch= 0.0146
Raw binary mismatch =        3862
Binary mismatch= 0.0186
Raw binary mismatch =         404
Binary mismatch= -0.0160
Raw binary mismatch =         519
Binary mismatch= -0.0148
Raw binary mismatch =        1555
Binary mismatch= -0.0044
Raw binary mismatch =        1239
Binary mismatch= -0.0076
Raw binary mismatch =         867
Binary mismatch= -0.0113
Raw binary mismatch =        1458
Binary mismatch= -0.0054
Raw binary mismatch =        2922
Binary mismatch= 0.0092
Raw binary mismatch =        2553
Binary mismatch= 0.0055
Raw binary mismatch =         288
Binary mismatch= -0.0171
Raw binary mismatch =        1198
Binary mismatch= -0.0080
Raw binary mismatch =         795
Binary mismatch= -0.0120
Raw binary mismatch =        1216
Binary mismatch= -0.0078
Raw binary mismatch =        1598
Binary mismatch= -0.0040
Raw binary mismatch =         343
Binary mismatch= -0.0166
Raw binary mismatch =         577
Binary mismatch= -0.0142
Raw binary mismatch =        2909
Binary mismatch= 0.0091
Raw binary mismatch =        2109
Binary mismatch= 0.0011
Raw binary mismatch =         850
Binary mismatch= -0.0115
Raw binary mismatch =        3199
Binary mismatch= 0.0120
Raw binary mismatch =         589
Binary mismatch= -0.0141
Raw binary mismatch =        1897
Binary mismatch= -0.0010
Raw binary mismatch =        2514
Binary mismatch= 0.0051
Raw binary mismatch =        2151
Binary mismatch= 0.0015
Raw binary mismatch =        2423
Binary mismatch= 0.0042
Raw binary mismatch =        3280
Binary mismatch= 0.0128
Raw binary mismatch =        1070
Binary mismatch= -0.0093
Raw binary mismatch =        1244
Binary mismatch= -0.0076
Raw binary mismatch =        1282
Binary mismatch= -0.0072
Raw binary mismatch =         601
Binary mismatch= -0.0140
Raw binary mismatch =        3510
Binary mismatch= 0.0151
Raw binary mismatch =         356
Binary mismatch= -0.0164
Raw binary mismatch =        3728
Binary mismatch= 0.0173
Raw binary mismatch =         315
Binary mismatch= -0.0169
Raw binary mismatch =        1899
Binary mismatch= -0.0010
Raw binary mismatch =        3254
Binary mismatch= 0.0125
Raw binary mismatch =         853
Binary mismatch= -0.0115
Raw binary mismatch =        3046
Binary mismatch= 0.0105
Raw binary mismatch =        3337
Binary mismatch= 0.0134
Raw binary mismatch =        2129
Binary mismatch= 0.0013
Raw binary mismatch =         107
Binary mismatch= -0.0189
Raw binary mismatch =        1546
Binary mismatch= -0.0045
Raw binary mismatch =         104
Binary mismatch= -0.0190
Raw binary mismatch =        1041
Binary mismatch= -0.0096
Raw binary mismatch =         171
Binary mismatch= -0.0183
Raw binary mismatch =        3791
Binary mismatch= 0.0179
Raw binary mismatch =        1534
Binary mismatch= -0.0047
Raw binary mismatch =        1551
Binary mismatch= -0.0045
Raw binary mismatch =        2886
Binary mismatch= 0.0089
Raw binary mismatch =        1948
Binary mismatch= -0.0005
Raw binary mismatch =        1276
Binary mismatch= -0.0072
Raw binary mismatch =        3262
Binary mismatch= 0.0126
Raw binary mismatch =        3884
Binary mismatch= 0.0188
Raw binary mismatch =         371
Binary mismatch= -0.0163
Raw binary mismatch =         207
Binary mismatch= -0.0179
Raw binary mismatch =         526
Binary mismatch= -0.0147
Raw binary mismatch =        3879
Binary mismatch= 0.0188
Raw binary mismatch =        2961
Binary mismatch= 0.0096
Raw binary mismatch =        3230
Binary mismatch= 0.0123
Raw binary mismatch =        2571
Binary mismatch= 0.0057
Raw binary mismatch =        1694
Binary mismatch= -0.0031
Raw binary mismatch =        1297
Binary mismatch= -0.0070
Raw binary mismatch =        2896
Binary mismatch= 0.0090
Raw binary mismatch =        2429
Binary mismatch= 0.0043
Raw binary mismatch =        2965
Binary mismatch= 0.0097
Raw binary mismatch =         392
Binary mismatch= -0.0161
Raw binary mismatch =        1957
Binary mismatch= -0.0004
Raw binary mismatch =          71
Binary mismatch= -0.0193
Raw binary mismatch =        2954
Binary mismatch= 0.0095
Raw binary mismatch =        2760
Binary mismatch= 0.0076
Raw binary mismatch =         986
Binary mismatch= -0.0101
Raw binary mismatch =        3850
Binary mismatch= 0.0185
Raw binary mismatch =        3703
Binary mismatch= 0.0170
Raw binary mismatch =         240
Binary mismatch= -0.0176
Raw binary mismatch =        1507
Binary mismatch= -0.0049
Raw binary mismatch =         756
Binary mismatch= -0.0124
Raw binary mismatch =         956
Binary mismatch= -0.0104
Raw binary mismatch =        3392
Binary mismatch= 0.0139
Raw binary mismatch =        2054
Binary mismatch= 0.0005
Raw binary mismatch =         970
Binary mismatch= -0.0103
Raw binary mismatch =        2950
Binary mismatch= 0.0095
Raw binary mismatch =        2749
Binary mismatch= 0.0075
Raw binary mismatch =        1300
Binary mismatch= -0.0070
Raw binary mismatch =        3646
Binary mismatch= 0.0165
Raw binary mismatch =        2463
Binary mismatch= 0.0046
Raw binary mismatch =         954
Binary mismatch= -0.0105
Raw binary mismatch =        1215
Binary mismatch= -0.0078
Raw binary mismatch =         470
Binary mismatch= -0.0153
Raw binary mismatch =        3167
Binary mismatch= 0.0117
Raw binary mismatch =        3190
Binary mismatch= 0.0119
Raw binary mismatch =         198
Binary mismatch= -0.0180
Raw binary mismatch =        1833
Binary mismatch= -0.0017
Raw binary mismatch =        1864
Binary mismatch= -0.0014
Raw binary mismatch =         154
Binary mismatch= -0.0185
Raw binary mismatch =        1104
Binary mismatch= -0.0090
Raw binary mismatch =         374
Binary mismatch= -0.0163
Raw binary mismatch =        3275
Binary mismatch= 0.0127
Raw binary mismatch =        2877
Binary mismatch= 0.0088
Raw binary mismatch =        1588
Binary mismatch= -0.0041
Raw binary mismatch =        1322
Binary mismatch= -0.0068
Raw binary mismatch =         130
Binary mismatch= -0.0187
Raw binary mismatch =        2146
Binary mismatch= 0.0015
Raw binary mismatch =        2803
Binary mismatch= 0.0080
Raw binary mismatch =         125
Binary mismatch= -0.0187
Raw binary mismatch =        1718
Binary mismatch= -0.0028
Raw binary mismatch =        3158
Binary mismatch= 0.0116
Raw binary mismatch =        2234
Binary mismatch= 0.0023
Raw binary mismatch =        3987
Binary mismatch= 0.0199
Raw binary mismatch =        2424
Binary mismatch= 0.0042
Raw binary mismatch =        1141
Binary mismatch= -0.0086
Raw binary mismatch =        3842
Binary mismatch= 0.0184
Raw binary mismatch =        2238
Binary mismatch= 0.0024
Raw binary mismatch =        1034
Binary mismatch= -0.0097
Raw binary mismatch =        2916
Binary mismatch= 0.0092
Raw binary mismatch =        2322
Binary mismatch= 0.0032
Raw binary mismatch =        2456
Binary mismatch= 0.0046
Raw binary mismatch =         598
Binary mismatch= -0.0140
Raw binary mismatch =         821
Binary mismatch= -0.0118
Raw binary mismatch =        2298
Binary mismatch= 0.0030
Raw binary mismatch =        1579
Binary mismatch= -0.0042
Raw binary mismatch =        1811
Binary mismatch= -0.0019
Raw binary mismatch =        1126
Binary mismatch= -0.0087
Raw binary mismatch =        3015
Binary mismatch= 0.0101
Raw binary mismatch =        1597
Binary mismatch= -0.0040
Raw binary mismatch =         974
Binary mismatch= -0.0103
Raw binary mismatch =          48
Binary mismatch= -0.0195
Raw binary mismatch =        2798
Binary mismatch= 0.0080
Raw binary mismatch =        1387
Binary mismatch= -0.0061
Raw binary mismatch =        1123
Binary mismatch= -0.0088
Raw binary mismatch =         435
Binary mismatch= -0.0157
Raw binary mismatch =        2316
Binary mismatch= 0.0032
Raw binary mismatch =         357
Binary mismatch= -0.0164
Raw binary mismatch =        3170
Binary mismatch= 0.0117
Raw binary mismatch =         461
Binary mismatch= -0.0154
Raw binary mismatch =        2869
Binary mismatch= 0.0087
Raw binary mismatch =        3271
Binary mismatch= 0.0127
Raw binary mismatch =        3114
Binary mismatch= 0.0111
Raw binary mismatch =        2617
Binary mismatch= 0.0062
Raw binary mismatch =         885
Binary mismatch= -0.0112
Raw binary mismatch =          12
Binary mismatch= -0.0199
Raw binary mismatch =        2071
Binary mismatch= 0.0007
Raw binary mismatch =         557
Binary mismatch= -0.0144
Raw binary mismatch =        3607
Binary mismatch= 0.0161
Raw binary mismatch =        3943
Binary mismatch= 0.0194
Raw binary mismatch =        2242
Binary mismatch= 0.0024
Raw binary mismatch =        2717
Binary mismatch= 0.0072
Raw binary mismatch =        1922
Binary mismatch= -0.0008
Raw binary mismatch =        1802
Binary mismatch= -0.0020
Raw binary mismatch =        2302
Binary mismatch= 0.0030
Raw binary mismatch =        2744
Binary mismatch= 0.0074
Raw binary mismatch =        3221
Binary mismatch= 0.0122
Raw binary mismatch =        1697
Binary mismatch= -0.0030
Raw binary mismatch =         667
Binary mismatch= -0.0133
Raw binary mismatch =        3944
Binary mismatch= 0.0194
Raw binary mismatch =          17
Binary mismatch= -0.0198
Raw binary mismatch =        2710
Binary mismatch= 0.0071
Raw binary mismatch =        1349
Binary mismatch= -0.0065
Raw binary mismatch =        2357
Binary mismatch= 0.0036
Raw binary mismatch =         685
Binary mismatch= -0.0132
Raw binary mismatch =        1165
Binary mismatch= -0.0083
Raw binary mismatch =         644
Binary mismatch= -0.0136
Raw binary mismatch =        1120
Binary mismatch= -0.0088
Raw binary mismatch =        1569
Binary mismatch= -0.0043
Raw binary mismatch =        2823
Binary mismatch= 0.0082
Raw binary mismatch =         635
Binary mismatch= -0.0137
Raw binary mismatch =        3434
Binary mismatch= 0.0143
Raw binary mismatch =        3838
Binary mismatch= 0.0184
Raw binary mismatch =        1921
Binary mismatch= -0.0008
Raw binary mismatch =        1387
Binary mismatch= -0.0061
Raw binary mismatch =        3378
Binary mismatch= 0.0138
Raw binary mismatch =         780
Binary mismatch= -0.0122
Raw binary mismatch =         331
Binary mismatch= -0.0167
Raw binary mismatch =        2756
Binary mismatch= 0.0076
Raw binary mismatch =        3182
Binary mismatch= 0.0118
Raw binary mismatch =         664
Binary mismatch= -0.0134
Raw binary mismatch =         918
Binary mismatch= -0.0108
Raw binary mismatch =        1147
Binary mismatch= -0.0085
Raw binary mismatch =        2974
Binary mismatch= 0.0097
Raw binary mismatch =         471
Binary mismatch= -0.0153
Raw binary mismatch =        2461
Binary mismatch= 0.0046
Raw binary mismatch =        2440
Binary mismatch= 0.0044
Raw binary mismatch =         387
Binary mismatch= -0.0161
Raw binary mismatch =        1687
Binary mismatch= -0.0031
Raw binary mismatch =        2865
Binary mismatch= 0.0086
Raw binary mismatch =         918
Binary mismatch= -0.0108
Raw binary mismatch =         731
Binary mismatch= -0.0127
Raw binary mismatch =        1952
Binary mismatch= -0.0005
Raw binary mismatch =        1087
Binary mismatch= -0.0091
Raw binary mismatch =        1165
Binary mismatch= -0.0083
Raw binary mismatch =        3905
Binary mismatch= 0.0191
Raw binary mismatch =        2039
Binary mismatch= 0.0004
Raw binary mismatch =        3981
Binary mismatch= 0.0198
Raw binary mismatch =        3695
Binary mismatch= 0.0169
Raw binary mismatch =        1035
Binary mismatch= -0.0097
Raw binary mismatch =        3005
Binary mismatch= 0.0100
Raw binary mismatch =         352
Binary mismatch= -0.0165
Raw binary mismatch =         347
Binary mismatch= -0.0165
Raw binary mismatch =         521
Binary mismatch= -0.0148
Raw binary mismatch =        1552
Binary mismatch= -0.0045
Raw binary mismatch =        2359
Binary mismatch= 0.0036
Raw binary mismatch =        2444
Binary mismatch= 0.0044
Raw binary mismatch =        3402
Binary mismatch= 0.0140
Raw binary mismatch =          71
Binary mismatch= -0.0193
Raw binary mismatch =         975
Binary mismatch= -0.0103
Raw binary mismatch =        3833
Binary mismatch= 0.0183
Raw binary mismatch =        3416
Binary mismatch= 0.0142
Raw binary mismatch =        1144
Binary mismatch= -0.0086
Raw binary mismatch =        3039
Binary mismatch= 0.0104
Raw binary mismatch =        3348
Binary mismatch= 0.0135
Raw binary mismatch =        1817
Binary mismatch= -0.0018
Raw binary mismatch =        3347
Binary mismatch= 0.0135
Raw binary mismatch =        3803
Binary mismatch= 0.0180
Raw binary mismatch =        1165
Binary mismatch= -0.0083
Raw binary mismatch =        3983
Binary mismatch= 0.0198
Raw binary mismatch =         582
Binary mismatch= -0.0142
Raw binary mismatch =        1076
Binary mismatch= -0.0092
Raw binary mismatch =        3854
Binary mismatch= 0.0185
Raw binary mismatch =        1381
Binary mismatch= -0.0062
Raw binary mismatch =         384
Binary mismatch= -0.0162
Raw binary mismatch =        2021
Binary mismatch= 0.0002
Raw binary mismatch =        3616
Binary mismatch= 0.0162
Raw binary mismatch =        3389
Binary mismatch= 0.0139
Raw binary mismatch =        1150
Binary mismatch= -0.0085
Raw binary mismatch =        3627
Binary mismatch= 0.0163
Raw binary mismatch =         741
Binary mismatch= -0.0126
Raw binary mismatch =        2342
Binary mismatch= 0.0034
Raw binary mismatch =        2157
Binary mismatch= 0.0016
Raw binary mismatch =        1903
Binary mismatch= -0.0010
Raw binary mismatch =         610
Binary mismatch= -0.0139
Raw binary mismatch =        3256
Binary mismatch= 0.0126
Raw binary mismatch =        1678
Binary mismatch= -0.0032
Raw binary mismatch =          49
Binary mismatch= -0.0195
Raw binary mismatch =         554
Binary mismatch= -0.0145
Raw binary mismatch =        1013
Binary mismatch= -0.0099
Raw binary mismatch =         616
Binary mismatch= -0.0138
Raw binary mismatch =        3576
Binary mismatch= 0.0158
Raw binary mismatch =         255
Binary mismatch= -0.0175
Raw binary mismatch =         462
Binary mismatch= -0.0154
Raw binary mismatch =        1204
Binary mismatch= -0.0080
Raw binary mismatch =        2523
Binary mismatch= 0.0052
Raw binary mismatch =        1676
Binary mismatch= -0.0032
Raw binary mismatch =        3230
Binary mismatch= 0.0123
Raw binary mismatch =        3443
Binary mismatch= 0.0144
Raw binary mismatch =        2555
Binary mismatch= 0.0056
Raw binary mismatch =         714
Binary mismatch= -0.0129
Raw binary mismatch =         203
Binary mismatch= -0.0180
Raw binary mismatch =        1620
Binary mismatch= -0.0038
Raw binary mismatch =         325
Binary mismatch= -0.0168
Raw binary mismatch =         766
Binary mismatch= -0.0123
Raw binary mismatch =        1418
Binary mismatch= -0.0058
Raw binary mismatch =        2673
Binary mismatch= 0.0067
Raw binary mismatch =        3571
Binary mismatch= 0.0157
Raw binary mismatch =        2456
Binary mismatch= 0.0046
Raw binary mismatch =         922
Binary mismatch= -0.0108
Raw binary mismatch =        2640
Binary mismatch= 0.0064
Raw binary mismatch =        2697
Binary mismatch= 0.0070
Raw binary mismatch =        1812
Binary mismatch= -0.0019
Raw binary mismatch =        2310
Binary mismatch= 0.0031
Raw binary mismatch =         293
Binary mismatch= -0.0171
Raw binary mismatch =         890
Binary mismatch= -0.0111
Raw binary mismatch =         730
Binary mismatch= -0.0127
Raw binary mismatch =        3365
Binary mismatch= 0.0137
Raw binary mismatch =        2445
Binary mismatch= 0.0044
Raw binary mismatch =        2083
Binary mismatch= 0.0008
Raw binary mismatch =        3392
Binary mismatch= 0.0139
atb1 = 0.00, atb0 = 0.00
Tests completados.
Simulation complete via $finish(1) at time 3 US + 0
./tb/clock_distribution_tb.sv:144         $finish;
xcelium> 