xrun(64): 24.03-s004: (c) Copyright 1995-2024 Cadence Design Systems, Inc.
TOOL:	xrun(64)	24.03-s004: Started on Jan 12, 2026 at 12:33:08 CET
xrun
	-f xrun.f
		-clean
		./models/clock_distribution_jitter.sv
		./tb/clock_distribution_tb.sv
		-access +rw
		-gui
		-s
		-input /home/msegper/Documents/TFM/clock_distribution/restore.tcl
	-s
xrun: *N,CLEAN: Removing existing directory ./xcelium.d.
file: ./models/clock_distribution_jitter.sv
        int mean = 0;         // Promedio de la distribución
                 |
xmvlog: *W,VARIST (./models/clock_distribution_jitter.sv,124|17): Local static variable with initializer requires 'static' keyword.
        int std_dev = 1;     // Desviación estándar, sigma
                    |
xmvlog: *W,VARIST (./models/clock_distribution_jitter.sv,125|20): Local static variable with initializer requires 'static' keyword.
	module worklib.clock_distribution:sv
		errors: 0, warnings: 2
file: ./tb/clock_distribution_tb.sv
	module worklib.clock_distribution_tb:sv
		errors: 0, warnings: 0
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
	Top level design units:
		cds_rnm_pkg
		clock_distribution_tb
	Building instance overlay tables: ....................
        $display("jitter temporal[%0d] = %0d seed = %0d media =%0d sigma = %0d", i, random_value, seed, mean, std_dev);
                                                                                               |
xmelab: *W,REALCV (./models/clock_distribution_jitter.sv,131|95): Real argument converted to integer for (%d).
 Done
	Using implicit TMP libraries; associated with library worklib
	Generating native compiled code:
		worklib.clock_distribution:sv <0x4029ac90>
			streams: 105, words: 143454
		worklib.clock_distribution_tb:sv <0x11f75bdf>
			streams:  12, words: 13543
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                 Instances  Unique
		Modules:                 2       2
		Verilog packages:        1       1
		Registers:             128     128
		Scalar wires:           56       -
		Vectored wires:          1       -
		Always blocks:           6       6
		Initial blocks:          7       7
		Parallel blocks:         1       1
		Pseudo assignments:      9       -
		Assertions:              3       3
		Simulation timescale:  1ps
	Writing initial simulation snapshot: worklib.clock_distribution_tb:sv
xmsim: *W,NOMTDGUI: Multi-Threaded Dumping is disabled for interactive debug mode.
SVSEED default: 1
[DMSINFO] Simulating with Xcelium Mixed-Signal App...
xcelium> 
xcelium> source /eda/cadence/2024-25/RHELx86/XCELIUM_24.03.004/tools/xcelium/files/xmsimrc
xcelium> 
xcelium> # XM-Sim Command File
xcelium> # TOOL:	xmsim(64)	24.03-s004
xcelium> #
xcelium> #
xcelium> # You can restore this configuration with:
xcelium> #
xcelium> #      xrun -f xrun.f -input restore.tcl
xcelium> #
xcelium> 
xcelium> set tcl_prompt1 {puts -nonewline "xcelium> "}
puts -nonewline "xcelium> "
xcelium> set tcl_prompt2 {puts -nonewline "> "}
puts -nonewline "> "
xcelium> set vlog_format %h
%h
xcelium> set vhdl_format %v
%v
xcelium> set real_precision 6
6
xcelium> set display_unit auto
auto
xcelium> set time_unit module
module
xcelium> set heap_garbage_size -200
-200
xcelium> set heap_garbage_time 0
0
xcelium> set assert_report_level note
note
xcelium> set assert_stop_level error
error
xcelium> set autoscope yes
yes
xcelium> set assert_1164_warnings yes
yes
xcelium> set pack_assert_off {}
xcelium> set severity_pack_assert_off {note warning}
note warning
xcelium> set assert_output_stop_level failed
failed
xcelium> set tcl_debug_level 0
0
xcelium> set relax_path_name 1
1
xcelium> set vhdl_vcdmap XX01ZX01X
XX01ZX01X
xcelium> set intovf_severity_level ERROR
ERROR
xcelium> set probe_screen_format 0
0
xcelium> set rangecnst_severity_level ERROR
ERROR
xcelium> set textio_severity_level ERROR
ERROR
xcelium> set vital_timing_checks_on 1
1
xcelium> set vlog_code_show_force 0
0
xcelium> set assert_count_attempts 1
1
xcelium> set tcl_all64 false
false
xcelium> set tcl_runerror_exit false
false
xcelium> set assert_report_incompletes 0
0
xcelium> set show_force 1
1
xcelium> set force_reset_by_reinvoke 0
0
xcelium> set tcl_relaxed_literal 0
0
xcelium> set probe_exclude_patterns {}
xcelium> set probe_packed_limit 4k
4k
xcelium> set probe_unpacked_limit 16k
16k
xcelium> set assert_internal_msg no
no
xcelium> set svseed 1
1
xcelium> set assert_reporting_mode 0
0
xcelium> set vcd_compact_mode 0
0
xcelium> set vhdl_forgen_loopindex_enum_pos 0
0
xcelium> set xmreplay_dc_debug 0
0
xcelium> set tcl_runcmd_interrupt next_command
next_command
xcelium> set tcl_sigval_prefix {#}
#
xcelium> alias . run
xcelium> alias indago verisium
xcelium> alias quit exit
xcelium> database -open -shm -into waves.shm waves -default
Created default SHM database waves
xcelium> probe -create -database waves clock_distribution_tb.dut.atb0 clock_distribution_tb.dut.atb1 clock_distribution_tb.dut.atb_ena clock_distribution_tb.dut.clkin clock_distribution_tb.dut.clkinb clock_distribution_tb.dut.clkout_binary_0 clock_distribution_tb.dut.clkout_binary_0_red clock_distribution_tb.dut.clkout_binary_1 clock_distribution_tb.dut.clkout_binary_2 clock_distribution_tb.dut.clkout_binary_3 clock_distribution_tb.dut.clkout_binary_4 clock_distribution_tb.dut.clkout_binary_5 clock_distribution_tb.dut.clkout_therm_0 clock_distribution_tb.dut.clkout_therm_1 clock_distribution_tb.dut.clkout_therm_2 clock_distribution_tb.dut.clkout_therm_3 clock_distribution_tb.dut.clkout_therm_4 clock_distribution_tb.dut.clkout_therm_5 clock_distribution_tb.dut.clkout_therm_6 clock_distribution_tb.dut.clkout_therm_7 clock_distribution_tb.dut.clkout_therm_8 clock_distribution_tb.dut.clkout_therm_9 clock_distribution_tb.dut.clkout_therm_10 clock_distribution_tb.dut.clkout_therm_11 clock_distribution_tb.dut.clkout_therm_12 clock_distribution_tb.dut.clkout_therm_13 clock_distribution_tb.dut.clkout_therm_14 clock_distribution_tb.dut.clkout_therm_15 clock_distribution_tb.dut.clkout_therm_16 clock_distribution_tb.dut.clkoutb_binary_0 clock_distribution_tb.dut.clkoutb_binary_0_red clock_distribution_tb.dut.clkoutb_binary_1 clock_distribution_tb.dut.clkoutb_binary_2 clock_distribution_tb.dut.clkoutb_binary_3 clock_distribution_tb.dut.clkoutb_binary_4 clock_distribution_tb.dut.clkoutb_binary_5 clock_distribution_tb.dut.clkoutb_therm_0 clock_distribution_tb.dut.clkoutb_therm_1 clock_distribution_tb.dut.clkoutb_therm_2 clock_distribution_tb.dut.clkoutb_therm_3 clock_distribution_tb.dut.clkoutb_therm_4 clock_distribution_tb.dut.clkoutb_therm_5 clock_distribution_tb.dut.clkoutb_therm_6 clock_distribution_tb.dut.clkoutb_therm_7 clock_distribution_tb.dut.clkoutb_therm_8 clock_distribution_tb.dut.clkoutb_therm_9 clock_distribution_tb.dut.clkoutb_therm_10 clock_distribution_tb.dut.clkoutb_therm_11 clock_distribution_tb.dut.clkoutb_therm_12 clock_distribution_tb.dut.clkoutb_therm_13 clock_distribution_tb.dut.clkoutb_therm_14 clock_distribution_tb.dut.clkoutb_therm_15 clock_distribution_tb.dut.clkoutb_therm_16 clock_distribution_tb.dut.iref_25ua clock_distribution_tb.dut.pdb clock_distribution_tb.dut.vddana_0p8 clock_distribution_tb.dut.vssana
Created probe 1
xcelium> 
xcelium> simvision -input restore.tcl.svcf
xmsim: *E,TCLERR: SimVision initialization failed.
xcelium> 
-------------------------------------
Relinquished control to SimVision...
# Restoring simulation environment...
xcelium> input -quiet .reinvoke.sim
xcelium> file delete .reinvoke.sim
xcelium> run
Iniciando tests...
Test 1: Estado apagado
clkout_therm_16 = 0, clkoutb_therm_16 = 0
Test 2: Estado encendido con atb_ena = 2'b00
jitter temporal[16] =          -1 seed = -1092437766 media =0 sigma = 1
jitter temporal[15] =          -1 seed = -1123821437 media =0 sigma = 1
jitter temporal[14] =           0 seed = 124880592 media =0 sigma = 1
jitter temporal[13] =           1 seed = -1625779986 media =0 sigma = 1
jitter temporal[12] =          -1 seed = 1689153146 media =0 sigma = 1
jitter temporal[11] =           1 seed = -1672505401 media =0 sigma = 1
jitter temporal[10] =           0 seed = -482609332 media =0 sigma = 1
jitter temporal[9] =           1 seed = 785128560 media =0 sigma = 1
jitter temporal[8] =           0 seed = -255091464 media =0 sigma = 1
jitter temporal[7] =          -1 seed = -764368703 media =0 sigma = 1
jitter temporal[6] =           0 seed = 495848208 media =0 sigma = 1
jitter temporal[5] =           1 seed = -816887984 media =0 sigma = 1
jitter temporal[4] =          -1 seed = 1616385090 media =0 sigma = 1
jitter temporal[3] =           1 seed = 1195433913 media =0 sigma = 1
jitter temporal[2] =           0 seed = 836071932 media =0 sigma = 1
jitter temporal[1] =           1 seed = -1634173050 media =0 sigma = 1
jitter temporal[0] =          -1 seed = -1452306400 media =0 sigma = 1
jitter temporal[16] =           0 seed = -63915833 media =0 sigma = 1
jitter temporal[15] =           1 seed = 982270071 media =0 sigma = 1
jitter temporal[14] =          -1 seed = 1774869579 media =0 sigma = 1
jitter temporal[13] =           1 seed = -2046393009 media =0 sigma = 1
jitter temporal[12] =           2 seed = -1995881002 media =0 sigma = 1
jitter temporal[11] =           1 seed = 2116688354 media =0 sigma = 1
jitter temporal[10] =           0 seed = 165995258 media =0 sigma = 1
jitter temporal[9] =           0 seed = 511430929 media =0 sigma = 1
jitter temporal[8] =           0 seed = 151151951 media =0 sigma = 1
jitter temporal[7] =           1 seed = 1641478387 media =0 sigma = 1
jitter temporal[6] =          -1 seed = -1084816026 media =0 sigma = 1
jitter temporal[5] =           1 seed = -1350920620 media =0 sigma = 1
jitter temporal[4] =           1 seed = -1376912799 media =0 sigma = 1
jitter temporal[3] =           0 seed = 1334153570 media =0 sigma = 1
jitter temporal[2] =           1 seed = -729270948 media =0 sigma = 1
jitter temporal[1] =           0 seed = 190785071 media =0 sigma = 1
jitter temporal[0] =           0 seed = -525883197 media =0 sigma = 1
jitter temporal[5] =           1 seed = 917366304 media =0 sigma = 1
jitter temporal[4] =          -1 seed = 1971694528 media =0 sigma = 1
jitter temporal[3] =           0 seed = -1821738769 media =0 sigma = 1
jitter temporal[2] =          -2 seed = -1898636184 media =0 sigma = 1
jitter temporal[1] =           2 seed = -1758729575 media =0 sigma = 1
jitter temporal[0] =          -1 seed = 1512720333 media =0 sigma = 1
jitter temporal[5] =          -1 seed = 1008385205 media =0 sigma = 1
jitter temporal[4] =          -1 seed = -1165419884 media =0 sigma = 1
jitter temporal[3] =           0 seed = 314583540 media =0 sigma = 1
jitter temporal[2] =           1 seed = -775153056 media =0 sigma = 1
jitter temporal[1] =           1 seed = 1403106167 media =0 sigma = 1
jitter temporal[0] =           1 seed = 1217086498 media =0 sigma = 1
jitter temporal[16] =           0 seed = 442562164 media =0 sigma = 1
jitter temporal[15] =           1 seed = 963981345 media =0 sigma = 1
jitter temporal[14] =           1 seed = -2070820217 media =0 sigma = 1
jitter temporal[13] =           0 seed = -295421971 media =0 sigma = 1
jitter temporal[12] =           0 seed = 515572413 media =0 sigma = 1
jitter temporal[11] =           0 seed = 81733313 media =0 sigma = 1
jitter temporal[10] =           0 seed = 262665483 media =0 sigma = 1
jitter temporal[9] =          -1 seed = -2027517892 media =0 sigma = 1
jitter temporal[8] =          -1 seed = 1930250651 media =0 sigma = 1
jitter temporal[7] =           1 seed = -1381058536 media =0 sigma = 1
jitter temporal[6] =           1 seed = 959682269 media =0 sigma = 1
jitter temporal[5] =           0 seed = -647644750 media =0 sigma = 1
jitter temporal[4] =           0 seed = 836664955 media =0 sigma = 1
jitter temporal[3] =          -1 seed = 1390821508 media =0 sigma = 1
jitter temporal[2] =           0 seed = 200058374 media =0 sigma = 1
jitter temporal[1] =          -1 seed = 1947450028 media =0 sigma = 1
jitter temporal[0] =           1 seed = 1502782341 media =0 sigma = 1
jitter temporal[16] =           1 seed = 1582373408 media =0 sigma = 1
jitter temporal[15] =           2 seed = 1866879994 media =0 sigma = 1
jitter temporal[14] =           0 seed = 1838609669 media =0 sigma = 1
jitter temporal[13] =          -1 seed = -1210856028 media =0 sigma = 1
jitter temporal[12] =           1 seed = 1776535679 media =0 sigma = 1
jitter temporal[11] =          -2 seed = -1876214361 media =0 sigma = 1
jitter temporal[10] =           0 seed = 568804785 media =0 sigma = 1
jitter temporal[9] =           0 seed = 954594221 media =0 sigma = 1
jitter temporal[8] =          -1 seed = -2109607667 media =0 sigma = 1
jitter temporal[7] =          -1 seed = -1852065917 media =0 sigma = 1
jitter temporal[6] =           0 seed = -263734487 media =0 sigma = 1
jitter temporal[5] =           0 seed = -1223058275 media =0 sigma = 1
jitter temporal[4] =           0 seed = -1558019079 media =0 sigma = 1
jitter temporal[3] =           1 seed = 1600239229 media =0 sigma = 1
jitter temporal[2] =           0 seed = 856952156 media =0 sigma = 1
jitter temporal[1] =           0 seed = -334903678 media =0 sigma = 1
jitter temporal[0] =           1 seed = -1754728170 media =0 sigma = 1
jitter temporal[5] =           1 seed = -1546980626 media =0 sigma = 1
jitter temporal[4] =           1 seed = -1001818918 media =0 sigma = 1
jitter temporal[3] =           1 seed = -1255452757 media =0 sigma = 1
jitter temporal[2] =           0 seed = -943949770 media =0 sigma = 1
jitter temporal[1] =           2 seed = -1764107480 media =0 sigma = 1
jitter temporal[0] =          -2 seed = -2126062501 media =0 sigma = 1
jitter temporal[5] =           0 seed = -161122271 media =0 sigma = 1
jitter temporal[4] =           1 seed = 770628550 media =0 sigma = 1
jitter temporal[3] =           2 seed = 1993890445 media =0 sigma = 1
jitter temporal[2] =          -1 seed = 1842261256 media =0 sigma = 1
jitter temporal[1] =          -1 seed = -1464557805 media =0 sigma = 1
jitter temporal[0] =          -2 seed = 1851413505 media =0 sigma = 1
jitter temporal[16] =           0 seed = -162767344 media =0 sigma = 1
jitter temporal[15] =           1 seed = -1632993908 media =0 sigma = 1
jitter temporal[14] =           0 seed = 510511656 media =0 sigma = 1
jitter temporal[13] =           0 seed = -340101000 media =0 sigma = 1
jitter temporal[12] =           0 seed = -633031320 media =0 sigma = 1
jitter temporal[11] =           0 seed = 895054728 media =0 sigma = 1
jitter temporal[10] =           0 seed = 497787939 media =0 sigma = 1
jitter temporal[9] =          -1 seed = -1677731585 media =0 sigma = 1
jitter temporal[8] =           0 seed = -140141839 media =0 sigma = 1
jitter temporal[7] =           1 seed = -1608664172 media =0 sigma = 1
jitter temporal[6] =           0 seed = -860548079 media =0 sigma = 1
jitter temporal[5] =           1 seed = -1517967461 media =0 sigma = 1
jitter temporal[4] =          -1 seed = -1005514243 media =0 sigma = 1
jitter temporal[3] =           0 seed = 1674674801 media =0 sigma = 1
jitter temporal[2] =          -1 seed = 1071293888 media =0 sigma = 1
jitter temporal[1] =           0 seed = 354340023 media =0 sigma = 1
jitter temporal[0] =           1 seed = -1387867536 media =0 sigma = 1
jitter temporal[16] =           1 seed = -794198342 media =0 sigma = 1
jitter temporal[15] =           1 seed = 2051135268 media =0 sigma = 1
jitter temporal[14] =          -1 seed = 1806973872 media =0 sigma = 1
jitter temporal[13] =           1 seed = -2089493562 media =0 sigma = 1
jitter temporal[12] =           0 seed = 1240189768 media =0 sigma = 1
jitter temporal[11] =           0 seed = -343749717 media =0 sigma = 1
jitter temporal[10] =          -1 seed = -1234173575 media =0 sigma = 1
jitter temporal[9] =          -2 seed = -2062446887 media =0 sigma = 1
jitter temporal[8] =           1 seed = 1544179311 media =0 sigma = 1
jitter temporal[7] =           1 seed = 1605599148 media =0 sigma = 1
jitter temporal[6] =           1 seed = -1841949195 media =0 sigma = 1
jitter temporal[5] =          -1 seed = 1336954980 media =0 sigma = 1
jitter temporal[4] =           1 seed = 1747633625 media =0 sigma = 1
jitter temporal[3] =           1 seed = -1090990190 media =0 sigma = 1
jitter temporal[2] =           0 seed = -2070876480 media =0 sigma = 1
jitter temporal[1] =          -2 seed = 1913537242 media =0 sigma = 1
jitter temporal[0] =           0 seed = -938577829 media =0 sigma = 1
jitter temporal[5] =           0 seed = 1085069551 media =0 sigma = 1
jitter temporal[4] =          -1 seed = 2089536532 media =0 sigma = 1
jitter temporal[3] =           1 seed = 1237839731 media =0 sigma = 1
jitter temporal[2] =           1 seed = -1173566448 media =0 sigma = 1
jitter temporal[1] =           0 seed = 110225553 media =0 sigma = 1
jitter temporal[0] =           0 seed = -968008700 media =0 sigma = 1
jitter temporal[5] =           1 seed = 1116578095 media =0 sigma = 1
jitter temporal[4] =          -1 seed = -813712008 media =0 sigma = 1
jitter temporal[3] =           1 seed = 1538430283 media =0 sigma = 1
jitter temporal[2] =           0 seed = -879676856 media =0 sigma = 1
jitter temporal[1] =          -1 seed = 1543404017 media =0 sigma = 1
jitter temporal[0] =          -1 seed = 1895535963 media =0 sigma = 1
jitter temporal[16] =           1 seed = -1285174787 media =0 sigma = 1
jitter temporal[15] =          -1 seed = -1163848140 media =0 sigma = 1
jitter temporal[14] =           1 seed = 1823686230 media =0 sigma = 1
jitter temporal[13] =           2 seed = 1679297959 media =0 sigma = 1
jitter temporal[12] =           0 seed = -1095754578 media =0 sigma = 1
jitter temporal[11] =          -1 seed = -1778735675 media =0 sigma = 1
jitter temporal[10] =          -2 seed = 2143872883 media =0 sigma = 1
jitter temporal[9] =           0 seed = 386607184 media =0 sigma = 1
jitter temporal[8] =          -1 seed = -1209526552 media =0 sigma = 1
jitter temporal[7] =           1 seed = -1978172993 media =0 sigma = 1
jitter temporal[6] =           1 seed = -1706102202 media =0 sigma = 1
jitter temporal[5] =           0 seed = -883052221 media =0 sigma = 1
jitter temporal[4] =           0 seed = -764805012 media =0 sigma = 1
jitter temporal[3] =           0 seed = 1941372651 media =0 sigma = 1
jitter temporal[2] =           2 seed = -2003651854 media =0 sigma = 1
jitter temporal[1] =          -1 seed = 1115141226 media =0 sigma = 1
jitter temporal[0] =          -1 seed = 1321899296 media =0 sigma = 1
jitter temporal[16] =          -1 seed = 1277755865 media =0 sigma = 1
jitter temporal[15] =           0 seed = 426006158 media =0 sigma = 1
jitter temporal[14] =           0 seed = -217170462 media =0 sigma = 1
jitter temporal[13] =           1 seed = 2143877705 media =0 sigma = 1
jitter temporal[12] =           1 seed = 1467365935 media =0 sigma = 1
jitter temporal[11] =          -1 seed = -913642533 media =0 sigma = 1
jitter temporal[10] =           0 seed = -356776432 media =0 sigma = 1
jitter temporal[9] =          -1 seed = -892014942 media =0 sigma = 1
jitter temporal[8] =          -1 seed = 1810447049 media =0 sigma = 1
jitter temporal[7] =           1 seed = 1172368719 media =0 sigma = 1
jitter temporal[6] =           0 seed = 716341272 media =0 sigma = 1
jitter temporal[5] =          -1 seed = -1354549785 media =0 sigma = 1
jitter temporal[4] =          -1 seed = 1471585356 media =0 sigma = 1
jitter temporal[3] =          -1 seed = 1074794837 media =0 sigma = 1
jitter temporal[2] =           0 seed = -660017430 media =0 sigma = 1
jitter temporal[1] =           0 seed = -499886501 media =0 sigma = 1
jitter temporal[0] =          -2 seed = 1795279981 media =0 sigma = 1
jitter temporal[5] =           1 seed = -1382700772 media =0 sigma = 1
jitter temporal[4] =          -1 seed = -1677725625 media =0 sigma = 1
jitter temporal[3] =          -1 seed = -2098624497 media =0 sigma = 1
jitter temporal[2] =           0 seed = 663814321 media =0 sigma = 1
jitter temporal[1] =           1 seed = -1784173532 media =0 sigma = 1
jitter temporal[0] =          -3 seed = -2034933585 media =0 sigma = 1
jitter temporal[5] =          -1 seed = 1570707100 media =0 sigma = 1
jitter temporal[4] =          -1 seed = -1008409945 media =0 sigma = 1
jitter temporal[3] =          -1 seed = 1412641928 media =0 sigma = 1
jitter temporal[2] =           1 seed = 1923767907 media =0 sigma = 1
jitter temporal[1] =           0 seed = 139763847 media =0 sigma = 1
jitter temporal[0] =           1 seed = 1133891880 media =0 sigma = 1
jitter temporal[16] =           0 seed = -408108558 media =0 sigma = 1
jitter temporal[15] =          -1 seed = -1035644179 media =0 sigma = 1
jitter temporal[14] =           0 seed = 1186804246 media =0 sigma = 1
jitter temporal[13] =           1 seed = -1377241781 media =0 sigma = 1
jitter temporal[12] =          -1 seed = 1460581115 media =0 sigma = 1
jitter temporal[11] =           0 seed = 1227874998 media =0 sigma = 1
jitter temporal[10] =           0 seed = 105792521 media =0 sigma = 1
jitter temporal[9] =           1 seed = -1517086277 media =0 sigma = 1
jitter temporal[8] =           0 seed = 1957521276 media =0 sigma = 1
jitter temporal[7] =           1 seed = 1715819142 media =0 sigma = 1
jitter temporal[6] =           1 seed = 1984992240 media =0 sigma = 1
jitter temporal[5] =           1 seed = 1272421980 media =0 sigma = 1
jitter temporal[4] =           1 seed = -1231355667 media =0 sigma = 1
jitter temporal[3] =           2 seed = -2012947249 media =0 sigma = 1
jitter temporal[2] =           0 seed = 173855218 media =0 sigma = 1
jitter temporal[1] =          -1 seed = 1261673554 media =0 sigma = 1
jitter temporal[0] =           0 seed = 941026921 media =0 sigma = 1
jitter temporal[16] =          -2 seed = 1999154394 media =0 sigma = 1
jitter temporal[15] =           0 seed = -584297085 media =0 sigma = 1
jitter temporal[14] =           0 seed = 350977138 media =0 sigma = 1
jitter temporal[13] =           2 seed = 2112245649 media =0 sigma = 1
jitter temporal[12] =          -1 seed = -894011244 media =0 sigma = 1
jitter temporal[11] =          -1 seed = 1282680260 media =0 sigma = 1
jitter temporal[10] =           0 seed = -337769185 media =0 sigma = 1
jitter temporal[9] =           0 seed = -402298142 media =0 sigma = 1
jitter temporal[8] =           0 seed = 83749189 media =0 sigma = 1
jitter temporal[7] =           1 seed = 1247582727 media =0 sigma = 1
jitter temporal[6] =           0 seed = -156488037 media =0 sigma = 1
jitter temporal[5] =           0 seed = 627685827 media =0 sigma = 1
jitter temporal[4] =           0 seed = -283476883 media =0 sigma = 1
jitter temporal[3] =          -1 seed = 1342222556 media =0 sigma = 1
jitter temporal[2] =           0 seed = 320192489 media =0 sigma = 1
jitter temporal[1] =          -1 seed = -1185363527 media =0 sigma = 1
jitter temporal[0] =          -2 seed = 2074675009 media =0 sigma = 1
jitter temporal[5] =           0 seed = -263937384 media =0 sigma = 1
jitter temporal[4] =          -1 seed = -1600672751 media =0 sigma = 1
jitter temporal[3] =          -1 seed = 1493577234 media =0 sigma = 1
jitter temporal[2] =           0 seed = -590633221 media =0 sigma = 1
jitter temporal[1] =          -1 seed = 1418349026 media =0 sigma = 1
jitter temporal[0] =           0 seed = 491814994 media =0 sigma = 1
jitter temporal[5] =          -1 seed = 1005038019 media =0 sigma = 1
jitter temporal[4] =           0 seed = 1684863710 media =0 sigma = 1
jitter temporal[3] =           0 seed = -423541227 media =0 sigma = 1
jitter temporal[2] =           0 seed = 550109818 media =0 sigma = 1
jitter temporal[1] =          -1 seed = 763060537 media =0 sigma = 1
jitter temporal[0] =          -1 seed = -2039255679 media =0 sigma = 1
atb1 = `wrealZState, atb0 = `wrealZState
Test 3: Estado encendido con atb_ena = 2'b01
jitter temporal[16] =          -2 seed = 1966621659 media =0 sigma = 1
jitter temporal[15] =           1 seed = -1560196333 media =0 sigma = 1
jitter temporal[14] =           1 seed = -2046667802 media =0 sigma = 1
jitter temporal[13] =          -1 seed = -889289468 media =0 sigma = 1
jitter temporal[12] =           0 seed = -186845034 media =0 sigma = 1
jitter temporal[11] =           0 seed = -1135405029 media =0 sigma = 1
jitter temporal[10] =           0 seed = 901167794 media =0 sigma = 1
jitter temporal[9] =           0 seed = -308541780 media =0 sigma = 1
jitter temporal[8] =           1 seed = -839850221 media =0 sigma = 1
jitter temporal[7] =           1 seed = 1778782309 media =0 sigma = 1
jitter temporal[6] =           1 seed = 1576008856 media =0 sigma = 1
jitter temporal[5] =          -1 seed = 1403617968 media =0 sigma = 1
jitter temporal[4] =          -1 seed = 1921725571 media =0 sigma = 1
jitter temporal[3] =          -1 seed = 1620699639 media =0 sigma = 1
jitter temporal[2] =          -1 seed = -1336645830 media =0 sigma = 1
jitter temporal[1] =           0 seed = -1162209040 media =0 sigma = 1
jitter temporal[0] =           1 seed = 772585899 media =0 sigma = 1
jitter temporal[16] =           4 seed = 2127046631 media =0 sigma = 1
jitter temporal[15] =          -1 seed = 1239299173 media =0 sigma = 1
jitter temporal[14] =          -2 seed = -1783130638 media =0 sigma = 1
jitter temporal[13] =           0 seed = 1448998417 media =0 sigma = 1
jitter temporal[12] =           0 seed = 1918882973 media =0 sigma = 1
jitter temporal[11] =           1 seed = 1719544621 media =0 sigma = 1
jitter temporal[10] =          -1 seed = -1839443667 media =0 sigma = 1
jitter temporal[9] =          -1 seed = -1447183374 media =0 sigma = 1
jitter temporal[8] =           0 seed = -165699673 media =0 sigma = 1
jitter temporal[7] =           0 seed = 281455064 media =0 sigma = 1
jitter temporal[6] =           0 seed = -931749525 media =0 sigma = 1
jitter temporal[5] =           0 seed = -541929666 media =0 sigma = 1
jitter temporal[4] =          -1 seed = 1322749837 media =0 sigma = 1
jitter temporal[3] =           0 seed = 363638615 media =0 sigma = 1
jitter temporal[2] =          -1 seed = 1758678740 media =0 sigma = 1
jitter temporal[1] =           1 seed = -1516623912 media =0 sigma = 1
jitter temporal[0] =           1 seed = -1609565549 media =0 sigma = 1
jitter temporal[5] =          -1 seed = -1745159607 media =0 sigma = 1
jitter temporal[4] =          -1 seed = 1178937588 media =0 sigma = 1
jitter temporal[3] =          -1 seed = 1873430963 media =0 sigma = 1
jitter temporal[2] =           1 seed = -1844041827 media =0 sigma = 1
jitter temporal[1] =          -2 seed = 1664437898 media =0 sigma = 1
jitter temporal[0] =          -1 seed = 1372491999 media =0 sigma = 1
jitter temporal[5] =           1 seed = 1531680575 media =0 sigma = 1
jitter temporal[4] =          -1 seed = 1875975996 media =0 sigma = 1
jitter temporal[3] =          -1 seed = 1491822209 media =0 sigma = 1
jitter temporal[2] =           0 seed = -569687674 media =0 sigma = 1
jitter temporal[1] =          -1 seed = 1679550399 media =0 sigma = 1
jitter temporal[0] =           0 seed = -197134210 media =0 sigma = 1
jitter temporal[16] =          -1 seed = 1589858770 media =0 sigma = 1
jitter temporal[15] =           0 seed = -1188420549 media =0 sigma = 1
jitter temporal[14] =           0 seed = 211309564 media =0 sigma = 1
jitter temporal[13] =           0 seed = 1527139336 media =0 sigma = 1
jitter temporal[12] =          -1 seed = -1199379281 media =0 sigma = 1
jitter temporal[11] =           1 seed = 1236098697 media =0 sigma = 1
jitter temporal[10] =           0 seed = -1162456555 media =0 sigma = 1
jitter temporal[9] =           0 seed = -2060409082 media =0 sigma = 1
jitter temporal[8] =           0 seed = -215868960 media =0 sigma = 1
jitter temporal[7] =          -2 seed = -1984868585 media =0 sigma = 1
jitter temporal[6] =           0 seed = 1722634405 media =0 sigma = 1
jitter temporal[5] =           1 seed = -1610993765 media =0 sigma = 1
jitter temporal[4] =           1 seed = 1372630409 media =0 sigma = 1
jitter temporal[3] =           0 seed = 651774606 media =0 sigma = 1
jitter temporal[2] =           0 seed = -651455738 media =0 sigma = 1
jitter temporal[1] =           0 seed = -366152602 media =0 sigma = 1
jitter temporal[0] =           2 seed = 1799522532 media =0 sigma = 1
jitter temporal[16] =           0 seed = -598376570 media =0 sigma = 1
jitter temporal[15] =           0 seed = 299991364 media =0 sigma = 1
jitter temporal[14] =           0 seed = -1081941082 media =0 sigma = 1
jitter temporal[13] =           2 seed = 1913983376 media =0 sigma = 1
jitter temporal[12] =           0 seed = 596491980 media =0 sigma = 1
jitter temporal[11] =           2 seed = 2033021316 media =0 sigma = 1
jitter temporal[10] =           0 seed = 313324667 media =0 sigma = 1
jitter temporal[9] =           1 seed = -1922233060 media =0 sigma = 1
jitter temporal[8] =           0 seed = 375139357 media =0 sigma = 1
jitter temporal[7] =           2 seed = 1945314211 media =0 sigma = 1
jitter temporal[6] =           0 seed = 617005630 media =0 sigma = 1
jitter temporal[5] =           0 seed = 1717125758 media =0 sigma = 1
jitter temporal[4] =           0 seed = 689664641 media =0 sigma = 1
jitter temporal[3] =           2 seed = 1792479298 media =0 sigma = 1
jitter temporal[2] =           0 seed = -407621199 media =0 sigma = 1
jitter temporal[1] =           0 seed = 529193241 media =0 sigma = 1
jitter temporal[0] =           0 seed = -530267332 media =0 sigma = 1
jitter temporal[5] =          -1 seed = 1471797631 media =0 sigma = 1
jitter temporal[4] =           1 seed = 733736491 media =0 sigma = 1
jitter temporal[3] =           0 seed = 1094956753 media =0 sigma = 1
jitter temporal[2] =           0 seed = -690721624 media =0 sigma = 1
jitter temporal[1] =           1 seed = 1250398284 media =0 sigma = 1
jitter temporal[0] =          -1 seed = 1346654753 media =0 sigma = 1
jitter temporal[5] =           0 seed = -151125924 media =0 sigma = 1
jitter temporal[4] =           0 seed = -132316015 media =0 sigma = 1
jitter temporal[3] =           0 seed = 644082416 media =0 sigma = 1
jitter temporal[2] =           2 seed = 2065226424 media =0 sigma = 1
jitter temporal[1] =           0 seed = -177751590 media =0 sigma = 1
jitter temporal[0] =           2 seed = 2126008817 media =0 sigma = 1
jitter temporal[16] =           0 seed = 1296159521 media =0 sigma = 1
jitter temporal[15] =          -3 seed = 2079177070 media =0 sigma = 1
jitter temporal[14] =           1 seed = 1217644337 media =0 sigma = 1
jitter temporal[13] =           1 seed = -1587471946 media =0 sigma = 1
jitter temporal[12] =          -2 seed = -1953222617 media =0 sigma = 1
jitter temporal[11] =           1 seed = -1854261681 media =0 sigma = 1
jitter temporal[10] =           0 seed = -695336730 media =0 sigma = 1
jitter temporal[9] =          -1 seed = -1525980495 media =0 sigma = 1
jitter temporal[8] =           0 seed = -1323298231 media =0 sigma = 1
jitter temporal[7] =           0 seed = -619749847 media =0 sigma = 1
jitter temporal[6] =          -1 seed = -1343620270 media =0 sigma = 1
jitter temporal[5] =           0 seed = -581787861 media =0 sigma = 1
jitter temporal[4] =          -1 seed = -1311107086 media =0 sigma = 1
jitter temporal[3] =           1 seed = 1844044415 media =0 sigma = 1
jitter temporal[2] =           3 seed = -2089038623 media =0 sigma = 1
jitter temporal[1] =           1 seed = -880962156 media =0 sigma = 1
jitter temporal[0] =           2 seed = -1862703709 media =0 sigma = 1
jitter temporal[16] =          -1 seed = 1653885238 media =0 sigma = 1
jitter temporal[15] =          -2 seed = 1795364467 media =0 sigma = 1
jitter temporal[14] =          -1 seed = 1347327944 media =0 sigma = 1
jitter temporal[13] =           0 seed = -764076101 media =0 sigma = 1
jitter temporal[12] =           0 seed = 441913129 media =0 sigma = 1
jitter temporal[11] =           1 seed = 748244214 media =0 sigma = 1
jitter temporal[10] =          -1 seed = 871233653 media =0 sigma = 1
jitter temporal[9] =           0 seed = 1326606845 media =0 sigma = 1
jitter temporal[8] =           0 seed = -1770908215 media =0 sigma = 1
jitter temporal[7] =           1 seed = -963326139 media =0 sigma = 1
jitter temporal[6] =          -1 seed = -1608461844 media =0 sigma = 1
jitter temporal[5] =           0 seed = -374581635 media =0 sigma = 1
jitter temporal[4] =          -1 seed = 2114693207 media =0 sigma = 1
jitter temporal[3] =           0 seed = 67543868 media =0 sigma = 1
jitter temporal[2] =           2 seed = -1627656246 media =0 sigma = 1
jitter temporal[1] =           0 seed = 1742158248 media =0 sigma = 1
jitter temporal[0] =           2 seed = 2096133232 media =0 sigma = 1
jitter temporal[5] =          -2 seed = -1711484094 media =0 sigma = 1
jitter temporal[4] =           0 seed = 161977091 media =0 sigma = 1
jitter temporal[3] =           0 seed = -665675028 media =0 sigma = 1
jitter temporal[2] =           0 seed = 363704240 media =0 sigma = 1
jitter temporal[1] =           0 seed = -246393700 media =0 sigma = 1
jitter temporal[0] =          -2 seed = -1996802846 media =0 sigma = 1
jitter temporal[5] =           1 seed = 2065777373 media =0 sigma = 1
jitter temporal[4] =           0 seed = 386367045 media =0 sigma = 1
jitter temporal[3] =          -1 seed = -828594816 media =0 sigma = 1
jitter temporal[2] =           0 seed = -263085165 media =0 sigma = 1
jitter temporal[1] =           0 seed = -721291825 media =0 sigma = 1
jitter temporal[0] =           1 seed = -2063024022 media =0 sigma = 1
jitter temporal[16] =           0 seed = 571086363 media =0 sigma = 1
jitter temporal[15] =           0 seed = -819478945 media =0 sigma = 1
jitter temporal[14] =          -2 seed = -1802252419 media =0 sigma = 1
jitter temporal[13] =           0 seed = -716186396 media =0 sigma = 1
jitter temporal[12] =           0 seed = -280774156 media =0 sigma = 1
jitter temporal[11] =           1 seed = 933274369 media =0 sigma = 1
jitter temporal[10] =          -1 seed = -964250832 media =0 sigma = 1
jitter temporal[9] =           1 seed = -1217440171 media =0 sigma = 1
jitter temporal[8] =           0 seed = -1086625620 media =0 sigma = 1
jitter temporal[7] =           0 seed = -728860530 media =0 sigma = 1
jitter temporal[6] =           1 seed = 1949618809 media =0 sigma = 1
jitter temporal[5] =           2 seed = -1930232575 media =0 sigma = 1
jitter temporal[4] =           1 seed = -1607990759 media =0 sigma = 1
jitter temporal[3] =           1 seed = 1289639257 media =0 sigma = 1
jitter temporal[2] =           0 seed = 1057130001 media =0 sigma = 1
jitter temporal[1] =           1 seed = 773599815 media =0 sigma = 1
jitter temporal[0] =          -1 seed = 1160639496 media =0 sigma = 1
jitter temporal[16] =           0 seed = -805421643 media =0 sigma = 1
jitter temporal[15] =           2 seed = -1928000288 media =0 sigma = 1
jitter temporal[14] =           0 seed = 1254668827 media =0 sigma = 1
jitter temporal[13] =          -1 seed = 1517173541 media =0 sigma = 1
jitter temporal[12] =           0 seed = 780247089 media =0 sigma = 1
jitter temporal[11] =           0 seed = 510770231 media =0 sigma = 1
jitter temporal[10] =           0 seed = 845988606 media =0 sigma = 1
jitter temporal[9] =           2 seed = 2103703226 media =0 sigma = 1
jitter temporal[8] =           0 seed = -1374134467 media =0 sigma = 1
jitter temporal[7] =           0 seed = 458835972 media =0 sigma = 1
jitter temporal[6] =           0 seed = -114340871 media =0 sigma = 1
jitter temporal[5] =          -1 seed = -1644898058 media =0 sigma = 1
jitter temporal[4] =          -2 seed = -1994371503 media =0 sigma = 1
jitter temporal[3] =           1 seed = -849482382 media =0 sigma = 1
jitter temporal[2] =          -1 seed = -1544080388 media =0 sigma = 1
jitter temporal[1] =           3 seed = 2114515586 media =0 sigma = 1
jitter temporal[0] =           0 seed = 1957327188 media =0 sigma = 1
jitter temporal[5] =          -2 seed = -1960252971 media =0 sigma = 1
jitter temporal[4] =          -1 seed = 1440681837 media =0 sigma = 1
jitter temporal[3] =           0 seed = -594841856 media =0 sigma = 1
jitter temporal[2] =           2 seed = -1941006714 media =0 sigma = 1
jitter temporal[1] =          -3 seed = -2132783120 media =0 sigma = 1
jitter temporal[0] =           0 seed = -1947088253 media =0 sigma = 1
jitter temporal[5] =           1 seed = -1474915222 media =0 sigma = 1
jitter temporal[4] =          -2 seed = -2136234956 media =0 sigma = 1
jitter temporal[3] =           1 seed = 1422517232 media =0 sigma = 1
jitter temporal[2] =           1 seed = -1651494218 media =0 sigma = 1
jitter temporal[1] =           0 seed = 1723900926 media =0 sigma = 1
jitter temporal[0] =           1 seed = 1622323366 media =0 sigma = 1
jitter temporal[16] =           0 seed = -811970836 media =0 sigma = 1
jitter temporal[15] =           1 seed = 1409816848 media =0 sigma = 1
jitter temporal[14] =          -1 seed = 1946783661 media =0 sigma = 1
jitter temporal[13] =          -1 seed = 920372822 media =0 sigma = 1
jitter temporal[12] =          -1 seed = -848972052 media =0 sigma = 1
jitter temporal[11] =           1 seed = 1829767728 media =0 sigma = 1
jitter temporal[10] =           0 seed = 487290434 media =0 sigma = 1
jitter temporal[9] =          -1 seed = -1448611059 media =0 sigma = 1
jitter temporal[8] =           0 seed = -1021027309 media =0 sigma = 1
jitter temporal[7] =          -3 seed = 2093813843 media =0 sigma = 1
jitter temporal[6] =           0 seed = -1766872721 media =0 sigma = 1
jitter temporal[5] =           0 seed = -221126667 media =0 sigma = 1
jitter temporal[4] =          -1 seed = -1037708104 media =0 sigma = 1
jitter temporal[3] =          -1 seed = -2020030623 media =0 sigma = 1
jitter temporal[2] =           0 seed = -983202663 media =0 sigma = 1
jitter temporal[1] =           1 seed = -1730410300 media =0 sigma = 1
jitter temporal[0] =           0 seed = -337987420 media =0 sigma = 1
jitter temporal[16] =          -1 seed = 1064424055 media =0 sigma = 1
jitter temporal[15] =          -1 seed = 1300399341 media =0 sigma = 1
jitter temporal[14] =           1 seed = 1650155508 media =0 sigma = 1
jitter temporal[13] =           0 seed = -319837799 media =0 sigma = 1
jitter temporal[12] =           1 seed = 755468656 media =0 sigma = 1
jitter temporal[11] =           1 seed = -1419215424 media =0 sigma = 1
jitter temporal[10] =           0 seed = -1302171381 media =0 sigma = 1
jitter temporal[9] =          -1 seed = 2147004343 media =0 sigma = 1
jitter temporal[8] =           0 seed = -101582500 media =0 sigma = 1
jitter temporal[7] =          -1 seed = 1122445859 media =0 sigma = 1
jitter temporal[6] =           0 seed = 741983987 media =0 sigma = 1
jitter temporal[5] =           2 seed = -2093754684 media =0 sigma = 1
jitter temporal[4] =           0 seed = -425099131 media =0 sigma = 1
jitter temporal[3] =           0 seed = -1741354579 media =0 sigma = 1
jitter temporal[2] =           0 seed = 551166932 media =0 sigma = 1
jitter temporal[1] =           1 seed = 1601012950 media =0 sigma = 1
jitter temporal[0] =           1 seed = 1573780549 media =0 sigma = 1
jitter temporal[5] =          -2 seed = -1940239318 media =0 sigma = 1
jitter temporal[4] =           1 seed = 1884310946 media =0 sigma = 1
jitter temporal[3] =           0 seed = 1007016977 media =0 sigma = 1
jitter temporal[2] =           1 seed = 2043777546 media =0 sigma = 1
jitter temporal[1] =           2 seed = -1759232276 media =0 sigma = 1
jitter temporal[0] =          -1 seed = 1830531583 media =0 sigma = 1
jitter temporal[5] =           1 seed = -1684366370 media =0 sigma = 1
jitter temporal[4] =           1 seed = -1616817834 media =0 sigma = 1
jitter temporal[3] =           0 seed = -593050642 media =0 sigma = 1
jitter temporal[2] =           1 seed = 1154992041 media =0 sigma = 1
jitter temporal[1] =          -1 seed = -1226354355 media =0 sigma = 1
jitter temporal[0] =           0 seed = 1042152562 media =0 sigma = 1
atb1 = 0.80, atb0 = 0.00
Test 4: Estado encendido con atb_ena = 2'b10
jitter temporal[16] =           2 seed = 2005530022 media =0 sigma = 1
jitter temporal[15] =          -1 seed = 1016801512 media =0 sigma = 1
jitter temporal[14] =           0 seed = -1077205401 media =0 sigma = 1
jitter temporal[13] =           1 seed = 1959421809 media =0 sigma = 1
jitter temporal[12] =           0 seed = -649764660 media =0 sigma = 1
jitter temporal[11] =           0 seed = 335208013 media =0 sigma = 1
jitter temporal[10] =           1 seed = -871845994 media =0 sigma = 1
jitter temporal[9] =          -1 seed = 1833701064 media =0 sigma = 1
jitter temporal[8] =           0 seed = -1277412244 media =0 sigma = 1
jitter temporal[7] =           1 seed = -2083213408 media =0 sigma = 1
jitter temporal[6] =           0 seed = -1711249097 media =0 sigma = 1
jitter temporal[5] =          -1 seed = 1656613852 media =0 sigma = 1
jitter temporal[4] =           1 seed = 1143438547 media =0 sigma = 1
jitter temporal[3] =          -1 seed = -809583106 media =0 sigma = 1
jitter temporal[2] =           2 seed = -1741748652 media =0 sigma = 1
jitter temporal[1] =           0 seed = -1555739566 media =0 sigma = 1
jitter temporal[0] =           1 seed = -868479442 media =0 sigma = 1
jitter temporal[16] =           1 seed = -1905921458 media =0 sigma = 1
jitter temporal[15] =           1 seed = -897150645 media =0 sigma = 1
jitter temporal[14] =           1 seed = 1243216184 media =0 sigma = 1
jitter temporal[13] =           0 seed = 787649430 media =0 sigma = 1
jitter temporal[12] =           1 seed = 1274552119 media =0 sigma = 1
jitter temporal[11] =           0 seed = 1830769998 media =0 sigma = 1
jitter temporal[10] =           1 seed = 1959221761 media =0 sigma = 1
jitter temporal[9] =           0 seed = 775630282 media =0 sigma = 1
jitter temporal[8] =           0 seed = -594709624 media =0 sigma = 1
jitter temporal[7] =          -1 seed = 1232087253 media =0 sigma = 1
jitter temporal[6] =           0 seed = 1714770719 media =0 sigma = 1
jitter temporal[5] =          -1 seed = -1301824974 media =0 sigma = 1
jitter temporal[4] =           0 seed = 754750278 media =0 sigma = 1
jitter temporal[3] =           1 seed = -1138843490 media =0 sigma = 1
jitter temporal[2] =           1 seed = -1913576410 media =0 sigma = 1
jitter temporal[1] =           0 seed = -788711062 media =0 sigma = 1
jitter temporal[0] =           0 seed = -394509310 media =0 sigma = 1
jitter temporal[5] =           0 seed = -632114576 media =0 sigma = 1
jitter temporal[4] =          -2 seed = -1709615126 media =0 sigma = 1
jitter temporal[3] =           0 seed = -981175270 media =0 sigma = 1
jitter temporal[2] =           0 seed = -1106831407 media =0 sigma = 1
jitter temporal[1] =           1 seed = -1339379691 media =0 sigma = 1
jitter temporal[0] =           3 seed = -2077447792 media =0 sigma = 1
jitter temporal[5] =           2 seed = -1918972220 media =0 sigma = 1
jitter temporal[4] =          -2 seed = -2043702771 media =0 sigma = 1
jitter temporal[3] =          -1 seed = 2061570260 media =0 sigma = 1
jitter temporal[2] =           1 seed = 1639142240 media =0 sigma = 1
jitter temporal[1] =           1 seed = -1529225146 media =0 sigma = 1
jitter temporal[0] =           1 seed = -1322436634 media =0 sigma = 1
jitter temporal[16] =          -1 seed = 898525314 media =0 sigma = 1
jitter temporal[15] =           0 seed = 190843197 media =0 sigma = 1
jitter temporal[14] =           1 seed = 1467871242 media =0 sigma = 1
jitter temporal[13] =           0 seed = -925246854 media =0 sigma = 1
jitter temporal[12] =          -1 seed = -1702435015 media =0 sigma = 1
jitter temporal[11] =           2 seed = 1826078362 media =0 sigma = 1
jitter temporal[10] =          -1 seed = -1197156517 media =0 sigma = 1
jitter temporal[9] =           0 seed = 398186523 media =0 sigma = 1
jitter temporal[8] =           0 seed = -1283241417 media =0 sigma = 1
jitter temporal[7] =          -1 seed = 1594114739 media =0 sigma = 1
jitter temporal[6] =           0 seed = 2028254216 media =0 sigma = 1
jitter temporal[5] =          -1 seed = -1832962323 media =0 sigma = 1
jitter temporal[4] =           1 seed = -701762833 media =0 sigma = 1
jitter temporal[3] =           0 seed = 390018063 media =0 sigma = 1
jitter temporal[2] =          -2 seed = 1819949398 media =0 sigma = 1
jitter temporal[1] =           0 seed = 1378690310 media =0 sigma = 1
jitter temporal[0] =          -1 seed = -1323304220 media =0 sigma = 1
jitter temporal[16] =          -1 seed = 1412092845 media =0 sigma = 1
jitter temporal[15] =           0 seed = 1200001384 media =0 sigma = 1
jitter temporal[14] =           0 seed = -236407324 media =0 sigma = 1
jitter temporal[13] =           1 seed = -1408404471 media =0 sigma = 1
jitter temporal[12] =           0 seed = -1140977130 media =0 sigma = 1
jitter temporal[11] =           0 seed = 1178962308 media =0 sigma = 1
jitter temporal[10] =          -1 seed = -1693725119 media =0 sigma = 1
jitter temporal[9] =           1 seed = -1291852163 media =0 sigma = 1
jitter temporal[8] =          -1 seed = -2062611695 media =0 sigma = 1
jitter temporal[7] =           0 seed = -1151383331 media =0 sigma = 1
jitter temporal[6] =           1 seed = 856050210 media =0 sigma = 1
jitter temporal[5] =          -1 seed = -1835611930 media =0 sigma = 1
jitter temporal[4] =           0 seed = 346013787 media =0 sigma = 1
jitter temporal[3] =           0 seed = 527514235 media =0 sigma = 1
jitter temporal[2] =           0 seed = 604926426 media =0 sigma = 1
jitter temporal[1] =           0 seed = -937911462 media =0 sigma = 1
jitter temporal[0] =           0 seed = 155674219 media =0 sigma = 1
jitter temporal[5] =           0 seed = -1775382459 media =0 sigma = 1
jitter temporal[4] =           0 seed = -640496164 media =0 sigma = 1
jitter temporal[3] =           0 seed = 427765739 media =0 sigma = 1
jitter temporal[2] =          -1 seed = -2047013358 media =0 sigma = 1
jitter temporal[1] =          -2 seed = 2057753283 media =0 sigma = 1
jitter temporal[0] =           2 seed = 1753092551 media =0 sigma = 1
jitter temporal[5] =           2 seed = -1866086550 media =0 sigma = 1
jitter temporal[4] =           0 seed = -1739517711 media =0 sigma = 1
jitter temporal[3] =           0 seed = 1974477129 media =0 sigma = 1
jitter temporal[2] =          -1 seed = -843726572 media =0 sigma = 1
jitter temporal[1] =           2 seed = 2070526121 media =0 sigma = 1
jitter temporal[0] =           1 seed = 1551499514 media =0 sigma = 1
jitter temporal[16] =           1 seed = -1022629757 media =0 sigma = 1
jitter temporal[15] =           1 seed = -1251349636 media =0 sigma = 1
jitter temporal[14] =           0 seed = -688821201 media =0 sigma = 1
jitter temporal[13] =           0 seed = -497328132 media =0 sigma = 1
jitter temporal[12] =          -1 seed = -1623361371 media =0 sigma = 1
jitter temporal[11] =           0 seed = 798735450 media =0 sigma = 1
jitter temporal[10] =           0 seed = 622851254 media =0 sigma = 1
jitter temporal[9] =           1 seed = -1996402459 media =0 sigma = 1
jitter temporal[8] =           1 seed = -915484219 media =0 sigma = 1
jitter temporal[7] =          -1 seed = -1134297906 media =0 sigma = 1
jitter temporal[6] =           1 seed = -1601950937 media =0 sigma = 1
jitter temporal[5] =           0 seed = 945786390 media =0 sigma = 1
jitter temporal[4] =           0 seed = 602363206 media =0 sigma = 1
jitter temporal[3] =           0 seed = -2121055698 media =0 sigma = 1
jitter temporal[2] =          -1 seed = 1527588065 media =0 sigma = 1
jitter temporal[1] =           0 seed = 1704943700 media =0 sigma = 1
jitter temporal[0] =          -1 seed = -2081325393 media =0 sigma = 1
jitter temporal[16] =          -1 seed = 1253274366 media =0 sigma = 1
jitter temporal[15] =           2 seed = 1729066581 media =0 sigma = 1
jitter temporal[14] =           0 seed = -1692833770 media =0 sigma = 1
jitter temporal[13] =           0 seed = -182733382 media =0 sigma = 1
jitter temporal[12] =          -1 seed = -1323413197 media =0 sigma = 1
jitter temporal[11] =           0 seed = -1778079255 media =0 sigma = 1
jitter temporal[10] =           2 seed = 1708634776 media =0 sigma = 1
jitter temporal[9] =          -2 seed = -1804148105 media =0 sigma = 1
jitter temporal[8] =           0 seed = 1506900247 media =0 sigma = 1
jitter temporal[7] =           0 seed = -508143059 media =0 sigma = 1
jitter temporal[6] =           1 seed = -814336897 media =0 sigma = 1
jitter temporal[5] =           0 seed = -313288828 media =0 sigma = 1
jitter temporal[4] =           0 seed = -752291029 media =0 sigma = 1
jitter temporal[3] =           0 seed = -912997173 media =0 sigma = 1
jitter temporal[2] =           0 seed = -1006216473 media =0 sigma = 1
jitter temporal[1] =           0 seed = -1748546921 media =0 sigma = 1
jitter temporal[0] =           0 seed = 624281573 media =0 sigma = 1
jitter temporal[5] =           0 seed = -424263592 media =0 sigma = 1
jitter temporal[4] =           0 seed = -220501205 media =0 sigma = 1
jitter temporal[3] =           2 seed = -1685723284 media =0 sigma = 1
jitter temporal[2] =           0 seed = -297262519 media =0 sigma = 1
jitter temporal[1] =          -1 seed = -2057206230 media =0 sigma = 1
jitter temporal[0] =           1 seed = 1569326895 media =0 sigma = 1
jitter temporal[5] =           1 seed = -1339938357 media =0 sigma = 1
jitter temporal[4] =           0 seed = 1277732832 media =0 sigma = 1
jitter temporal[3] =           1 seed = 1801752310 media =0 sigma = 1
jitter temporal[2] =           0 seed = 617163033 media =0 sigma = 1
jitter temporal[1] =           0 seed = 1375598304 media =0 sigma = 1
jitter temporal[0] =           2 seed = -1878250708 media =0 sigma = 1
jitter temporal[16] =          -1 seed = 1528253892 media =0 sigma = 1
jitter temporal[15] =           0 seed = 394453371 media =0 sigma = 1
jitter temporal[14] =           0 seed = 46320086 media =0 sigma = 1
jitter temporal[13] =           0 seed = 554763103 media =0 sigma = 1
jitter temporal[12] =           1 seed = -1512584059 media =0 sigma = 1
jitter temporal[11] =           0 seed = 378296921 media =0 sigma = 1
jitter temporal[10] =          -1 seed = -886000490 media =0 sigma = 1
jitter temporal[9] =           0 seed = -863591526 media =0 sigma = 1
jitter temporal[8] =           0 seed = 2065545229 media =0 sigma = 1
jitter temporal[7] =          -1 seed = -1776189242 media =0 sigma = 1
jitter temporal[6] =           0 seed = -1969265406 media =0 sigma = 1
jitter temporal[5] =           1 seed = 911207220 media =0 sigma = 1
jitter temporal[4] =           1 seed = -1870351659 media =0 sigma = 1
jitter temporal[3] =           2 seed = 1692239546 media =0 sigma = 1
jitter temporal[2] =          -1 seed = -1283017193 media =0 sigma = 1
jitter temporal[1] =           0 seed = -1209653295 media =0 sigma = 1
jitter temporal[0] =           0 seed = -631776720 media =0 sigma = 1
jitter temporal[16] =           1 seed = -1490673528 media =0 sigma = 1
jitter temporal[15] =          -1 seed = -1392941388 media =0 sigma = 1
jitter temporal[14] =           1 seed = -1982924294 media =0 sigma = 1
jitter temporal[13] =           1 seed = 1177675297 media =0 sigma = 1
jitter temporal[12] =          -2 seed = 1773852978 media =0 sigma = 1
jitter temporal[11] =           1 seed = 1814350819 media =0 sigma = 1
jitter temporal[10] =          -1 seed = 1295689558 media =0 sigma = 1
jitter temporal[9] =          -1 seed = 1404335504 media =0 sigma = 1
jitter temporal[8] =           1 seed = -1154464283 media =0 sigma = 1
jitter temporal[7] =           0 seed = 348803523 media =0 sigma = 1
jitter temporal[6] =           1 seed = -1934922251 media =0 sigma = 1
jitter temporal[5] =           0 seed = -46878153 media =0 sigma = 1
jitter temporal[4] =           0 seed = 521618716 media =0 sigma = 1
jitter temporal[3] =           2 seed = -1730674922 media =0 sigma = 1
jitter temporal[2] =           0 seed = 340034055 media =0 sigma = 1
jitter temporal[1] =           1 seed = 1785629441 media =0 sigma = 1
jitter temporal[0] =           1 seed = 1580932956 media =0 sigma = 1
jitter temporal[5] =           1 seed = 1620687411 media =0 sigma = 1
jitter temporal[4] =           1 seed = -1356903297 media =0 sigma = 1
jitter temporal[3] =           2 seed = 1925273153 media =0 sigma = 1
jitter temporal[2] =           0 seed = 768145740 media =0 sigma = 1
jitter temporal[1] =           0 seed = -1397773685 media =0 sigma = 1
jitter temporal[0] =          -1 seed = 941327973 media =0 sigma = 1
jitter temporal[5] =          -1 seed = -1790434930 media =0 sigma = 1
jitter temporal[4] =           0 seed = 904981062 media =0 sigma = 1
jitter temporal[3] =           0 seed = 752031333 media =0 sigma = 1
jitter temporal[2] =           1 seed = 2105777520 media =0 sigma = 1
jitter temporal[1] =           0 seed = -1134714511 media =0 sigma = 1
jitter temporal[0] =           0 seed = 194795525 media =0 sigma = 1
jitter temporal[16] =          -1 seed = 933807511 media =0 sigma = 1
jitter temporal[15] =           1 seed = 1230543905 media =0 sigma = 1
jitter temporal[14] =           1 seed = -1243837023 media =0 sigma = 1
jitter temporal[13] =           2 seed = -2091231880 media =0 sigma = 1
jitter temporal[12] =          -2 seed = 2060249142 media =0 sigma = 1
jitter temporal[11] =           0 seed = -617253765 media =0 sigma = 1
jitter temporal[10] =           0 seed = 750255301 media =0 sigma = 1
jitter temporal[9] =           0 seed = 345532080 media =0 sigma = 1
jitter temporal[8] =           1 seed = 1642735271 media =0 sigma = 1
jitter temporal[7] =           1 seed = 1327505125 media =0 sigma = 1
jitter temporal[6] =           0 seed = -324257786 media =0 sigma = 1
jitter temporal[5] =           3 seed = 2027143102 media =0 sigma = 1
jitter temporal[4] =          -1 seed = 2089868150 media =0 sigma = 1
jitter temporal[3] =          -1 seed = -1713091925 media =0 sigma = 1
jitter temporal[2] =          -1 seed = 1764988436 media =0 sigma = 1
jitter temporal[1] =          -1 seed = 1583084397 media =0 sigma = 1
jitter temporal[0] =           2 seed = -1822729087 media =0 sigma = 1
jitter temporal[16] =           1 seed = 891914958 media =0 sigma = 1
jitter temporal[15] =           2 seed = -1889862729 media =0 sigma = 1
jitter temporal[14] =          -2 seed = 1837163257 media =0 sigma = 1
jitter temporal[13] =           0 seed = 597633203 media =0 sigma = 1
jitter temporal[12] =           1 seed = -1297904852 media =0 sigma = 1
jitter temporal[11] =           0 seed = 700564826 media =0 sigma = 1
jitter temporal[10] =          -1 seed = -1318699233 media =0 sigma = 1
jitter temporal[9] =           0 seed = -832634588 media =0 sigma = 1
jitter temporal[8] =          -1 seed = -919545002 media =0 sigma = 1
jitter temporal[7] =           1 seed = 1334173543 media =0 sigma = 1
jitter temporal[6] =           2 seed = 1994993319 media =0 sigma = 1
jitter temporal[5] =          -1 seed = 1816908495 media =0 sigma = 1
jitter temporal[4] =           1 seed = 1287078448 media =0 sigma = 1
jitter temporal[3] =           1 seed = -2048507237 media =0 sigma = 1
jitter temporal[2] =          -1 seed = 1726433728 media =0 sigma = 1
jitter temporal[1] =          -1 seed = 2024551773 media =0 sigma = 1
jitter temporal[0] =           1 seed = 1140990417 media =0 sigma = 1
jitter temporal[5] =           0 seed = 561170840 media =0 sigma = 1
jitter temporal[4] =          -1 seed = -1223072213 media =0 sigma = 1
jitter temporal[3] =           0 seed = 45809996 media =0 sigma = 1
jitter temporal[2] =           1 seed = 1966365776 media =0 sigma = 1
jitter temporal[1] =           1 seed = 1705368516 media =0 sigma = 1
jitter temporal[0] =           0 seed = -694534157 media =0 sigma = 1
jitter temporal[5] =          -2 seed = -1932230439 media =0 sigma = 1
jitter temporal[4] =           0 seed = -600724076 media =0 sigma = 1
jitter temporal[3] =           0 seed = -700393148 media =0 sigma = 1
jitter temporal[2] =           0 seed = -820939295 media =0 sigma = 1
jitter temporal[1] =          -1 seed = -1098339951 media =0 sigma = 1
jitter temporal[0] =           1 seed = -944536865 media =0 sigma = 1
atb1 = 0.80, atb0 = 0.00
Test 5: Estado encendido con atb_ena = 2'b11
jitter temporal[16] =          -1 seed = -1743302656 media =0 sigma = 1
jitter temporal[15] =           1 seed = -1515500082 media =0 sigma = 1
jitter temporal[14] =           1 seed = -1817369946 media =0 sigma = 1
jitter temporal[13] =           0 seed = -659452828 media =0 sigma = 1
jitter temporal[12] =           1 seed = -1286127444 media =0 sigma = 1
jitter temporal[11] =           0 seed = 1106689888 media =0 sigma = 1
jitter temporal[10] =           0 seed = 1478784505 media =0 sigma = 1
jitter temporal[9] =           1 seed = 1058174396 media =0 sigma = 1
jitter temporal[8] =           1 seed = 1400454878 media =0 sigma = 1
jitter temporal[7] =          -1 seed = 1277869526 media =0 sigma = 1
jitter temporal[6] =           0 seed = -278682106 media =0 sigma = 1
jitter temporal[5] =          -2 seed = 2016216974 media =0 sigma = 1
jitter temporal[4] =           0 seed = 678740609 media =0 sigma = 1
jitter temporal[3] =          -1 seed = -1315855845 media =0 sigma = 1
jitter temporal[2] =           0 seed = -1079633910 media =0 sigma = 1
jitter temporal[1] =          -1 seed = 1262573028 media =0 sigma = 1
jitter temporal[0] =           0 seed = 620662575 media =0 sigma = 1
jitter temporal[16] =          -1 seed = 1784379312 media =0 sigma = 1
jitter temporal[15] =           1 seed = 1482033687 media =0 sigma = 1
jitter temporal[14] =          -1 seed = 1488138791 media =0 sigma = 1
jitter temporal[13] =           0 seed = -905712206 media =0 sigma = 1
jitter temporal[12] =           0 seed = 765633970 media =0 sigma = 1
jitter temporal[11] =          -1 seed = -792569218 media =0 sigma = 1
jitter temporal[10] =           0 seed = 1511429613 media =0 sigma = 1
jitter temporal[9] =           2 seed = -1772260602 media =0 sigma = 1
jitter temporal[8] =           0 seed = -500417607 media =0 sigma = 1
jitter temporal[7] =          -1 seed = 2108672795 media =0 sigma = 1
jitter temporal[6] =           1 seed = 1891871026 media =0 sigma = 1
jitter temporal[5] =           0 seed = 448379110 media =0 sigma = 1
jitter temporal[4] =           0 seed = -593183354 media =0 sigma = 1
jitter temporal[3] =           1 seed = 1833866608 media =0 sigma = 1
jitter temporal[2] =           0 seed = -879974687 media =0 sigma = 1
jitter temporal[1] =          -2 seed = -1975454798 media =0 sigma = 1
jitter temporal[0] =           0 seed = -366250647 media =0 sigma = 1
jitter temporal[5] =           1 seed = 942273773 media =0 sigma = 1
jitter temporal[4] =           1 seed = 1784691912 media =0 sigma = 1
jitter temporal[3] =          -1 seed = -1372759863 media =0 sigma = 1
jitter temporal[2] =          -1 seed = 1924621833 media =0 sigma = 1
jitter temporal[1] =           1 seed = -1240853838 media =0 sigma = 1
jitter temporal[0] =           1 seed = 1323379257 media =0 sigma = 1
jitter temporal[5] =          -1 seed = -2068993578 media =0 sigma = 1
jitter temporal[4] =           1 seed = 800300374 media =0 sigma = 1
jitter temporal[3] =          -1 seed = -1153892821 media =0 sigma = 1
jitter temporal[2] =          -1 seed = -1592672738 media =0 sigma = 1
jitter temporal[1] =          -1 seed = 1383273979 media =0 sigma = 1
jitter temporal[0] =           2 seed = -1904987661 media =0 sigma = 1
jitter temporal[16] =           1 seed = -1070968461 media =0 sigma = 1
jitter temporal[15] =           0 seed = -1005463092 media =0 sigma = 1
jitter temporal[14] =          -1 seed = 1082254854 media =0 sigma = 1
jitter temporal[13] =           0 seed = -1174849759 media =0 sigma = 1
jitter temporal[12] =           3 seed = -2120882071 media =0 sigma = 1
jitter temporal[11] =           0 seed = 260828324 media =0 sigma = 1
jitter temporal[10] =           1 seed = -1604817915 media =0 sigma = 1
jitter temporal[9] =          -1 seed = 1469146217 media =0 sigma = 1
jitter temporal[8] =           0 seed = 966362274 media =0 sigma = 1
jitter temporal[7] =           0 seed = -1247821092 media =0 sigma = 1
jitter temporal[6] =          -1 seed = -853851534 media =0 sigma = 1
jitter temporal[5] =           1 seed = 1698534825 media =0 sigma = 1
jitter temporal[4] =           0 seed = 1056209295 media =0 sigma = 1
jitter temporal[3] =           1 seed = -1618632275 media =0 sigma = 1
jitter temporal[2] =           1 seed = 1739811585 media =0 sigma = 1
jitter temporal[1] =           2 seed = 1657952766 media =0 sigma = 1
jitter temporal[0] =           0 seed = 188972633 media =0 sigma = 1
jitter temporal[16] =          -1 seed = -1623651836 media =0 sigma = 1
jitter temporal[15] =          -1 seed = -1693581706 media =0 sigma = 1
jitter temporal[14] =           1 seed = -1534036536 media =0 sigma = 1
jitter temporal[13] =           0 seed = 1045924065 media =0 sigma = 1
jitter temporal[12] =          -1 seed = 1879865118 media =0 sigma = 1
jitter temporal[11] =           0 seed = -847666855 media =0 sigma = 1
jitter temporal[10] =           1 seed = -1792489186 media =0 sigma = 1
jitter temporal[9] =           1 seed = -1461759284 media =0 sigma = 1
jitter temporal[8] =           0 seed = -861535766 media =0 sigma = 1
jitter temporal[7] =           0 seed = 469285171 media =0 sigma = 1
jitter temporal[6] =           0 seed = -902457313 media =0 sigma = 1
jitter temporal[5] =          -1 seed = 1104422060 media =0 sigma = 1
jitter temporal[4] =           2 seed = -1695451252 media =0 sigma = 1
jitter temporal[3] =          -2 seed = 2037391385 media =0 sigma = 1
jitter temporal[2] =          -1 seed = -1426818660 media =0 sigma = 1
jitter temporal[1] =           1 seed = -1192311424 media =0 sigma = 1
jitter temporal[0] =           1 seed = -959142051 media =0 sigma = 1
jitter temporal[5] =           0 seed = 1065010597 media =0 sigma = 1
jitter temporal[4] =          -1 seed = -943203545 media =0 sigma = 1
jitter temporal[3] =          -1 seed = 1737251521 media =0 sigma = 1
jitter temporal[2] =           1 seed = 1356495813 media =0 sigma = 1
jitter temporal[1] =           0 seed = 1154674619 media =0 sigma = 1
jitter temporal[0] =           0 seed = 805674026 media =0 sigma = 1
jitter temporal[5] =           1 seed = -1373626657 media =0 sigma = 1
jitter temporal[4] =           1 seed = -1775938583 media =0 sigma = 1
jitter temporal[3] =          -1 seed = -1391068142 media =0 sigma = 1
jitter temporal[2] =           0 seed = -1345060814 media =0 sigma = 1
jitter temporal[1] =           0 seed = -750488474 media =0 sigma = 1
jitter temporal[0] =           0 seed = 279933907 media =0 sigma = 1
jitter temporal[16] =           0 seed = 1468564638 media =0 sigma = 1
jitter temporal[15] =           2 seed = 1833430985 media =0 sigma = 1
jitter temporal[14] =           2 seed = -1890615221 media =0 sigma = 1
jitter temporal[13] =          -1 seed = -1849349252 media =0 sigma = 1
jitter temporal[12] =           2 seed = -1760596861 media =0 sigma = 1
jitter temporal[11] =          -2 seed = 2133074992 media =0 sigma = 1
jitter temporal[10] =          -1 seed = -2019108184 media =0 sigma = 1
jitter temporal[9] =          -2 seed = 1910019496 media =0 sigma = 1
jitter temporal[8] =           1 seed = -1496918467 media =0 sigma = 1
jitter temporal[7] =          -2 seed = 1859477084 media =0 sigma = 1
jitter temporal[6] =           2 seed = 2096453208 media =0 sigma = 1
jitter temporal[5] =           0 seed = 514588906 media =0 sigma = 1
jitter temporal[4] =          -1 seed = -1538493598 media =0 sigma = 1
jitter temporal[3] =          -1 seed = -1941877440 media =0 sigma = 1
jitter temporal[2] =           1 seed = -921797611 media =0 sigma = 1
jitter temporal[1] =           0 seed = -1337614690 media =0 sigma = 1
jitter temporal[0] =           1 seed = 1077767260 media =0 sigma = 1
jitter temporal[16] =          -3 seed = -2099019231 media =0 sigma = 1
jitter temporal[15] =           0 seed = 464182624 media =0 sigma = 1
jitter temporal[14] =           0 seed = 798306433 media =0 sigma = 1
jitter temporal[13] =          -1 seed = -1370191058 media =0 sigma = 1
jitter temporal[12] =           0 seed = -447936044 media =0 sigma = 1
jitter temporal[11] =          -1 seed = 2092123334 media =0 sigma = 1
jitter temporal[10] =           0 seed = -957008772 media =0 sigma = 1
jitter temporal[9] =           0 seed = -1580999984 media =0 sigma = 1
jitter temporal[8] =           0 seed = -385238005 media =0 sigma = 1
jitter temporal[7] =           1 seed = 1650401603 media =0 sigma = 1
jitter temporal[6] =           0 seed = -1738042301 media =0 sigma = 1
jitter temporal[5] =          -1 seed = 1009597803 media =0 sigma = 1
jitter temporal[4] =          -1 seed = 1537143550 media =0 sigma = 1
jitter temporal[3] =          -1 seed = -1169864561 media =0 sigma = 1
jitter temporal[2] =          -1 seed = 1068632057 media =0 sigma = 1
jitter temporal[1] =           0 seed = -316116600 media =0 sigma = 1
jitter temporal[0] =           0 seed = 343393522 media =0 sigma = 1
jitter temporal[5] =           0 seed = 622795979 media =0 sigma = 1
jitter temporal[4] =           0 seed = -604223340 media =0 sigma = 1
jitter temporal[3] =           0 seed = 1356453488 media =0 sigma = 1
jitter temporal[2] =           1 seed = 1546612083 media =0 sigma = 1
jitter temporal[1] =          -1 seed = 849599824 media =0 sigma = 1
jitter temporal[0] =           0 seed = 1481105883 media =0 sigma = 1
jitter temporal[5] =          -1 seed = -1547267053 media =0 sigma = 1
jitter temporal[4] =           0 seed = -964404801 media =0 sigma = 1
jitter temporal[3] =           1 seed = -1874526672 media =0 sigma = 1
jitter temporal[2] =           1 seed = -1260799978 media =0 sigma = 1
jitter temporal[1] =           0 seed = -526352635 media =0 sigma = 1
jitter temporal[0] =           0 seed = -304226384 media =0 sigma = 1
jitter temporal[16] =           1 seed = 1004727990 media =0 sigma = 1
jitter temporal[15] =           0 seed = -374698731 media =0 sigma = 1
jitter temporal[14] =           1 seed = -1293374610 media =0 sigma = 1
jitter temporal[13] =           1 seed = -991381934 media =0 sigma = 1
jitter temporal[12] =          -1 seed = 1721066638 media =0 sigma = 1
jitter temporal[11] =           1 seed = 1838209282 media =0 sigma = 1
jitter temporal[10] =           0 seed = -1447320355 media =0 sigma = 1
jitter temporal[9] =          -1 seed = 913720710 media =0 sigma = 1
jitter temporal[8] =           1 seed = 1224518397 media =0 sigma = 1
jitter temporal[7] =           0 seed = 347640722 media =0 sigma = 1
jitter temporal[6] =           2 seed = -1866024896 media =0 sigma = 1
jitter temporal[5] =          -1 seed = -1179542811 media =0 sigma = 1
jitter temporal[4] =          -1 seed = 1602215482 media =0 sigma = 1
jitter temporal[3] =           0 seed = 563019657 media =0 sigma = 1
jitter temporal[2] =           0 seed = -538384102 media =0 sigma = 1
jitter temporal[1] =           1 seed = -869151229 media =0 sigma = 1
jitter temporal[0] =           1 seed = 1762172879 media =0 sigma = 1
jitter temporal[16] =           0 seed = -899311567 media =0 sigma = 1
jitter temporal[15] =          -1 seed = -2066921704 media =0 sigma = 1
jitter temporal[14] =           0 seed = -728330713 media =0 sigma = 1
jitter temporal[13] =           0 seed = 735044260 media =0 sigma = 1
jitter temporal[12] =           2 seed = -1776827400 media =0 sigma = 1
jitter temporal[11] =          -1 seed = -1352564585 media =0 sigma = 1
jitter temporal[10] =          -1 seed = 2145379970 media =0 sigma = 1
jitter temporal[9] =           0 seed = 457450367 media =0 sigma = 1
jitter temporal[8] =           1 seed = 2141611743 media =0 sigma = 1
jitter temporal[7] =           0 seed = -485998537 media =0 sigma = 1
jitter temporal[6] =          -1 seed = -1279036264 media =0 sigma = 1
jitter temporal[5] =           1 seed = -1447951208 media =0 sigma = 1
jitter temporal[4] =          -1 seed = 1024084768 media =0 sigma = 1
jitter temporal[3] =           0 seed = 884360020 media =0 sigma = 1
jitter temporal[2] =          -1 seed = 1494073666 media =0 sigma = 1
jitter temporal[1] =          -1 seed = 2038014600 media =0 sigma = 1
jitter temporal[0] =           0 seed = 237929662 media =0 sigma = 1
jitter temporal[5] =          -1 seed = -835579799 media =0 sigma = 1
jitter temporal[4] =          -1 seed = -2040491927 media =0 sigma = 1
jitter temporal[3] =           0 seed = -372243519 media =0 sigma = 1
jitter temporal[2] =           1 seed = -1062928435 media =0 sigma = 1
jitter temporal[1] =          -1 seed = 1546041186 media =0 sigma = 1
jitter temporal[0] =          -1 seed = -1630417053 media =0 sigma = 1
jitter temporal[5] =          -1 seed = 989407275 media =0 sigma = 1
jitter temporal[4] =           2 seed = -1852274483 media =0 sigma = 1
jitter temporal[3] =           1 seed = 1561458808 media =0 sigma = 1
jitter temporal[2] =          -2 seed = -1717397972 media =0 sigma = 1
jitter temporal[1] =           1 seed = 1964785470 media =0 sigma = 1
jitter temporal[0] =           1 seed = 1770218574 media =0 sigma = 1
jitter temporal[16] =           1 seed = -1617444156 media =0 sigma = 1
jitter temporal[15] =           0 seed = -667447394 media =0 sigma = 1
jitter temporal[14] =           0 seed = 1514409409 media =0 sigma = 1
jitter temporal[13] =           0 seed = 446656476 media =0 sigma = 1
jitter temporal[12] =          -1 seed = 1547546805 media =0 sigma = 1
jitter temporal[11] =           1 seed = -1700570358 media =0 sigma = 1
jitter temporal[10] =          -1 seed = 1592480366 media =0 sigma = 1
jitter temporal[9] =           0 seed = 1978568870 media =0 sigma = 1
jitter temporal[8] =           0 seed = -1339266877 media =0 sigma = 1
jitter temporal[7] =           3 seed = -2119697671 media =0 sigma = 1
jitter temporal[6] =           1 seed = -781981873 media =0 sigma = 1
jitter temporal[5] =           0 seed = 1131584693 media =0 sigma = 1
jitter temporal[4] =          -1 seed = -866859102 media =0 sigma = 1
jitter temporal[3] =           0 seed = 911800013 media =0 sigma = 1
jitter temporal[2] =           1 seed = 1200358047 media =0 sigma = 1
jitter temporal[1] =          -2 seed = -2109267101 media =0 sigma = 1
jitter temporal[0] =          -2 seed = -1909401102 media =0 sigma = 1
jitter temporal[16] =           0 seed = -606754157 media =0 sigma = 1
jitter temporal[15] =           1 seed = -1256447913 media =0 sigma = 1
jitter temporal[14] =           0 seed = 859304783 media =0 sigma = 1
jitter temporal[13] =           0 seed = 1270616273 media =0 sigma = 1
jitter temporal[12] =          -2 seed = 2107346004 media =0 sigma = 1
jitter temporal[11] =           1 seed = 1093891873 media =0 sigma = 1
jitter temporal[10] =           0 seed = -924326648 media =0 sigma = 1
jitter temporal[9] =          -1 seed = 1266999461 media =0 sigma = 1
jitter temporal[8] =          -1 seed = -2059783649 media =0 sigma = 1
jitter temporal[7] =           0 seed = 248734073 media =0 sigma = 1
jitter temporal[6] =          -2 seed = 1825640862 media =0 sigma = 1
jitter temporal[5] =           0 seed = 537287807 media =0 sigma = 1
jitter temporal[4] =           0 seed = -645763264 media =0 sigma = 1
jitter temporal[3] =          -1 seed = 1421767209 media =0 sigma = 1
jitter temporal[2] =           2 seed = 2005706505 media =0 sigma = 1
jitter temporal[1] =          -2 seed = 1916317922 media =0 sigma = 1
jitter temporal[0] =          -1 seed = 1150869313 media =0 sigma = 1
jitter temporal[5] =          -1 seed = 1096578875 media =0 sigma = 1
jitter temporal[4] =           0 seed = 256924404 media =0 sigma = 1
jitter temporal[3] =           1 seed = 1038686276 media =0 sigma = 1
jitter temporal[2] =          -1 seed = -1736082390 media =0 sigma = 1
jitter temporal[1] =          -1 seed = 1365277799 media =0 sigma = 1
jitter temporal[0] =           0 seed = 1633960138 media =0 sigma = 1
jitter temporal[5] =           0 seed = -1038620848 media =0 sigma = 1
jitter temporal[4] =           3 seed = 2145227783 media =0 sigma = 1
jitter temporal[3] =           0 seed = 1884522681 media =0 sigma = 1
jitter temporal[2] =          -1 seed = 1269238256 media =0 sigma = 1
jitter temporal[1] =           1 seed = -1352480342 media =0 sigma = 1
jitter temporal[0] =           1 seed = -1191457620 media =0 sigma = 1
jitter temporal[16] =           1 seed = -1744198274 media =0 sigma = 1
jitter temporal[15] =           0 seed = 383161052 media =0 sigma = 1
jitter temporal[14] =           1 seed = -2123411461 media =0 sigma = 1
jitter temporal[13] =           0 seed = 940657715 media =0 sigma = 1
jitter temporal[12] =           1 seed = 1317978347 media =0 sigma = 1
jitter temporal[11] =           0 seed = -1430592717 media =0 sigma = 1
jitter temporal[10] =          -1 seed = -1147703687 media =0 sigma = 1
jitter temporal[9] =           0 seed = 452287478 media =0 sigma = 1
jitter temporal[8] =           0 seed = -172251215 media =0 sigma = 1
jitter temporal[7] =          -2 seed = -2143161594 media =0 sigma = 1
jitter temporal[6] =          -1 seed = 1393442408 media =0 sigma = 1
jitter temporal[5] =           1 seed = -2037700828 media =0 sigma = 1
jitter temporal[4] =          -1 seed = -1140198975 media =0 sigma = 1
jitter temporal[3] =           0 seed = 421680242 media =0 sigma = 1
jitter temporal[2] =           0 seed = 508260450 media =0 sigma = 1
jitter temporal[1] =           1 seed = 1005914398 media =0 sigma = 1
jitter temporal[0] =          -1 seed = -2086406912 media =0 sigma = 1
jitter temporal[16] =          -1 seed = 1611242473 media =0 sigma = 1
jitter temporal[15] =          -1 seed = -1495262040 media =0 sigma = 1
jitter temporal[14] =           2 seed = -1895165054 media =0 sigma = 1
jitter temporal[13] =           1 seed = -1332476629 media =0 sigma = 1
jitter temporal[12] =          -1 seed = -1758223737 media =0 sigma = 1
jitter temporal[11] =           0 seed = 960478823 media =0 sigma = 1
jitter temporal[10] =           0 seed = -1486487445 media =0 sigma = 1
jitter temporal[9] =           0 seed = 1784132104 media =0 sigma = 1
jitter temporal[8] =           0 seed = -1440897567 media =0 sigma = 1
jitter temporal[7] =           0 seed = 893829400 media =0 sigma = 1
jitter temporal[6] =           1 seed = 986701421 media =0 sigma = 1
jitter temporal[5] =           0 seed = 379220476 media =0 sigma = 1
jitter temporal[4] =          -1 seed = -1256673541 media =0 sigma = 1
jitter temporal[3] =          -1 seed = -1984979979 media =0 sigma = 1
jitter temporal[2] =          -1 seed = -1049443459 media =0 sigma = 1
jitter temporal[1] =           0 seed = 632068883 media =0 sigma = 1
jitter temporal[0] =           0 seed = -567609023 media =0 sigma = 1
jitter temporal[5] =           2 seed = -1753958641 media =0 sigma = 1
jitter temporal[4] =           0 seed = 492138667 media =0 sigma = 1
jitter temporal[3] =           0 seed = -215896746 media =0 sigma = 1
jitter temporal[2] =          -1 seed = 968173002 media =0 sigma = 1
jitter temporal[1] =           1 seed = -1833027408 media =0 sigma = 1
jitter temporal[0] =          -1 seed = 1332637791 media =0 sigma = 1
jitter temporal[5] =           0 seed = 479615891 media =0 sigma = 1
jitter temporal[4] =           0 seed = 241699577 media =0 sigma = 1
jitter temporal[3] =           0 seed = 362767336 media =0 sigma = 1
jitter temporal[2] =          -2 seed = 1877521226 media =0 sigma = 1
jitter temporal[1] =           0 seed = 103267095 media =0 sigma = 1
jitter temporal[0] =          -1 seed = 1815941473 media =0 sigma = 1
jitter temporal[16] =           0 seed = 1237016162 media =0 sigma = 1
jitter temporal[15] =           0 seed = -727398349 media =0 sigma = 1
jitter temporal[14] =           1 seed = -956915815 media =0 sigma = 1
jitter temporal[13] =          -1 seed = 893017521 media =0 sigma = 1
jitter temporal[12] =           0 seed = -2016028501 media =0 sigma = 1
jitter temporal[11] =           1 seed = -1534184731 media =0 sigma = 1
jitter temporal[10] =           0 seed = -323502166 media =0 sigma = 1
jitter temporal[9] =           0 seed = 267486998 media =0 sigma = 1
jitter temporal[8] =          -2 seed = 1758659133 media =0 sigma = 1
jitter temporal[7] =          -1 seed = -1362813728 media =0 sigma = 1
jitter temporal[6] =           0 seed = 596559887 media =0 sigma = 1
jitter temporal[5] =           2 seed = -1828802926 media =0 sigma = 1
jitter temporal[4] =           0 seed = 503428024 media =0 sigma = 1
jitter temporal[3] =           0 seed = 495368166 media =0 sigma = 1
jitter temporal[2] =           1 seed = 1686227608 media =0 sigma = 1
jitter temporal[1] =           2 seed = -1725455018 media =0 sigma = 1
jitter temporal[0] =           0 seed = -653394065 media =0 sigma = 1
jitter temporal[16] =           0 seed = 328156625 media =0 sigma = 1
jitter temporal[15] =          -2 seed = 1744888883 media =0 sigma = 1
jitter temporal[14] =           1 seed = -1471721145 media =0 sigma = 1
jitter temporal[13] =           2 seed = 2114903202 media =0 sigma = 1
jitter temporal[12] =           1 seed = 1581681633 media =0 sigma = 1
jitter temporal[11] =           1 seed = 1931185847 media =0 sigma = 1
jitter temporal[10] =           0 seed = 1062011750 media =0 sigma = 1
jitter temporal[9] =           0 seed = -624796944 media =0 sigma = 1
jitter temporal[8] =           0 seed = -395630662 media =0 sigma = 1
jitter temporal[7] =          -1 seed = -1735363165 media =0 sigma = 1
jitter temporal[6] =          -2 seed = -2018443204 media =0 sigma = 1
jitter temporal[5] =          -2 seed = -1971063620 media =0 sigma = 1
jitter temporal[4] =           0 seed = -695362316 media =0 sigma = 1
jitter temporal[3] =          -1 seed = -1476934520 media =0 sigma = 1
jitter temporal[2] =           1 seed = -994373392 media =0 sigma = 1
jitter temporal[1] =           1 seed = 1383058302 media =0 sigma = 1
jitter temporal[0] =          -1 seed = 1178143049 media =0 sigma = 1
jitter temporal[5] =           1 seed = -833942050 media =0 sigma = 1
jitter temporal[4] =           1 seed = 801706728 media =0 sigma = 1
jitter temporal[3] =           3 seed = -2059347146 media =0 sigma = 1
jitter temporal[2] =           0 seed = -506215804 media =0 sigma = 1
jitter temporal[1] =           0 seed = -734522200 media =0 sigma = 1
jitter temporal[0] =           0 seed = -1370621003 media =0 sigma = 1
jitter temporal[5] =          -1 seed = -867127469 media =0 sigma = 1
jitter temporal[4] =          -1 seed = -1487078811 media =0 sigma = 1
jitter temporal[3] =          -2 seed = -1818890821 media =0 sigma = 1
jitter temporal[2] =          -1 seed = 1332384316 media =0 sigma = 1
jitter temporal[1] =           0 seed = 840515218 media =0 sigma = 1
jitter temporal[0] =           0 seed = -327185862 media =0 sigma = 1
jitter temporal[16] =           0 seed = -487629722 media =0 sigma = 1
jitter temporal[15] =           1 seed = -1078067580 media =0 sigma = 1
jitter temporal[14] =          -1 seed = -1425702437 media =0 sigma = 1
jitter temporal[13] =           1 seed = -828656205 media =0 sigma = 1
jitter temporal[12] =           0 seed = -531217049 media =0 sigma = 1
jitter temporal[11] =          -1 seed = 1152253489 media =0 sigma = 1
jitter temporal[10] =           0 seed = -372017355 media =0 sigma = 1
jitter temporal[9] =          -1 seed = 1123006186 media =0 sigma = 1
jitter temporal[8] =           0 seed = -1151345524 media =0 sigma = 1
jitter temporal[7] =           1 seed = -1635351382 media =0 sigma = 1
jitter temporal[6] =           1 seed = -1713759725 media =0 sigma = 1
jitter temporal[5] =           0 seed = 608962751 media =0 sigma = 1
jitter temporal[4] =           0 seed = 1128182037 media =0 sigma = 1
jitter temporal[3] =           1 seed = -1299915341 media =0 sigma = 1
jitter temporal[2] =           0 seed = -879734843 media =0 sigma = 1
jitter temporal[1] =           0 seed = 1052251657 media =0 sigma = 1
jitter temporal[0] =           0 seed = 414113940 media =0 sigma = 1
jitter temporal[16] =           1 seed = -2120414063 media =0 sigma = 1
jitter temporal[15] =           0 seed = 1766861969 media =0 sigma = 1
jitter temporal[14] =           0 seed = 124956127 media =0 sigma = 1
jitter temporal[13] =           2 seed = -1980745579 media =0 sigma = 1
jitter temporal[12] =           0 seed = 509096202 media =0 sigma = 1
jitter temporal[11] =           1 seed = -902425479 media =0 sigma = 1
jitter temporal[10] =          -1 seed = 1658726066 media =0 sigma = 1
jitter temporal[9] =           2 seed = 1915943574 media =0 sigma = 1
jitter temporal[8] =           0 seed = 1651643427 media =0 sigma = 1
jitter temporal[7] =           1 seed = 955109440 media =0 sigma = 1
jitter temporal[6] =          -1 seed = 2087809338 media =0 sigma = 1
jitter temporal[5] =           1 seed = 1015348551 media =0 sigma = 1
jitter temporal[4] =          -1 seed = 1421918770 media =0 sigma = 1
jitter temporal[3] =           1 seed = -987832092 media =0 sigma = 1
jitter temporal[2] =           1 seed = -753012534 media =0 sigma = 1
jitter temporal[1] =           1 seed = 1343614432 media =0 sigma = 1
jitter temporal[0] =           0 seed = -362270578 media =0 sigma = 1
jitter temporal[5] =          -2 seed = -1969732298 media =0 sigma = 1
jitter temporal[4] =           0 seed = 972978299 media =0 sigma = 1
jitter temporal[3] =           0 seed = -1503190365 media =0 sigma = 1
jitter temporal[2] =          -1 seed = -1798963384 media =0 sigma = 1
jitter temporal[1] =          -1 seed = -1352212496 media =0 sigma = 1
jitter temporal[0] =          -1 seed = 1296497668 media =0 sigma = 1
jitter temporal[5] =           0 seed = -311268101 media =0 sigma = 1
jitter temporal[4] =          -1 seed = 1370504830 media =0 sigma = 1
jitter temporal[3] =          -1 seed = 800597898 media =0 sigma = 1
jitter temporal[2] =           0 seed = -218613763 media =0 sigma = 1
jitter temporal[1] =           0 seed = 1402484123 media =0 sigma = 1
jitter temporal[0] =           2 seed = 1795672511 media =0 sigma = 1
jitter temporal[16] =           0 seed = 1628224728 media =0 sigma = 1
jitter temporal[15] =           2 seed = -1819109341 media =0 sigma = 1
jitter temporal[14] =           0 seed = -777453111 media =0 sigma = 1
jitter temporal[13] =          -1 seed = 1238568683 media =0 sigma = 1
jitter temporal[12] =           1 seed = -1018748033 media =0 sigma = 1
jitter temporal[11] =           0 seed = -760506096 media =0 sigma = 1
jitter temporal[10] =           2 seed = -1789445181 media =0 sigma = 1
jitter temporal[9] =           1 seed = -917649025 media =0 sigma = 1
jitter temporal[8] =          -1 seed = 1095731312 media =0 sigma = 1
jitter temporal[7] =           1 seed = -2015981447 media =0 sigma = 1
jitter temporal[6] =           1 seed = 1355594158 media =0 sigma = 1
jitter temporal[5] =          -1 seed = -1062084456 media =0 sigma = 1
jitter temporal[4] =           0 seed = 601390058 media =0 sigma = 1
jitter temporal[3] =          -1 seed = 2018737736 media =0 sigma = 1
jitter temporal[2] =          -1 seed = -1689299266 media =0 sigma = 1
jitter temporal[1] =          -3 seed = 2065810362 media =0 sigma = 1
jitter temporal[0] =          -1 seed = 1850559857 media =0 sigma = 1
jitter temporal[16] =          -1 seed = 983185673 media =0 sigma = 1
jitter temporal[15] =          -3 seed = -2061654615 media =0 sigma = 1
jitter temporal[14] =           2 seed = 1817414025 media =0 sigma = 1
jitter temporal[13] =           0 seed = -1861912966 media =0 sigma = 1
jitter temporal[12] =           0 seed = 789938999 media =0 sigma = 1
jitter temporal[11] =           0 seed = 348648662 media =0 sigma = 1
jitter temporal[10] =           0 seed = 272628786 media =0 sigma = 1
jitter temporal[9] =           1 seed = -1678485186 media =0 sigma = 1
jitter temporal[8] =           0 seed = 646417176 media =0 sigma = 1
jitter temporal[7] =           0 seed = 678755378 media =0 sigma = 1
jitter temporal[6] =          -1 seed = 1743701014 media =0 sigma = 1
jitter temporal[5] =           1 seed = -1227756747 media =0 sigma = 1
jitter temporal[4] =           0 seed = 485227091 media =0 sigma = 1
jitter temporal[3] =           2 seed = 2086059413 media =0 sigma = 1
jitter temporal[2] =           1 seed = 1933696045 media =0 sigma = 1
jitter temporal[1] =           1 seed = -1065218004 media =0 sigma = 1
jitter temporal[0] =          -1 seed = -2049631949 media =0 sigma = 1
jitter temporal[5] =           1 seed = -1390215345 media =0 sigma = 1
jitter temporal[4] =          -1 seed = 1295764243 media =0 sigma = 1
jitter temporal[3] =           0 seed = 1517093687 media =0 sigma = 1
jitter temporal[2] =          -1 seed = -2014750033 media =0 sigma = 1
jitter temporal[1] =           0 seed = 522119133 media =0 sigma = 1
jitter temporal[0] =           0 seed = 487084135 media =0 sigma = 1
jitter temporal[5] =           0 seed = 73013285 media =0 sigma = 1
jitter temporal[4] =           0 seed = 359875912 media =0 sigma = 1
jitter temporal[3] =          -1 seed = -1441302674 media =0 sigma = 1
jitter temporal[2] =           0 seed = -831430825 media =0 sigma = 1
jitter temporal[1] =          -1 seed = -1286613642 media =0 sigma = 1
jitter temporal[0] =           0 seed = -1025253815 media =0 sigma = 1
jitter temporal[16] =           0 seed = -1090983661 media =0 sigma = 1
jitter temporal[15] =          -1 seed = 1990519349 media =0 sigma = 1
jitter temporal[14] =          -1 seed = 1984347243 media =0 sigma = 1
jitter temporal[13] =           1 seed = 1084625099 media =0 sigma = 1
jitter temporal[12] =          -1 seed = 959241837 media =0 sigma = 1
jitter temporal[11] =          -1 seed = -1102421084 media =0 sigma = 1
jitter temporal[10] =           0 seed = -594719280 media =0 sigma = 1
jitter temporal[9] =          -1 seed = -1482333393 media =0 sigma = 1
jitter temporal[8] =           0 seed = 1768944641 media =0 sigma = 1
jitter temporal[7] =           0 seed = 849633091 media =0 sigma = 1
jitter temporal[6] =           0 seed = 448845429 media =0 sigma = 1
jitter temporal[5] =           1 seed = -1543832755 media =0 sigma = 1
jitter temporal[4] =           0 seed = 430251356 media =0 sigma = 1
jitter temporal[3] =           1 seed = 1095164668 media =0 sigma = 1
jitter temporal[2] =           0 seed = 606784023 media =0 sigma = 1
jitter temporal[1] =           0 seed = 1237420457 media =0 sigma = 1
jitter temporal[0] =          -2 seed = -1797757982 media =0 sigma = 1
jitter temporal[16] =           0 seed = -321029320 media =0 sigma = 1
jitter temporal[15] =          -1 seed = 1736871749 media =0 sigma = 1
jitter temporal[14] =          -2 seed = 1980035471 media =0 sigma = 1
jitter temporal[13] =           0 seed = -448482512 media =0 sigma = 1
jitter temporal[12] =          -1 seed = 1869861501 media =0 sigma = 1
jitter temporal[11] =          -1 seed = 1563653370 media =0 sigma = 1
jitter temporal[10] =           0 seed = -685858425 media =0 sigma = 1
jitter temporal[9] =           0 seed = -853165276 media =0 sigma = 1
jitter temporal[8] =          -1 seed = 951266818 media =0 sigma = 1
jitter temporal[7] =          -2 seed = -1722642310 media =0 sigma = 1
jitter temporal[6] =           0 seed = 1088405425 media =0 sigma = 1
jitter temporal[5] =           0 seed = 841549016 media =0 sigma = 1
jitter temporal[4] =          -1 seed = 1400224985 media =0 sigma = 1
jitter temporal[3] =           0 seed = 1154634823 media =0 sigma = 1
jitter temporal[2] =           0 seed = -767663476 media =0 sigma = 1
jitter temporal[1] =          -1 seed = -1280372142 media =0 sigma = 1
jitter temporal[0] =           0 seed = 310268144 media =0 sigma = 1
jitter temporal[5] =           1 seed = 1107988693 media =0 sigma = 1
jitter temporal[4] =           0 seed = -944912814 media =0 sigma = 1
jitter temporal[3] =           0 seed = -792490951 media =0 sigma = 1
jitter temporal[2] =           0 seed = 590987038 media =0 sigma = 1
jitter temporal[1] =           1 seed = 1205438950 media =0 sigma = 1
jitter temporal[0] =          -1 seed = -851187589 media =0 sigma = 1
jitter temporal[5] =          -1 seed = 1195883325 media =0 sigma = 1
jitter temporal[4] =           2 seed = -1856774880 media =0 sigma = 1
jitter temporal[3] =           0 seed = 843329180 media =0 sigma = 1
jitter temporal[2] =          -1 seed = 1583358048 media =0 sigma = 1
jitter temporal[1] =           2 seed = -1709554853 media =0 sigma = 1
jitter temporal[0] =          -1 seed = 2072006102 media =0 sigma = 1
atb1 = 0.00, atb0 = 0.00
Tests completados.
Simulation complete via $finish(1) at time 3 NS + 0
./tb/clock_distribution_tb.sv:144         $finish;
xcelium> ^C
xcelium> exit
TOOL:	xrun(64)	24.03-s004: Exiting on Jan 12, 2026 at 12:34:25 CET  (total: 00:01:17)
