xrun(64): 24.03-s004: (c) Copyright 1995-2024 Cadence Design Systems, Inc.
TOOL:	xrun(64)	24.03-s004: Started on Jan 09, 2026 at 16:56:18 CET
xrun
	-f xrun.f
		-clean
		./models/clock_distribution_mismatch.sv
		./tb/clock_distribution_tb.sv
		-access +rw
		-gui
		-s
		-input /home/msegper/Documents/TFM/clock_distribution/restore.tcl
xrun: *N,CLEAN: Removing existing directory ./xcelium.d.
file: ./models/clock_distribution_mismatch.sv
        int mean = 0;         // Promedio de la distribución
                 |
xmvlog: *W,VARIST (./models/clock_distribution_mismatch.sv,124|17): Local static variable with initializer requires 'static' keyword.
        int std_dev = 10;     // Desviación estándar, sigma
                    |
xmvlog: *W,VARIST (./models/clock_distribution_mismatch.sv,125|20): Local static variable with initializer requires 'static' keyword.
	module worklib.clock_distribution:sv
		errors: 0, warnings: 2
file: ./tb/clock_distribution_tb.sv
	module worklib.clock_distribution_tb:sv
		errors: 0, warnings: 0
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
	Top level design units:
		cds_rnm_pkg
		clock_distribution_tb
	Building instance overlay tables: ....................
        $display("mismatch temporal[%0d] = %0d seed = %0d media =%0d sigma = %0d", i, random_value, seed, mean, std_dev);
                                                                                                 |
xmelab: *W,REALCV (./models/clock_distribution_mismatch.sv,131|97): Real argument converted to integer for (%d).
 Done
	Using implicit TMP libraries; associated with library worklib
	Generating native compiled code:
		worklib.clock_distribution:sv <0x49b1b2d7>
			streams:  60, words: 97219
		worklib.clock_distribution_tb:sv <0x11f75bdf>
			streams:  12, words: 13543
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                 Instances  Unique
		Modules:                 2       2
		Verilog packages:        1       1
		Registers:             132     132
		Scalar wires:           56       -
		Vectored wires:          1       -
		Always blocks:           6       6
		Initial blocks:          8       8
		Parallel blocks:         1       1
		Pseudo assignments:      9       -
		Assertions:              3       3
		Simulation timescale:  1ps
	Writing initial simulation snapshot: worklib.clock_distribution_tb:sv
xmsim: *W,NOMTDGUI: Multi-Threaded Dumping is disabled for interactive debug mode.
SVSEED default: 1
[DMSINFO] Simulating with Xcelium Mixed-Signal App...

-------------------------------------
Relinquished control to SimVision...
xcelium> 
xcelium> source /eda/cadence/2024-25/RHELx86/XCELIUM_24.03.004/tools/xcelium/files/xmsimrc
xcelium> 
xcelium> # XM-Sim Command File
xcelium> # TOOL:	xmsim(64)	24.03-s004
xcelium> #
xcelium> #
xcelium> # You can restore this configuration with:
xcelium> #
xcelium> #      xrun -f xrun.f -input restore.tcl
xcelium> #
xcelium> 
xcelium> set tcl_prompt1 {puts -nonewline "xcelium> "}
puts -nonewline "xcelium> "
xcelium> set tcl_prompt2 {puts -nonewline "> "}
puts -nonewline "> "
xcelium> set vlog_format %h
%h
xcelium> set vhdl_format %v
%v
xcelium> set real_precision 6
6
xcelium> set display_unit auto
auto
xcelium> set time_unit module
module
xcelium> set heap_garbage_size -200
-200
xcelium> set heap_garbage_time 0
0
xcelium> set assert_report_level note
note
xcelium> set assert_stop_level error
error
xcelium> set autoscope yes
yes
xcelium> set assert_1164_warnings yes
yes
xcelium> set pack_assert_off {}
xcelium> set severity_pack_assert_off {note warning}
note warning
xcelium> set assert_output_stop_level failed
failed
xcelium> set tcl_debug_level 0
0
xcelium> set relax_path_name 1
1
xcelium> set vhdl_vcdmap XX01ZX01X
XX01ZX01X
xcelium> set intovf_severity_level ERROR
ERROR
xcelium> set probe_screen_format 0
0
xcelium> set rangecnst_severity_level ERROR
ERROR
xcelium> set textio_severity_level ERROR
ERROR
xcelium> set vital_timing_checks_on 1
1
xcelium> set vlog_code_show_force 0
0
xcelium> set assert_count_attempts 1
1
xcelium> set tcl_all64 false
false
xcelium> set tcl_runerror_exit false
false
xcelium> set assert_report_incompletes 0
0
xcelium> set show_force 1
1
xcelium> set force_reset_by_reinvoke 0
0
xcelium> set tcl_relaxed_literal 0
0
xcelium> set probe_exclude_patterns {}
xcelium> set probe_packed_limit 4k
4k
xcelium> set probe_unpacked_limit 16k
16k
xcelium> set assert_internal_msg no
no
xcelium> set svseed 1
1
xcelium> set assert_reporting_mode 0
0
xcelium> set vcd_compact_mode 0
0
xcelium> set vhdl_forgen_loopindex_enum_pos 0
0
xcelium> set xmreplay_dc_debug 0
0
xcelium> set tcl_runcmd_interrupt next_command
next_command
xcelium> set tcl_sigval_prefix {#}
#
xcelium> alias . run
xcelium> alias indago verisium
xcelium> alias quit exit
xcelium> database -open -shm -into waves.shm waves -default
Created default SHM database waves
xcelium> probe -create -database waves clock_distribution_tb.dut.atb0 clock_distribution_tb.dut.atb1 clock_distribution_tb.dut.atb_ena clock_distribution_tb.dut.clkin clock_distribution_tb.dut.clkinb clock_distribution_tb.dut.clkout_binary_0 clock_distribution_tb.dut.clkout_binary_0_red clock_distribution_tb.dut.clkout_binary_1 clock_distribution_tb.dut.clkout_binary_2 clock_distribution_tb.dut.clkout_binary_3 clock_distribution_tb.dut.clkout_binary_4 clock_distribution_tb.dut.clkout_binary_5 clock_distribution_tb.dut.clkout_therm_0 clock_distribution_tb.dut.clkout_therm_1 clock_distribution_tb.dut.clkout_therm_2 clock_distribution_tb.dut.clkout_therm_3 clock_distribution_tb.dut.clkout_therm_4 clock_distribution_tb.dut.clkout_therm_5 clock_distribution_tb.dut.clkout_therm_6 clock_distribution_tb.dut.clkout_therm_7 clock_distribution_tb.dut.clkout_therm_8 clock_distribution_tb.dut.clkout_therm_9 clock_distribution_tb.dut.clkout_therm_10 clock_distribution_tb.dut.clkout_therm_11 clock_distribution_tb.dut.clkout_therm_12 clock_distribution_tb.dut.clkout_therm_13 clock_distribution_tb.dut.clkout_therm_14 clock_distribution_tb.dut.clkout_therm_15 clock_distribution_tb.dut.clkout_therm_16 clock_distribution_tb.dut.clkoutb_binary_0 clock_distribution_tb.dut.clkoutb_binary_0_red clock_distribution_tb.dut.clkoutb_binary_1 clock_distribution_tb.dut.clkoutb_binary_2 clock_distribution_tb.dut.clkoutb_binary_3 clock_distribution_tb.dut.clkoutb_binary_4 clock_distribution_tb.dut.clkoutb_binary_5 clock_distribution_tb.dut.clkoutb_therm_0 clock_distribution_tb.dut.clkoutb_therm_1 clock_distribution_tb.dut.clkoutb_therm_2 clock_distribution_tb.dut.clkoutb_therm_3 clock_distribution_tb.dut.clkoutb_therm_4 clock_distribution_tb.dut.clkoutb_therm_5 clock_distribution_tb.dut.clkoutb_therm_6 clock_distribution_tb.dut.clkoutb_therm_7 clock_distribution_tb.dut.clkoutb_therm_8 clock_distribution_tb.dut.clkoutb_therm_9 clock_distribution_tb.dut.clkoutb_therm_10 clock_distribution_tb.dut.clkoutb_therm_11 clock_distribution_tb.dut.clkoutb_therm_12 clock_distribution_tb.dut.clkoutb_therm_13 clock_distribution_tb.dut.clkoutb_therm_14 clock_distribution_tb.dut.clkoutb_therm_15 clock_distribution_tb.dut.clkoutb_therm_16 clock_distribution_tb.dut.iref_25ua clock_distribution_tb.dut.pdb clock_distribution_tb.dut.vddana_0p8 clock_distribution_tb.dut.vssana
Created probe 1
xcelium> 
xcelium> simvision -input restore.tcl.svcf
xcelium> run
mismatch temporal[0] =           3 seed = -665810235 media =0 sigma = 10
mismatch temporal[1] =          11 seed = -1369323317 media =0 sigma = 10
mismatch temporal[2] =          -1 seed = -265150613 media =0 sigma = 10
mismatch temporal[3] =          -9 seed = -1150328559 media =0 sigma = 10
mismatch temporal[4] =          -8 seed = 1308122185 media =0 sigma = 10
mismatch temporal[5] =         -20 seed = 1879843743 media =0 sigma = 10
mismatch temporal[6] =         -14 seed = -1806158787 media =0 sigma = 10
mismatch temporal[7] =          10 seed = 2027533513 media =0 sigma = 10
mismatch temporal[8] =           0 seed = -468304391 media =0 sigma = 10
mismatch temporal[9] =           6 seed = 783835274 media =0 sigma = 10
mismatch temporal[10] =         -13 seed = 2007190375 media =0 sigma = 10
mismatch temporal[11] =          18 seed = -1776842891 media =0 sigma = 10
mismatch temporal[12] =           7 seed = -1118601810 media =0 sigma = 10
mismatch temporal[13] =           2 seed = -964037897 media =0 sigma = 10
mismatch temporal[14] =         -16 seed = 2130641910 media =0 sigma = 10
mismatch temporal[15] =           0 seed = -188503446 media =0 sigma = 10
mismatch temporal[16] =          10 seed = 1224124911 media =0 sigma = 10
mismatch temporal[0] =           8 seed = -1815533540 media =0 sigma = 10
mismatch temporal[1] =           6 seed = -904099331 media =0 sigma = 10
mismatch temporal[2] =          -6 seed = -987998196 media =0 sigma = 10
mismatch temporal[3] =           1 seed = 512922378 media =0 sigma = 10
mismatch temporal[4] =         -13 seed = 1486658417 media =0 sigma = 10
mismatch temporal[5] =           6 seed = 1035052190 media =0 sigma = 10
mismatch temporal[6] =          12 seed = -1780495438 media =0 sigma = 10
mismatch temporal[7] =          16 seed = 1849785074 media =0 sigma = 10
mismatch temporal[8] =          -1 seed = -1515680127 media =0 sigma = 10
mismatch temporal[9] =           0 seed = -140519604 media =0 sigma = 10
mismatch temporal[10] =          -2 seed = 867706007 media =0 sigma = 10
mismatch temporal[11] =           4 seed = -596971564 media =0 sigma = 10
mismatch temporal[12] =           3 seed = -1376642554 media =0 sigma = 10
mismatch temporal[13] =          -7 seed = -955733948 media =0 sigma = 10
mismatch temporal[14] =          12 seed = 2080587752 media =0 sigma = 10
mismatch temporal[15] =          13 seed = -1660797128 media =0 sigma = 10
mismatch temporal[16] =           8 seed = -1253589866 media =0 sigma = 10
mismatch temporal[0] =         -18 seed = -1903471105 media =0 sigma = 10
mismatch temporal[1] =           6 seed = 766332548 media =0 sigma = 10
mismatch temporal[2] =           0 seed = -219869516 media =0 sigma = 10
mismatch temporal[3] =           2 seed = 1372225059 media =0 sigma = 10
mismatch temporal[4] =          -8 seed = 1176572041 media =0 sigma = 10
mismatch temporal[5] =          16 seed = -1665888237 media =0 sigma = 10
mismatch temporal[0] =          -7 seed = 2124686048 media =0 sigma = 10
mismatch temporal[1] =         -10 seed = 1300172114 media =0 sigma = 10
mismatch temporal[2] =           7 seed = -916290221 media =0 sigma = 10
mismatch temporal[3] =          -1 seed = 456076362 media =0 sigma = 10
mismatch temporal[4] =          16 seed = -1690972545 media =0 sigma = 10
mismatch temporal[5] =         -12 seed = 1723802998 media =0 sigma = 10
Iniciando tests...
Test 1: Estado apagado
clkout_therm_16 = 0, clkoutb_therm_16 = 0
Test 2: Estado encendido con atb_ena = 2'b00
atb1 = `wrealZState, atb0 = `wrealZState
Test 3: Estado encendido con atb_ena = 2'b01
atb1 = 0.80, atb0 = 0.00
Test 4: Estado encendido con atb_ena = 2'b10
atb1 = 0.80, atb0 = 0.00
Test 5: Estado encendido con atb_ena = 2'b11
atb1 = 0.00, atb0 = 0.00
Tests completados.
Simulation complete via $finish(1) at time 3 NS + 0
./tb/clock_distribution_tb.sv:144         $finish;
xcelium> ^C
xcelium> exit
TOOL:	xrun(64)	24.03-s004: Exiting on Jan 09, 2026 at 17:01:37 CET  (total: 00:05:19)
