xrun(64): 24.03-s004: (c) Copyright 1995-2024 Cadence Design Systems, Inc.
TOOL:	xrun(64)	24.03-s004: Started on Nov 11, 2025 at 16:21:33 CET
xrun
	-f xrun.f
		-clean
		./models/clock_distribution.sv
		./tb/clock_distribution_tb.sv
		-access +rw
		-gui
		-s
		-input /home/msegper/Documents/TFM/clock_distribution/restore.tcl
xrun: *N,CLEAN: Removing existing directory ./xcelium.d.
file: ./models/clock_distribution.sv
	module worklib.clock_distribution:sv
		errors: 0, warnings: 0
file: ./tb/clock_distribution_tb.sv
	module worklib.clock_distribution_tb:sv
		errors: 0, warnings: 0
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
	Top level design units:
		cds_rnm_pkg
		clock_distribution_tb
	Building instance overlay tables: .................... Done
	Using implicit TMP libraries; associated with library worklib
	Generating native compiled code:
		worklib.clock_distribution:sv <0x16f02fb7>
			streams:  10, words: 29540
		worklib.clock_distribution_tb:sv <0x58a8fd6f>
			streams:  12, words: 13543
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                 Instances  Unique
		Modules:                 2       2
		Verilog packages:        1       1
		Registers:             117     117
		Scalar wires:           56       -
		Vectored wires:          1       -
		Always blocks:           6       6
		Initial blocks:          5       5
		Parallel blocks:         1       1
		Pseudo assignments:      9       -
		Assertions:              3       3
		Simulation timescale:  1ps
	Writing initial simulation snapshot: worklib.clock_distribution_tb:sv
xmsim: *W,NOMTDGUI: Multi-Threaded Dumping is disabled for interactive debug mode.
[DMSINFO] Simulating with Xcelium Mixed-Signal App...

-------------------------------------
Relinquished control to SimVision...
xcelium> 
xcelium> source /eda/cadence/2024-25/RHELx86/XCELIUM_24.03.004/tools/xcelium/files/xmsimrc
xcelium> 
xcelium> # XM-Sim Command File
xcelium> # TOOL:	xmsim(64)	24.03-s004
xcelium> #
xcelium> #
xcelium> # You can restore this configuration with:
xcelium> #
xcelium> #      xrun -f xrun.f -input restore.tcl
xcelium> #
xcelium> 
xcelium> set tcl_prompt1 {puts -nonewline "xcelium> "}
puts -nonewline "xcelium> "
xcelium> set tcl_prompt2 {puts -nonewline "> "}
puts -nonewline "> "
xcelium> set vlog_format %h
%h
xcelium> set vhdl_format %v
%v
xcelium> set real_precision 6
6
xcelium> set display_unit auto
auto
xcelium> set time_unit module
module
xcelium> set heap_garbage_size -200
-200
xcelium> set heap_garbage_time 0
0
xcelium> set assert_report_level note
note
xcelium> set assert_stop_level error
error
xcelium> set autoscope yes
yes
xcelium> set assert_1164_warnings yes
yes
xcelium> set pack_assert_off {}
xcelium> set severity_pack_assert_off {note warning}
note warning
xcelium> set assert_output_stop_level failed
failed
xcelium> set tcl_debug_level 0
0
xcelium> set relax_path_name 1
1
xcelium> set vhdl_vcdmap XX01ZX01X
XX01ZX01X
xcelium> set intovf_severity_level ERROR
ERROR
xcelium> set probe_screen_format 0
0
xcelium> set rangecnst_severity_level ERROR
ERROR
xcelium> set textio_severity_level ERROR
ERROR
xcelium> set vital_timing_checks_on 1
1
xcelium> set vlog_code_show_force 0
0
xcelium> set assert_count_attempts 1
1
xcelium> set tcl_all64 false
false
xcelium> set tcl_runerror_exit false
false
xcelium> set assert_report_incompletes 0
0
xcelium> set show_force 1
1
xcelium> set force_reset_by_reinvoke 0
0
xcelium> set tcl_relaxed_literal 0
0
xcelium> set probe_exclude_patterns {}
xcelium> set probe_packed_limit 4k
4k
xcelium> set probe_unpacked_limit 16k
16k
xcelium> set assert_internal_msg no
no
xcelium> set svseed 1
1
xcelium> set assert_reporting_mode 0
0
xcelium> set vcd_compact_mode 0
0
xcelium> set vhdl_forgen_loopindex_enum_pos 0
0
xcelium> set xmreplay_dc_debug 0
0
xcelium> set tcl_runcmd_interrupt next_command
next_command
xcelium> set tcl_sigval_prefix {#}
#
xcelium> alias . run
xcelium> alias indago verisium
xcelium> alias quit exit
xcelium> database -open -shm -into waves.shm waves -default
Created default SHM database waves
xcelium> probe -create -database waves clock_distribution_tb.dut.atb0 clock_distribution_tb.dut.atb1 clock_distribution_tb.dut.atb_ena clock_distribution_tb.dut.clkin clock_distribution_tb.dut.clkinb clock_distribution_tb.dut.clkout_binary_0 clock_distribution_tb.dut.clkout_binary_0_red clock_distribution_tb.dut.clkout_binary_1 clock_distribution_tb.dut.clkout_binary_2 clock_distribution_tb.dut.clkout_binary_3 clock_distribution_tb.dut.clkout_binary_4 clock_distribution_tb.dut.clkout_binary_5 clock_distribution_tb.dut.clkout_therm_0 clock_distribution_tb.dut.clkout_therm_1 clock_distribution_tb.dut.clkout_therm_2 clock_distribution_tb.dut.clkout_therm_3 clock_distribution_tb.dut.clkout_therm_4 clock_distribution_tb.dut.clkout_therm_5 clock_distribution_tb.dut.clkout_therm_6 clock_distribution_tb.dut.clkout_therm_7 clock_distribution_tb.dut.clkout_therm_8 clock_distribution_tb.dut.clkout_therm_9 clock_distribution_tb.dut.clkout_therm_10 clock_distribution_tb.dut.clkout_therm_11 clock_distribution_tb.dut.clkout_therm_12 clock_distribution_tb.dut.clkout_therm_13 clock_distribution_tb.dut.clkout_therm_14 clock_distribution_tb.dut.clkout_therm_15 clock_distribution_tb.dut.clkout_therm_16 clock_distribution_tb.dut.clkoutb_binary_0 clock_distribution_tb.dut.clkoutb_binary_0_red clock_distribution_tb.dut.clkoutb_binary_1 clock_distribution_tb.dut.clkoutb_binary_2 clock_distribution_tb.dut.clkoutb_binary_3 clock_distribution_tb.dut.clkoutb_binary_4 clock_distribution_tb.dut.clkoutb_binary_5 clock_distribution_tb.dut.clkoutb_therm_0 clock_distribution_tb.dut.clkoutb_therm_1 clock_distribution_tb.dut.clkoutb_therm_2 clock_distribution_tb.dut.clkoutb_therm_3 clock_distribution_tb.dut.clkoutb_therm_4 clock_distribution_tb.dut.clkoutb_therm_5 clock_distribution_tb.dut.clkoutb_therm_6 clock_distribution_tb.dut.clkoutb_therm_7 clock_distribution_tb.dut.clkoutb_therm_8 clock_distribution_tb.dut.clkoutb_therm_9 clock_distribution_tb.dut.clkoutb_therm_10 clock_distribution_tb.dut.clkoutb_therm_11 clock_distribution_tb.dut.clkoutb_therm_12 clock_distribution_tb.dut.clkoutb_therm_13 clock_distribution_tb.dut.clkoutb_therm_14 clock_distribution_tb.dut.clkoutb_therm_15 clock_distribution_tb.dut.clkoutb_therm_16 clock_distribution_tb.dut.iref_25ua clock_distribution_tb.dut.pdb clock_distribution_tb.dut.vddana_0p8 clock_distribution_tb.dut.vssana
Created probe 1
xcelium> 
xcelium> simvision -input restore.tcl.svcf
xcelium> run
Iniciando tests...
Test 1: Estado apagado
clkout_therm_16 = 0, clkoutb_therm_16 = 0
Test 2: Estado encendido con atb_ena = 2'b00
atb1 = `wrealZState, atb0 = `wrealZState
Test 3: Estado encendido con atb_ena = 2'b01
atb1 = 0.80, atb0 = 0.00
Test 4: Estado encendido con atb_ena = 2'b10
atb1 = 0.80, atb0 = 0.00
Test 5: Estado encendido con atb_ena = 2'b11
atb1 = 0.00, atb0 = 0.00
Tests completados.
Simulation complete via $finish(1) at time 3 US + 0
./tb/clock_distribution_tb.sv:144         $finish;
xcelium> ^C
xcelium> exit
TOOL:	xrun(64)	24.03-s004: Exiting on Nov 11, 2025 at 16:26:19 CET  (total: 00:04:46)
