xrun(64): 24.03-s004: (c) Copyright 1995-2024 Cadence Design Systems, Inc.
TOOL:	xrun(64)	24.03-s004: Started on Feb 09, 2026 at 12:26:25 CET
xrun
	-f xrun.f
		-clean
		./models/clock_distribution_all_non_linearities.sv
		./tb/clock_distribution_tb.sv
		-access +rw
		-gui
		-s
		-input /home/msegper/Documents/TFM/clock_distribution/restore.tcl
xrun: *N,CLEAN: Removing existing directory ./xcelium.d.
file: ./models/clock_distribution_all_non_linearities.sv
        int mean = 0;         // Promedio de la distribución
                 |
xmvlog: *W,VARIST (./models/clock_distribution_all_non_linearities.sv,120|17): Local static variable with initializer requires 'static' keyword.
        int std_dev = 1;     // Desviación estándar, sigma
                    |
xmvlog: *W,VARIST (./models/clock_distribution_all_non_linearities.sv,121|20): Local static variable with initializer requires 'static' keyword.
        int mean = 0;         // Promedio de la distribución
                 |
xmvlog: *W,VARIST (./models/clock_distribution_all_non_linearities.sv,135|17): Local static variable with initializer requires 'static' keyword.
        int std_dev = 1;     // Desviación estándar, sigma
                    |
xmvlog: *W,VARIST (./models/clock_distribution_all_non_linearities.sv,136|20): Local static variable with initializer requires 'static' keyword.
	module worklib.clock_distribution:sv
		errors: 0, warnings: 4
file: ./tb/clock_distribution_tb.sv
	module worklib.clock_distribution_tb:sv
		errors: 0, warnings: 0
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
	Top level design units:
		cds_rnm_pkg
		clock_distribution_tb
	Building instance overlay tables: ....................
        $display("jitter temporal %s [%0d] = %0d seed = %0d media =%0d sigma = %0d", type_jitter, i, random_value, seed, mean, std_dev);
                                                                                                                |
xmelab: *W,REALCV (./models/clock_distribution_all_non_linearities.sv,128|112): Real argument converted to integer for (%d).
        $display("mismatch temporal %s [%0d] = %0d seed = %0d media =%0d sigma = %0d", type_mismatch, i, random_value, seed, mean, std_dev);
                                                                                                                    |
xmelab: *W,REALCV (./models/clock_distribution_all_non_linearities.sv,143|116): Real argument converted to integer for (%d).
 Done
	Using implicit TMP libraries; associated with library worklib
	Generating native compiled code:
		worklib.clock_distribution:sv <0x681f60db>
			streams:  85, words: 129527
		worklib.clock_distribution_tb:sv <0x11f75bdf>
			streams:  12, words: 13543
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                 Instances  Unique
		Modules:                 2       2
		Verilog packages:        1       1
		Registers:             138     138
		Scalar wires:           56       -
		Vectored wires:          1       -
		Always blocks:           6       6
		Initial blocks:          9       9
		Parallel blocks:         1       1
		Pseudo assignments:      9       -
		Assertions:              3       3
		Simulation timescale:  1ps
	Writing initial simulation snapshot: worklib.clock_distribution_tb:sv
xmsim: *W,NOMTDGUI: Multi-Threaded Dumping is disabled for interactive debug mode.
SVSEED default: 1
[DMSINFO] Simulating with Xcelium Mixed-Signal App...

-------------------------------------
Relinquished control to SimVision...
xcelium> 
xcelium> source /eda/cadence/2024-25/RHELx86/XCELIUM_24.03.004/tools/xcelium/files/xmsimrc
xcelium> 
xcelium> # XM-Sim Command File
xcelium> # TOOL:	xmsim(64)	24.03-s004
xcelium> #
xcelium> #
xcelium> # You can restore this configuration with:
xcelium> #
xcelium> #      xrun -f xrun.f -input restore.tcl
xcelium> #
xcelium> 
xcelium> set tcl_prompt1 {puts -nonewline "xcelium> "}
puts -nonewline "xcelium> "
xcelium> set tcl_prompt2 {puts -nonewline "> "}
puts -nonewline "> "
xcelium> set vlog_format %h
%h
xcelium> set vhdl_format %v
%v
xcelium> set real_precision 6
6
xcelium> set display_unit auto
auto
xcelium> set time_unit module
module
xcelium> set heap_garbage_size -200
-200
xcelium> set heap_garbage_time 0
0
xcelium> set assert_report_level note
note
xcelium> set assert_stop_level error
error
xcelium> set autoscope yes
yes
xcelium> set assert_1164_warnings yes
yes
xcelium> set pack_assert_off {}
xcelium> set severity_pack_assert_off {note warning}
note warning
xcelium> set assert_output_stop_level failed
failed
xcelium> set tcl_debug_level 0
0
xcelium> set relax_path_name 1
1
xcelium> set vhdl_vcdmap XX01ZX01X
XX01ZX01X
xcelium> set intovf_severity_level ERROR
ERROR
xcelium> set probe_screen_format 0
0
xcelium> set rangecnst_severity_level ERROR
ERROR
xcelium> set textio_severity_level ERROR
ERROR
xcelium> set vital_timing_checks_on 1
1
xcelium> set vlog_code_show_force 0
0
xcelium> set assert_count_attempts 1
1
xcelium> set tcl_all64 false
false
xcelium> set tcl_runerror_exit false
false
xcelium> set assert_report_incompletes 0
0
xcelium> set show_force 1
1
xcelium> set force_reset_by_reinvoke 0
0
xcelium> set tcl_relaxed_literal 0
0
xcelium> set probe_exclude_patterns {}
xcelium> set probe_packed_limit 4k
4k
xcelium> set probe_unpacked_limit 16k
16k
xcelium> set assert_internal_msg no
no
xcelium> set svseed 1
1
xcelium> set assert_reporting_mode 0
0
xcelium> set vcd_compact_mode 0
0
xcelium> set vhdl_forgen_loopindex_enum_pos 0
0
xcelium> set xmreplay_dc_debug 0
0
xcelium> set tcl_runcmd_interrupt next_command
next_command
xcelium> set tcl_sigval_prefix {#}
#
xcelium> alias . run
xcelium> alias indago verisium
xcelium> alias quit exit
xcelium> database -open -shm -into waves.shm waves -default
Created default SHM database waves
xcelium> probe -create -database waves clock_distribution_tb.dut.atb0 clock_distribution_tb.dut.atb1 clock_distribution_tb.dut.atb_ena clock_distribution_tb.dut.clkin clock_distribution_tb.dut.clkinb clock_distribution_tb.dut.clkout_binary_0 clock_distribution_tb.dut.clkout_binary_0_red clock_distribution_tb.dut.clkout_binary_1 clock_distribution_tb.dut.clkout_binary_2 clock_distribution_tb.dut.clkout_binary_3 clock_distribution_tb.dut.clkout_binary_4 clock_distribution_tb.dut.clkout_binary_5 clock_distribution_tb.dut.clkout_therm_0 clock_distribution_tb.dut.clkout_therm_1 clock_distribution_tb.dut.clkout_therm_2 clock_distribution_tb.dut.clkout_therm_3 clock_distribution_tb.dut.clkout_therm_4 clock_distribution_tb.dut.clkout_therm_5 clock_distribution_tb.dut.clkout_therm_6 clock_distribution_tb.dut.clkout_therm_7 clock_distribution_tb.dut.clkout_therm_8 clock_distribution_tb.dut.clkout_therm_9 clock_distribution_tb.dut.clkout_therm_10 clock_distribution_tb.dut.clkout_therm_11 clock_distribution_tb.dut.clkout_therm_12 clock_distribution_tb.dut.clkout_therm_13 clock_distribution_tb.dut.clkout_therm_14 clock_distribution_tb.dut.clkout_therm_15 clock_distribution_tb.dut.clkout_therm_16 clock_distribution_tb.dut.clkoutb_binary_0 clock_distribution_tb.dut.clkoutb_binary_0_red clock_distribution_tb.dut.clkoutb_binary_1 clock_distribution_tb.dut.clkoutb_binary_2 clock_distribution_tb.dut.clkoutb_binary_3 clock_distribution_tb.dut.clkoutb_binary_4 clock_distribution_tb.dut.clkoutb_binary_5 clock_distribution_tb.dut.clkoutb_therm_0 clock_distribution_tb.dut.clkoutb_therm_1 clock_distribution_tb.dut.clkoutb_therm_2 clock_distribution_tb.dut.clkoutb_therm_3 clock_distribution_tb.dut.clkoutb_therm_4 clock_distribution_tb.dut.clkoutb_therm_5 clock_distribution_tb.dut.clkoutb_therm_6 clock_distribution_tb.dut.clkoutb_therm_7 clock_distribution_tb.dut.clkoutb_therm_8 clock_distribution_tb.dut.clkoutb_therm_9 clock_distribution_tb.dut.clkoutb_therm_10 clock_distribution_tb.dut.clkoutb_therm_11 clock_distribution_tb.dut.clkoutb_therm_12 clock_distribution_tb.dut.clkoutb_therm_13 clock_distribution_tb.dut.clkoutb_therm_14 clock_distribution_tb.dut.clkoutb_therm_15 clock_distribution_tb.dut.clkoutb_therm_16 clock_distribution_tb.dut.iref_25ua clock_distribution_tb.dut.pdb clock_distribution_tb.dut.vddana_0p8 clock_distribution_tb.dut.vssana
Created probe 1
xcelium> 
xcelium> simvision -input restore.tcl.svcf
xcelium> run
mismatch temporal therm [0] =           0 seed = 129616766 media =0 sigma = 1
mismatch temporal therm [1] =           0 seed = 237957420 media =0 sigma = 1
mismatch temporal therm [2] =           1 seed = 1379569055 media =0 sigma = 1
mismatch temporal therm [3] =           1 seed = 1083003834 media =0 sigma = 1
mismatch temporal therm [4] =          -1 seed = 1436499988 media =0 sigma = 1
mismatch temporal therm [5] =           2 seed = 1734256537 media =0 sigma = 1
mismatch temporal therm [6] =           0 seed = 466026175 media =0 sigma = 1
mismatch temporal therm [7] =           1 seed = -1194537998 media =0 sigma = 1
mismatch temporal therm [8] =          -2 seed = -1994547904 media =0 sigma = 1
mismatch temporal therm [9] =          -3 seed = 2051887517 media =0 sigma = 1
mismatch temporal therm [10] =           1 seed = -1355547127 media =0 sigma = 1
mismatch temporal therm [11] =          -2 seed = 1877475193 media =0 sigma = 1
mismatch temporal therm [12] =          -1 seed = 1727671484 media =0 sigma = 1
mismatch temporal therm [13] =           0 seed = -500328910 media =0 sigma = 1
mismatch temporal therm [14] =           1 seed = -2127066652 media =0 sigma = 1
mismatch temporal therm [15] =          -1 seed = 1479910163 media =0 sigma = 1
mismatch temporal therm [16] =           0 seed = -502357234 media =0 sigma = 1
mismatch temporal binary [0] =           1 seed = 1634104956 media =0 sigma = 1
mismatch temporal binary [1] =           0 seed = -1927313332 media =0 sigma = 1
mismatch temporal binary [2] =           1 seed = -834847021 media =0 sigma = 1
mismatch temporal binary [3] =          -2 seed = -2115364627 media =0 sigma = 1
mismatch temporal binary [4] =           0 seed = 597661442 media =0 sigma = 1
mismatch temporal binary [5] =           1 seed = 1118328367 media =0 sigma = 1
Iniciando tests...
Test 1: Estado apagado
clkout_therm_16 = z, clkoutb_therm_16 = z
Test 2: Estado encendido con atb_ena = 2'b00
jitter temporal therm [16] =           3 seed = 2049777229 media =0 sigma = 1
jitter temporal therm [15] =          -1 seed = 935010399 media =0 sigma = 1
jitter temporal therm [14] =           2 seed = 1923838383 media =0 sigma = 1
jitter temporal therm [13] =           1 seed = 1496260146 media =0 sigma = 1
jitter temporal therm [12] =          -1 seed = -1272287527 media =0 sigma = 1
jitter temporal therm [11] =          -1 seed = 1416363817 media =0 sigma = 1
jitter temporal therm [10] =           2 seed = -2031530373 media =0 sigma = 1
jitter temporal therm [9] =           1 seed = -1403276627 media =0 sigma = 1
jitter temporal therm [8] =           1 seed = -1739549836 media =0 sigma = 1
jitter temporal therm [7] =          -1 seed = 2045447604 media =0 sigma = 1
jitter temporal therm [6] =          -2 seed = 1995736582 media =0 sigma = 1
jitter temporal therm [5] =           2 seed = -1896957595 media =0 sigma = 1
jitter temporal therm [4] =           0 seed = 353525573 media =0 sigma = 1
jitter temporal therm [3] =           1 seed = -998158522 media =0 sigma = 1
jitter temporal therm [2] =           1 seed = 1266084719 media =0 sigma = 1
jitter temporal therm [1] =           2 seed = 2011445172 media =0 sigma = 1
jitter temporal therm [0] =           1 seed = 1972203375 media =0 sigma = 1
jitter temporal binary [5] =          -1 seed = -1212714505 media =0 sigma = 1
jitter temporal binary [4] =           0 seed = -368028907 media =0 sigma = 1
jitter temporal binary [3] =          -1 seed = -1215744032 media =0 sigma = 1
jitter temporal binary [2] =           2 seed = 1847150967 media =0 sigma = 1
jitter temporal binary [1] =           0 seed = -975207532 media =0 sigma = 1
jitter temporal binary [0] =           2 seed = -1936229351 media =0 sigma = 1
jitter temporal therm [16] =          -1 seed = -1436415112 media =0 sigma = 1
jitter temporal therm [15] =           1 seed = -1874447109 media =0 sigma = 1
jitter temporal therm [14] =           0 seed = -763523007 media =0 sigma = 1
jitter temporal therm [13] =           0 seed = -754151213 media =0 sigma = 1
jitter temporal therm [12] =           1 seed = -1719651703 media =0 sigma = 1
jitter temporal therm [11] =          -1 seed = -1200678172 media =0 sigma = 1
jitter temporal therm [10] =           0 seed = 597341381 media =0 sigma = 1
jitter temporal therm [9] =           2 seed = -2014232689 media =0 sigma = 1
jitter temporal therm [8] =           0 seed = -740442291 media =0 sigma = 1
jitter temporal therm [7] =           0 seed = 674421795 media =0 sigma = 1
jitter temporal therm [6] =           1 seed = -1769786601 media =0 sigma = 1
jitter temporal therm [5] =           0 seed = 695997315 media =0 sigma = 1
jitter temporal therm [4] =          -1 seed = 1193255873 media =0 sigma = 1
jitter temporal therm [3] =          -1 seed = 1704890268 media =0 sigma = 1
jitter temporal therm [2] =           0 seed = -1269007067 media =0 sigma = 1
jitter temporal therm [1] =          -1 seed = 1489986947 media =0 sigma = 1
jitter temporal therm [0] =          -1 seed = 963124721 media =0 sigma = 1
jitter temporal binary [5] =           3 seed = -2017864071 media =0 sigma = 1
jitter temporal binary [4] =           1 seed = -2014448939 media =0 sigma = 1
jitter temporal binary [3] =           0 seed = -594882701 media =0 sigma = 1
jitter temporal binary [2] =           0 seed = -573849585 media =0 sigma = 1
jitter temporal binary [1] =           1 seed = -1044220875 media =0 sigma = 1
jitter temporal binary [0] =          -1 seed = 893281516 media =0 sigma = 1
jitter temporal therm [16] =          -2 seed = 1922858290 media =0 sigma = 1
jitter temporal therm [15] =           0 seed = -1289579824 media =0 sigma = 1
jitter temporal therm [14] =          -1 seed = -1677414736 media =0 sigma = 1
jitter temporal therm [13] =          -1 seed = -1614576883 media =0 sigma = 1
jitter temporal therm [12] =           0 seed = 489536805 media =0 sigma = 1
jitter temporal therm [11] =           0 seed = -1075429631 media =0 sigma = 1
jitter temporal therm [10] =           1 seed = -1064964529 media =0 sigma = 1
jitter temporal therm [9] =          -2 seed = -2032981349 media =0 sigma = 1
jitter temporal therm [8] =           0 seed = -454792499 media =0 sigma = 1
jitter temporal therm [7] =           0 seed = -552251274 media =0 sigma = 1
jitter temporal therm [6] =          -1 seed = -1506131557 media =0 sigma = 1
jitter temporal therm [5] =           0 seed = -446306617 media =0 sigma = 1
jitter temporal therm [4] =           1 seed = 1885937421 media =0 sigma = 1
jitter temporal therm [3] =           0 seed = 270502865 media =0 sigma = 1
jitter temporal therm [2] =          -1 seed = 2024762619 media =0 sigma = 1
jitter temporal therm [1] =           1 seed = -1465744491 media =0 sigma = 1
jitter temporal therm [0] =           0 seed = 206066297 media =0 sigma = 1
jitter temporal binary [5] =           0 seed = -1042730236 media =0 sigma = 1
jitter temporal binary [4] =           1 seed = 1643194783 media =0 sigma = 1
jitter temporal binary [3] =           0 seed = -80164678 media =0 sigma = 1
jitter temporal binary [2] =           0 seed = -788635567 media =0 sigma = 1
jitter temporal binary [1] =           0 seed = 337675161 media =0 sigma = 1
jitter temporal binary [0] =          -2 seed = -1706008976 media =0 sigma = 1
atb1 = `wrealZState, atb0 = `wrealZState
Test 3: Estado encendido con atb_ena = 2'b01
jitter temporal therm [16] =           1 seed = -1502560086 media =0 sigma = 1
jitter temporal therm [15] =          -1 seed = 1599327234 media =0 sigma = 1
jitter temporal therm [14] =           0 seed = 561584596 media =0 sigma = 1
jitter temporal therm [13] =           0 seed = 1028882996 media =0 sigma = 1
jitter temporal therm [12] =           2 seed = -1965897994 media =0 sigma = 1
jitter temporal therm [11] =           0 seed = -462110982 media =0 sigma = 1
jitter temporal therm [10] =           1 seed = 1700388460 media =0 sigma = 1
jitter temporal therm [9] =           0 seed = 216404676 media =0 sigma = 1
jitter temporal therm [8] =          -2 seed = -1639543735 media =0 sigma = 1
jitter temporal therm [7] =          -1 seed = -1780221592 media =0 sigma = 1
jitter temporal therm [6] =           0 seed = 385938655 media =0 sigma = 1
jitter temporal therm [5] =           0 seed = 575221335 media =0 sigma = 1
jitter temporal therm [4] =           0 seed = -1081957840 media =0 sigma = 1
jitter temporal therm [3] =           1 seed = 729235816 media =0 sigma = 1
jitter temporal therm [2] =           0 seed = -428715953 media =0 sigma = 1
jitter temporal therm [1] =           0 seed = 1182115443 media =0 sigma = 1
jitter temporal therm [0] =           0 seed = -659000156 media =0 sigma = 1
jitter temporal binary [5] =           1 seed = 1442506570 media =0 sigma = 1
jitter temporal binary [4] =           0 seed = -1573261465 media =0 sigma = 1
jitter temporal binary [3] =          -1 seed = 1866379282 media =0 sigma = 1
jitter temporal binary [2] =           0 seed = -725483043 media =0 sigma = 1
jitter temporal binary [1] =           0 seed = 561116553 media =0 sigma = 1
jitter temporal binary [0] =           1 seed = -895105276 media =0 sigma = 1
jitter temporal therm [16] =           1 seed = -1551674534 media =0 sigma = 1
jitter temporal therm [15] =           0 seed = -1237179887 media =0 sigma = 1
jitter temporal therm [14] =           0 seed = 1062503358 media =0 sigma = 1
jitter temporal therm [13] =          -1 seed = -912330566 media =0 sigma = 1
jitter temporal therm [12] =           0 seed = 197027431 media =0 sigma = 1
jitter temporal therm [11] =           0 seed = 856222717 media =0 sigma = 1
jitter temporal therm [10] =           0 seed = 1347268557 media =0 sigma = 1
jitter temporal therm [9] =           1 seed = -855600481 media =0 sigma = 1
jitter temporal therm [8] =           3 seed = 2061229439 media =0 sigma = 1
jitter temporal therm [7] =          -1 seed = 804749055 media =0 sigma = 1
jitter temporal therm [6] =           1 seed = 1307178467 media =0 sigma = 1
jitter temporal therm [5] =          -1 seed = 869409863 media =0 sigma = 1
jitter temporal therm [4] =           0 seed = 1581684091 media =0 sigma = 1
jitter temporal therm [3] =           0 seed = -1285139383 media =0 sigma = 1
jitter temporal therm [2] =           1 seed = -1708339486 media =0 sigma = 1
jitter temporal therm [1] =          -1 seed = -1317080911 media =0 sigma = 1
jitter temporal therm [0] =           1 seed = -1365286578 media =0 sigma = 1
jitter temporal binary [5] =           0 seed = 2073370409 media =0 sigma = 1
jitter temporal binary [4] =           0 seed = -1460241779 media =0 sigma = 1
jitter temporal binary [3] =           1 seed = 1889597655 media =0 sigma = 1
jitter temporal binary [2] =           2 seed = -1948518676 media =0 sigma = 1
jitter temporal binary [1] =           1 seed = -1251975098 media =0 sigma = 1
jitter temporal binary [0] =           0 seed = -356364678 media =0 sigma = 1
jitter temporal therm [16] =          -1 seed = -1045176377 media =0 sigma = 1
jitter temporal therm [15] =          -1 seed = -1365545722 media =0 sigma = 1
jitter temporal therm [14] =          -1 seed = 1744138070 media =0 sigma = 1
jitter temporal therm [13] =           0 seed = 818307938 media =0 sigma = 1
jitter temporal therm [12] =           0 seed = -687579921 media =0 sigma = 1
jitter temporal therm [11] =           0 seed = -726502641 media =0 sigma = 1
jitter temporal therm [10] =          -1 seed = -1644667596 media =0 sigma = 1
jitter temporal therm [9] =           0 seed = 1033746011 media =0 sigma = 1
jitter temporal therm [8] =           0 seed = 782008663 media =0 sigma = 1
jitter temporal therm [7] =          -1 seed = -1650252381 media =0 sigma = 1
jitter temporal therm [6] =          -1 seed = -1777088797 media =0 sigma = 1
jitter temporal therm [5] =           0 seed = 706122662 media =0 sigma = 1
jitter temporal therm [4] =           0 seed = -347537518 media =0 sigma = 1
jitter temporal therm [3] =           1 seed = -857782454 media =0 sigma = 1
jitter temporal therm [2] =           0 seed = -700326962 media =0 sigma = 1
jitter temporal therm [1] =          -1 seed = -1278570661 media =0 sigma = 1
jitter temporal therm [0] =          -1 seed = -1487412696 media =0 sigma = 1
jitter temporal binary [5] =           0 seed = -874205179 media =0 sigma = 1
jitter temporal binary [4] =           1 seed = -1560411889 media =0 sigma = 1
jitter temporal binary [3] =           0 seed = -560097216 media =0 sigma = 1
jitter temporal binary [2] =           3 seed = -2135398629 media =0 sigma = 1
jitter temporal binary [1] =           0 seed = -722627719 media =0 sigma = 1
jitter temporal binary [0] =          -1 seed = -1282210734 media =0 sigma = 1
atb1 = 0.80, atb0 = 0.00
Test 4: Estado encendido con atb_ena = 2'b10
jitter temporal therm [16] =          -2 seed = 1862177269 media =0 sigma = 1
jitter temporal therm [15] =           1 seed = 1981849899 media =0 sigma = 1
jitter temporal therm [14] =           0 seed = -258961008 media =0 sigma = 1
jitter temporal therm [13] =           0 seed = 940932660 media =0 sigma = 1
jitter temporal therm [12] =           0 seed = 558717032 media =0 sigma = 1
jitter temporal therm [11] =          -1 seed = 2075513610 media =0 sigma = 1
jitter temporal therm [10] =           1 seed = -1956955171 media =0 sigma = 1
jitter temporal therm [9] =          -1 seed = -1221888994 media =0 sigma = 1
jitter temporal therm [8] =           1 seed = -1507462127 media =0 sigma = 1
jitter temporal therm [7] =           1 seed = -1368156442 media =0 sigma = 1
jitter temporal therm [6] =           0 seed = 544733055 media =0 sigma = 1
jitter temporal therm [5] =          -1 seed = 1369305331 media =0 sigma = 1
jitter temporal therm [4] =          -1 seed = 1202813519 media =0 sigma = 1
jitter temporal therm [3] =           0 seed = -1935591895 media =0 sigma = 1
jitter temporal therm [2] =          -1 seed = 2078840305 media =0 sigma = 1
jitter temporal therm [1] =           1 seed = -782006071 media =0 sigma = 1
jitter temporal therm [0] =           0 seed = 288041535 media =0 sigma = 1
jitter temporal binary [5] =           1 seed = 1129002742 media =0 sigma = 1
jitter temporal binary [4] =           1 seed = 1312344691 media =0 sigma = 1
jitter temporal binary [3] =           1 seed = -1508475072 media =0 sigma = 1
jitter temporal binary [2] =           0 seed = 682407796 media =0 sigma = 1
jitter temporal binary [1] =           1 seed = 1374705584 media =0 sigma = 1
jitter temporal binary [0] =           0 seed = -203221725 media =0 sigma = 1
jitter temporal therm [16] =           0 seed = -441849978 media =0 sigma = 1
jitter temporal therm [15] =          -1 seed = -2082501854 media =0 sigma = 1
jitter temporal therm [14] =          -1 seed = -1666728030 media =0 sigma = 1
jitter temporal therm [13] =           0 seed = 746123444 media =0 sigma = 1
jitter temporal therm [12] =           1 seed = -1348255718 media =0 sigma = 1
jitter temporal therm [11] =           0 seed = -753322854 media =0 sigma = 1
jitter temporal therm [10] =           1 seed = 1873573613 media =0 sigma = 1
jitter temporal therm [9] =          -2 seed = 1683922620 media =0 sigma = 1
jitter temporal therm [8] =           1 seed = 1486249360 media =0 sigma = 1
jitter temporal therm [7] =           0 seed = -78712795 media =0 sigma = 1
jitter temporal therm [6] =           0 seed = 599416644 media =0 sigma = 1
jitter temporal therm [5] =           2 seed = 1877679010 media =0 sigma = 1
jitter temporal therm [4] =           1 seed = 1061116333 media =0 sigma = 1
jitter temporal therm [3] =           1 seed = -1451224288 media =0 sigma = 1
jitter temporal therm [2] =           0 seed = 243133933 media =0 sigma = 1
jitter temporal therm [1] =           3 seed = -2080267448 media =0 sigma = 1
jitter temporal therm [0] =           0 seed = 672166349 media =0 sigma = 1
jitter temporal binary [5] =           1 seed = -924598952 media =0 sigma = 1
jitter temporal binary [4] =          -1 seed = -1454857086 media =0 sigma = 1
jitter temporal binary [3] =           0 seed = -658194028 media =0 sigma = 1
jitter temporal binary [2] =          -1 seed = 1952983772 media =0 sigma = 1
jitter temporal binary [1] =          -1 seed = 1074013098 media =0 sigma = 1
jitter temporal binary [0] =          -1 seed = -1011796968 media =0 sigma = 1
jitter temporal therm [16] =           1 seed = 1407994458 media =0 sigma = 1
jitter temporal therm [15] =           1 seed = 1623165109 media =0 sigma = 1
jitter temporal therm [14] =           0 seed = 179261435 media =0 sigma = 1
jitter temporal therm [13] =           1 seed = 1380918058 media =0 sigma = 1
jitter temporal therm [12] =           1 seed = -1035133533 media =0 sigma = 1
jitter temporal therm [11] =           0 seed = -353397495 media =0 sigma = 1
jitter temporal therm [10] =           0 seed = 151541371 media =0 sigma = 1
jitter temporal therm [9] =          -1 seed = -1355526763 media =0 sigma = 1
jitter temporal therm [8] =           2 seed = 1916719327 media =0 sigma = 1
jitter temporal therm [7] =          -1 seed = -1203684726 media =0 sigma = 1
jitter temporal therm [6] =          -1 seed = 761237869 media =0 sigma = 1
jitter temporal therm [5] =           1 seed = 1544120784 media =0 sigma = 1
jitter temporal therm [4] =          -1 seed = -1143576907 media =0 sigma = 1
jitter temporal therm [3] =          -1 seed = -1530466659 media =0 sigma = 1
jitter temporal therm [2] =           3 seed = -2137546370 media =0 sigma = 1
jitter temporal therm [1] =           0 seed = 1053703198 media =0 sigma = 1
jitter temporal therm [0] =           0 seed = 866670451 media =0 sigma = 1
jitter temporal binary [5] =           1 seed = -1120129223 media =0 sigma = 1
jitter temporal binary [4] =           1 seed = -1919344207 media =0 sigma = 1
jitter temporal binary [3] =           0 seed = 821163831 media =0 sigma = 1
jitter temporal binary [2] =          -1 seed = -1573167411 media =0 sigma = 1
jitter temporal binary [1] =           0 seed = 816890204 media =0 sigma = 1
jitter temporal binary [0] =           0 seed = -679552438 media =0 sigma = 1
atb1 = 0.80, atb0 = 0.00
Test 5: Estado encendido con atb_ena = 2'b11
jitter temporal therm [16] =          -1 seed = 2053518592 media =0 sigma = 1
jitter temporal therm [15] =           0 seed = -199505360 media =0 sigma = 1
jitter temporal therm [14] =           1 seed = 1963349069 media =0 sigma = 1
jitter temporal therm [13] =           0 seed = 1352996267 media =0 sigma = 1
jitter temporal therm [12] =           0 seed = -77702682 media =0 sigma = 1
jitter temporal therm [11] =           1 seed = -1042316493 media =0 sigma = 1
jitter temporal therm [10] =           0 seed = 440137923 media =0 sigma = 1
jitter temporal therm [9] =          -1 seed = -1473664576 media =0 sigma = 1
jitter temporal therm [8] =           2 seed = 1671761748 media =0 sigma = 1
jitter temporal therm [7] =           0 seed = 28507196 media =0 sigma = 1
jitter temporal therm [6] =          -1 seed = 2048868447 media =0 sigma = 1
jitter temporal therm [5] =           0 seed = -565813006 media =0 sigma = 1
jitter temporal therm [4] =          -1 seed = -1232930847 media =0 sigma = 1
jitter temporal therm [3] =           0 seed = -1080412536 media =0 sigma = 1
jitter temporal therm [2] =           1 seed = 1596878273 media =0 sigma = 1
jitter temporal therm [1] =          -2 seed = 2080786086 media =0 sigma = 1
jitter temporal therm [0] =           0 seed = -179821782 media =0 sigma = 1
jitter temporal binary [5] =           0 seed = 599131402 media =0 sigma = 1
jitter temporal binary [4] =           0 seed = 398762811 media =0 sigma = 1
jitter temporal binary [3] =          -1 seed = -1223356912 media =0 sigma = 1
jitter temporal binary [2] =           1 seed = -944695426 media =0 sigma = 1
jitter temporal binary [1] =           1 seed = 1926564135 media =0 sigma = 1
jitter temporal binary [0] =           0 seed = -681458353 media =0 sigma = 1
jitter temporal therm [16] =          -1 seed = 840925265 media =0 sigma = 1
jitter temporal therm [15] =          -1 seed = -2027952962 media =0 sigma = 1
jitter temporal therm [14] =          -1 seed = 1167703514 media =0 sigma = 1
jitter temporal therm [13] =           0 seed = -687628368 media =0 sigma = 1
jitter temporal therm [12] =          -1 seed = -1784800705 media =0 sigma = 1
jitter temporal therm [11] =           1 seed = 740261033 media =0 sigma = 1
jitter temporal therm [10] =           0 seed = -622587798 media =0 sigma = 1
jitter temporal therm [9] =           0 seed = -681276787 media =0 sigma = 1
jitter temporal therm [8] =          -2 seed = -1789951995 media =0 sigma = 1
jitter temporal therm [7] =           1 seed = 1102622822 media =0 sigma = 1
jitter temporal therm [6] =          -1 seed = 1526144764 media =0 sigma = 1
jitter temporal therm [5] =           1 seed = 846520583 media =0 sigma = 1
jitter temporal therm [4] =          -1 seed = 1323866616 media =0 sigma = 1
jitter temporal therm [3] =           0 seed = 343452618 media =0 sigma = 1
jitter temporal therm [2] =           1 seed = -1491900293 media =0 sigma = 1
jitter temporal therm [1] =          -1 seed = -1320914657 media =0 sigma = 1
jitter temporal therm [0] =          -1 seed = -904785233 media =0 sigma = 1
jitter temporal binary [5] =          -1 seed = -1274801573 media =0 sigma = 1
jitter temporal binary [4] =           0 seed = 1336183106 media =0 sigma = 1
jitter temporal binary [3] =          -1 seed = 1569009182 media =0 sigma = 1
jitter temporal binary [2] =           0 seed = 1611579224 media =0 sigma = 1
jitter temporal binary [1] =           2 seed = 2093854179 media =0 sigma = 1
jitter temporal binary [0] =           0 seed = 43480175 media =0 sigma = 1
jitter temporal therm [16] =           1 seed = 1581061668 media =0 sigma = 1
jitter temporal therm [15] =          -1 seed = 1299549942 media =0 sigma = 1
jitter temporal therm [14] =           0 seed = -1574025877 media =0 sigma = 1
jitter temporal therm [13] =           1 seed = -1654828354 media =0 sigma = 1
jitter temporal therm [12] =           0 seed = -1113012195 media =0 sigma = 1
jitter temporal therm [11] =          -1 seed = -1203231203 media =0 sigma = 1
jitter temporal therm [10] =           1 seed = 2070427240 media =0 sigma = 1
jitter temporal therm [9] =           1 seed = 1899657485 media =0 sigma = 1
jitter temporal therm [8] =           1 seed = -1743916092 media =0 sigma = 1
jitter temporal therm [7] =           1 seed = 1598056150 media =0 sigma = 1
jitter temporal therm [6] =           1 seed = 1715777649 media =0 sigma = 1
jitter temporal therm [5] =           1 seed = -1343538797 media =0 sigma = 1
jitter temporal therm [4] =           0 seed = -407472576 media =0 sigma = 1
jitter temporal therm [3] =           1 seed = -809161324 media =0 sigma = 1
jitter temporal therm [2] =          -2 seed = -1867864040 media =0 sigma = 1
jitter temporal therm [1] =           0 seed = -303715725 media =0 sigma = 1
jitter temporal therm [0] =          -1 seed = -1021844634 media =0 sigma = 1
jitter temporal binary [5] =           0 seed = 470738693 media =0 sigma = 1
jitter temporal binary [4] =           2 seed = -1891857054 media =0 sigma = 1
jitter temporal binary [3] =           0 seed = 136555296 media =0 sigma = 1
jitter temporal binary [2] =           1 seed = 1615964373 media =0 sigma = 1
jitter temporal binary [1] =          -1 seed = -1861272647 media =0 sigma = 1
jitter temporal binary [0] =           0 seed = -647458898 media =0 sigma = 1
jitter temporal therm [16] =           0 seed = -261789627 media =0 sigma = 1
jitter temporal therm [15] =          -1 seed = -2089520284 media =0 sigma = 1
jitter temporal therm [14] =           0 seed = 613274758 media =0 sigma = 1
jitter temporal therm [13] =           0 seed = 169527191 media =0 sigma = 1
jitter temporal therm [12] =           0 seed = -706522125 media =0 sigma = 1
jitter temporal therm [11] =           1 seed = -813424435 media =0 sigma = 1
jitter temporal therm [10] =          -1 seed = 1409606389 media =0 sigma = 1
jitter temporal therm [9] =           1 seed = -1095073982 media =0 sigma = 1
jitter temporal therm [8] =           2 seed = 1999182810 media =0 sigma = 1
jitter temporal therm [7] =           1 seed = -1117505490 media =0 sigma = 1
jitter temporal therm [6] =           1 seed = -1305477130 media =0 sigma = 1
jitter temporal therm [5] =          -1 seed = 2006205211 media =0 sigma = 1
jitter temporal therm [4] =          -1 seed = 1349797218 media =0 sigma = 1
jitter temporal therm [3] =           0 seed = -1581676011 media =0 sigma = 1
jitter temporal therm [2] =          -2 seed = -1938925649 media =0 sigma = 1
jitter temporal therm [1] =          -1 seed = -1483982839 media =0 sigma = 1
jitter temporal therm [0] =           1 seed = -1903588700 media =0 sigma = 1
jitter temporal binary [5] =           0 seed = 110473068 media =0 sigma = 1
jitter temporal binary [4] =          -1 seed = 1476929196 media =0 sigma = 1
jitter temporal binary [3] =          -2 seed = -2047236145 media =0 sigma = 1
jitter temporal binary [2] =          -1 seed = 2069461347 media =0 sigma = 1
jitter temporal binary [1] =          -1 seed = 1613747141 media =0 sigma = 1
jitter temporal binary [0] =           1 seed = 1549148611 media =0 sigma = 1
jitter temporal therm [16] =           0 seed = 563173658 media =0 sigma = 1
jitter temporal therm [15] =          -1 seed = -2107297087 media =0 sigma = 1
jitter temporal therm [14] =          -2 seed = -1675605142 media =0 sigma = 1
jitter temporal therm [13] =          -2 seed = 1905869481 media =0 sigma = 1
jitter temporal therm [12] =           0 seed = -720091792 media =0 sigma = 1
jitter temporal therm [11] =           1 seed = 900933370 media =0 sigma = 1
jitter temporal therm [10] =           2 seed = -2081466345 media =0 sigma = 1
jitter temporal therm [9] =           1 seed = -1232943982 media =0 sigma = 1
jitter temporal therm [8] =           0 seed = 1719911479 media =0 sigma = 1
jitter temporal therm [7] =           1 seed = -1206317006 media =0 sigma = 1
jitter temporal therm [6] =           1 seed = 1023791235 media =0 sigma = 1
jitter temporal therm [5] =          -1 seed = -1223272261 media =0 sigma = 1
jitter temporal therm [4] =           1 seed = -835216834 media =0 sigma = 1
jitter temporal therm [3] =           0 seed = -311815840 media =0 sigma = 1
jitter temporal therm [2] =           2 seed = -1969940017 media =0 sigma = 1
jitter temporal therm [1] =           1 seed = -1953495990 media =0 sigma = 1
jitter temporal therm [0] =           1 seed = -1924344569 media =0 sigma = 1
jitter temporal binary [5] =           1 seed = -1149344495 media =0 sigma = 1
jitter temporal binary [4] =           1 seed = 1086836525 media =0 sigma = 1
jitter temporal binary [3] =          -1 seed = 1147602193 media =0 sigma = 1
jitter temporal binary [2] =           0 seed = -324159891 media =0 sigma = 1
jitter temporal binary [1] =           0 seed = 962349220 media =0 sigma = 1
jitter temporal binary [0] =           0 seed = -1200312914 media =0 sigma = 1
jitter temporal therm [16] =           1 seed = -1428426481 media =0 sigma = 1
jitter temporal therm [15] =           0 seed = -357056916 media =0 sigma = 1
jitter temporal therm [14] =          -1 seed = 916421742 media =0 sigma = 1
jitter temporal therm [13] =           0 seed = -465408782 media =0 sigma = 1
jitter temporal therm [12] =           1 seed = -1841826999 media =0 sigma = 1
jitter temporal therm [11] =          -1 seed = 2040892655 media =0 sigma = 1
jitter temporal therm [10] =           0 seed = -400142995 media =0 sigma = 1
jitter temporal therm [9] =           0 seed = -2092660859 media =0 sigma = 1
jitter temporal therm [8] =           1 seed = 1963773292 media =0 sigma = 1
jitter temporal therm [7] =           0 seed = -423921075 media =0 sigma = 1
jitter temporal therm [6] =           0 seed = -857727316 media =0 sigma = 1
jitter temporal therm [5] =           1 seed = -1651737742 media =0 sigma = 1
jitter temporal therm [4] =          -1 seed = -1235409419 media =0 sigma = 1
jitter temporal therm [3] =          -1 seed = -1762000793 media =0 sigma = 1
jitter temporal therm [2] =           1 seed = 2097820057 media =0 sigma = 1
jitter temporal therm [1] =          -1 seed = -1077736531 media =0 sigma = 1
jitter temporal therm [0] =           2 seed = 1930480839 media =0 sigma = 1
jitter temporal binary [5] =           1 seed = -2106873093 media =0 sigma = 1
jitter temporal binary [4] =           0 seed = -711532308 media =0 sigma = 1
jitter temporal binary [3] =           0 seed = -689766905 media =0 sigma = 1
jitter temporal binary [2] =           0 seed = 593069943 media =0 sigma = 1
jitter temporal binary [1] =           0 seed = 301166469 media =0 sigma = 1
jitter temporal binary [0] =          -1 seed = -1378372011 media =0 sigma = 1
jitter temporal therm [16] =          -1 seed = -1240410693 media =0 sigma = 1
jitter temporal therm [15] =           1 seed = 1095868011 media =0 sigma = 1
jitter temporal therm [14] =           0 seed = 728211396 media =0 sigma = 1
jitter temporal therm [13] =           0 seed = -378987700 media =0 sigma = 1
jitter temporal therm [12] =          -1 seed = 1027259729 media =0 sigma = 1
jitter temporal therm [11] =           0 seed = -132686291 media =0 sigma = 1
jitter temporal therm [10] =           0 seed = 440949495 media =0 sigma = 1
jitter temporal therm [9] =           0 seed = -734577954 media =0 sigma = 1
jitter temporal therm [8] =           1 seed = 1412985034 media =0 sigma = 1
jitter temporal therm [7] =          -2 seed = 1920199027 media =0 sigma = 1
jitter temporal therm [6] =           0 seed = 897519056 media =0 sigma = 1
jitter temporal therm [5] =           0 seed = 682125074 media =0 sigma = 1
jitter temporal therm [4] =          -1 seed = 1140774831 media =0 sigma = 1
jitter temporal therm [3] =          -1 seed = -1687222554 media =0 sigma = 1
jitter temporal therm [2] =           0 seed = 717002343 media =0 sigma = 1
jitter temporal therm [1] =           0 seed = 1116482676 media =0 sigma = 1
jitter temporal therm [0] =           0 seed = -756272301 media =0 sigma = 1
jitter temporal binary [5] =           0 seed = -2137319895 media =0 sigma = 1
jitter temporal binary [4] =          -1 seed = 928846722 media =0 sigma = 1
jitter temporal binary [3] =           1 seed = -800970993 media =0 sigma = 1
jitter temporal binary [2] =          -2 seed = -1860453754 media =0 sigma = 1
jitter temporal binary [1] =           1 seed = 1124232390 media =0 sigma = 1
jitter temporal binary [0] =           0 seed = 668694621 media =0 sigma = 1
jitter temporal therm [16] =           0 seed = 352561249 media =0 sigma = 1
jitter temporal therm [15] =           0 seed = 339530857 media =0 sigma = 1
jitter temporal therm [14] =          -1 seed = -1715288096 media =0 sigma = 1
jitter temporal therm [13] =           0 seed = -144602643 media =0 sigma = 1
jitter temporal therm [12] =           1 seed = 806549836 media =0 sigma = 1
jitter temporal therm [11] =          -2 seed = -1959479192 media =0 sigma = 1
jitter temporal therm [10] =           0 seed = -1785300275 media =0 sigma = 1
jitter temporal therm [9] =          -2 seed = -1760339399 media =0 sigma = 1
jitter temporal therm [8] =           0 seed = -741559499 media =0 sigma = 1
jitter temporal therm [7] =           1 seed = -1191344393 media =0 sigma = 1
jitter temporal therm [6] =           1 seed = -1696883387 media =0 sigma = 1
jitter temporal therm [5] =          -1 seed = 1591974071 media =0 sigma = 1
jitter temporal therm [4] =           1 seed = -1194614902 media =0 sigma = 1
jitter temporal therm [3] =           2 seed = 1847194545 media =0 sigma = 1
jitter temporal therm [2] =          -1 seed = 1179112069 media =0 sigma = 1
jitter temporal therm [1] =          -2 seed = -1681705412 media =0 sigma = 1
jitter temporal therm [0] =          -1 seed = -1887546480 media =0 sigma = 1
jitter temporal binary [5] =           0 seed = 487378835 media =0 sigma = 1
jitter temporal binary [4] =           0 seed = -479352988 media =0 sigma = 1
jitter temporal binary [3] =          -1 seed = 1774187014 media =0 sigma = 1
jitter temporal binary [2] =           1 seed = 1465220416 media =0 sigma = 1
jitter temporal binary [1] =           0 seed = -2037299594 media =0 sigma = 1
jitter temporal binary [0] =           0 seed = 195346566 media =0 sigma = 1
jitter temporal therm [16] =           0 seed = -830150362 media =0 sigma = 1
jitter temporal therm [15] =           1 seed = 1415571267 media =0 sigma = 1
jitter temporal therm [14] =          -1 seed = -1738309377 media =0 sigma = 1
jitter temporal therm [13] =          -1 seed = 1728090883 media =0 sigma = 1
jitter temporal therm [12] =          -1 seed = -1548267322 media =0 sigma = 1
jitter temporal therm [11] =           1 seed = -1431812945 media =0 sigma = 1
jitter temporal therm [10] =          -1 seed = 1144319528 media =0 sigma = 1
jitter temporal therm [9] =           2 seed = 1639879656 media =0 sigma = 1
jitter temporal therm [8] =          -1 seed = -1973410005 media =0 sigma = 1
jitter temporal therm [7] =           1 seed = -1627600665 media =0 sigma = 1
jitter temporal therm [6] =           1 seed = -2112827592 media =0 sigma = 1
jitter temporal therm [5] =           0 seed = 776783663 media =0 sigma = 1
jitter temporal therm [4] =          -1 seed = -1728680053 media =0 sigma = 1
jitter temporal therm [3] =           0 seed = 823068563 media =0 sigma = 1
jitter temporal therm [2] =           1 seed = -2101981131 media =0 sigma = 1
jitter temporal therm [1] =          -1 seed = 897330670 media =0 sigma = 1
jitter temporal therm [0] =           0 seed = 545630748 media =0 sigma = 1
jitter temporal binary [5] =           0 seed = -523493050 media =0 sigma = 1
jitter temporal binary [4] =          -2 seed = -1753355345 media =0 sigma = 1
jitter temporal binary [3] =          -1 seed = 1862331021 media =0 sigma = 1
jitter temporal binary [2] =          -1 seed = -1020771887 media =0 sigma = 1
jitter temporal binary [1] =           1 seed = -1607183064 media =0 sigma = 1
jitter temporal binary [0] =          -1 seed = -1385591905 media =0 sigma = 1
jitter temporal therm [16] =           2 seed = -1987733022 media =0 sigma = 1
jitter temporal therm [15] =          -1 seed = 1278177537 media =0 sigma = 1
jitter temporal therm [14] =           0 seed = 480207795 media =0 sigma = 1
jitter temporal therm [13] =           1 seed = -1430948777 media =0 sigma = 1
jitter temporal therm [12] =           1 seed = 1820481375 media =0 sigma = 1
jitter temporal therm [11] =           0 seed = -1019626109 media =0 sigma = 1
jitter temporal therm [10] =           0 seed = -216502384 media =0 sigma = 1
jitter temporal therm [9] =           0 seed = 1046625103 media =0 sigma = 1
jitter temporal therm [8] =           1 seed = 1221162901 media =0 sigma = 1
jitter temporal therm [7] =           0 seed = -364184633 media =0 sigma = 1
jitter temporal therm [6] =           1 seed = -1581244077 media =0 sigma = 1
jitter temporal therm [5] =           2 seed = -1931672604 media =0 sigma = 1
jitter temporal therm [4] =           1 seed = -1625138908 media =0 sigma = 1
jitter temporal therm [3] =           0 seed = -1344873811 media =0 sigma = 1
jitter temporal therm [2] =           0 seed = -1303771705 media =0 sigma = 1
jitter temporal therm [1] =           0 seed = -836056249 media =0 sigma = 1
jitter temporal therm [0] =           0 seed = -555596250 media =0 sigma = 1
jitter temporal binary [5] =           1 seed = -1252704565 media =0 sigma = 1
jitter temporal binary [4] =          -1 seed = -1762369504 media =0 sigma = 1
jitter temporal binary [3] =           1 seed = -1177047803 media =0 sigma = 1
jitter temporal binary [2] =           0 seed = -399331116 media =0 sigma = 1
jitter temporal binary [1] =          -1 seed = -1004036840 media =0 sigma = 1
jitter temporal binary [0] =          -1 seed = -811131751 media =0 sigma = 1
atb1 = 0.00, atb0 = 0.00
Tests completados.
Simulation complete via $finish(1) at time 2200 PS + 0
./tb/clock_distribution_tb.sv:144         $finish;
xcelium> ^C
xcelium> exit
TOOL:	xrun(64)	24.03-s004: Exiting on Feb 09, 2026 at 12:54:42 CET  (total: 00:28:17)
