xrun(64): 24.03-s004: (c) Copyright 1995-2024 Cadence Design Systems, Inc.
TOOL:	xrun(64)	24.03-s004: Started on Feb 11, 2026 at 12:31:53 CET
xrun
	-f xrun.f
		-clean
		./models/local_bias.sv
		./tb/local_bias_tb.sv
		-access +rw
		-gui
		-s
		-input /home/msegper/Documents/TFM/local_bias/restore.tcl
xrun: *N,CLEAN: Removing existing directory ./xcelium.d.
file: ./models/local_bias.sv
	module worklib.local_bias:sv
		errors: 0, warnings: 0
file: ./tb/local_bias_tb.sv
	module worklib.local_bias_tb:sv
		errors: 0, warnings: 0
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
	Top level design units:
		cds_rnm_pkg
		local_bias_tb
	Building instance overlay tables: .................... Done
	Using implicit TMP libraries; associated with library worklib
	Generating native compiled code:
		worklib.local_bias:sv <0x7b8214a7>
			streams:   7, words: 14879
		worklib.local_bias_tb:sv <0x0377a1c0>
			streams:  14, words: 21089
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                 Instances  Unique
		Modules:                 2       2
		Verilog packages:        1       1
		Registers:              29      29
		Scalar wires:           11       -
		Vectored wires:          1       -
		Always blocks:           4       4
		Initial blocks:          5       5
		Pseudo assignments:     12       -
		Assertions:              3       3
		Simulation timescale:  1ps
	Writing initial simulation snapshot: worklib.local_bias_tb:sv
xmsim: *W,NOMTDGUI: Multi-Threaded Dumping is disabled for interactive debug mode.
[DMSINFO] Simulating with Xcelium Mixed-Signal App...

-------------------------------------
Relinquished control to SimVision...
xcelium> 
xcelium> source /eda/cadence/2024-25/RHELx86/XCELIUM_24.03.004/tools/xcelium/files/xmsimrc
xcelium> 
xcelium> # XM-Sim Command File
xcelium> # TOOL:	xmsim(64)	24.03-s004
xcelium> #
xcelium> #
xcelium> # You can restore this configuration with:
xcelium> #
xcelium> #      xrun -f xrun.f -input restore.tcl
xcelium> #
xcelium> 
xcelium> set tcl_prompt1 {puts -nonewline "xcelium> "}
puts -nonewline "xcelium> "
xcelium> set tcl_prompt2 {puts -nonewline "> "}
puts -nonewline "> "
xcelium> set vlog_format %h
%h
xcelium> set vhdl_format %v
%v
xcelium> set real_precision 6
6
xcelium> set display_unit auto
auto
xcelium> set time_unit module
module
xcelium> set heap_garbage_size -200
-200
xcelium> set heap_garbage_time 0
0
xcelium> set assert_report_level note
note
xcelium> set assert_stop_level error
error
xcelium> set autoscope yes
yes
xcelium> set assert_1164_warnings yes
yes
xcelium> set pack_assert_off {}
xcelium> set severity_pack_assert_off {note warning}
note warning
xcelium> set assert_output_stop_level failed
failed
xcelium> set tcl_debug_level 0
0
xcelium> set relax_path_name 1
1
xcelium> set vhdl_vcdmap XX01ZX01X
XX01ZX01X
xcelium> set intovf_severity_level ERROR
ERROR
xcelium> set probe_screen_format 0
0
xcelium> set rangecnst_severity_level ERROR
ERROR
xcelium> set textio_severity_level ERROR
ERROR
xcelium> set vital_timing_checks_on 1
1
xcelium> set vlog_code_show_force 0
0
xcelium> set assert_count_attempts 1
1
xcelium> set tcl_all64 false
false
xcelium> set tcl_runerror_exit false
false
xcelium> set assert_report_incompletes 0
0
xcelium> set show_force 1
1
xcelium> set force_reset_by_reinvoke 0
0
xcelium> set tcl_relaxed_literal 0
0
xcelium> set probe_exclude_patterns {}
xcelium> set probe_packed_limit 4k
4k
xcelium> set probe_unpacked_limit 16k
16k
xcelium> set assert_internal_msg no
no
xcelium> set svseed 1
1
xcelium> set assert_reporting_mode 0
0
xcelium> set vcd_compact_mode 0
0
xcelium> set vhdl_forgen_loopindex_enum_pos 0
0
xcelium> set xmreplay_dc_debug 0
0
xcelium> set tcl_runcmd_interrupt next_command
next_command
xcelium> set tcl_sigval_prefix {#}
#
xcelium> alias . run
xcelium> alias indago verisium
xcelium> alias quit exit
xcelium> database -open -shm -into waves.shm waves -default
Created default SHM database waves
xcelium> probe -create -database waves local_bias_tb.dut.atb0 local_bias_tb.dut.atb1 local_bias_tb.dut.atb_ena local_bias_tb.dut.iclkdist_25ua local_bias_tb.dut.icurrentsource_500ua local_bias_tb.dut.icurrentsterring_500ua local_bias_tb.dut.pdb local_bias_tb.dut.vddana_0p8 local_bias_tb.dut.vddana_1p8 local_bias_tb.dut.vssana
Created probe 1
xcelium> probe -create -database waves local_bias_tb.dut.isyncflip_flop_25ua
Created probe 2
xcelium> 
xcelium> simvision -input restore.tcl.svcf
xcelium> run
Test 1: Barrido de entradas con checkers
Barrido de vddana_1p8:
xmsim: *W,ASRTST (./models/local_bias.sv,41): (time 0 FS) Assertion local_bias_tb.dut.vddana_1p8_boundaries has failed
Input voltge vddana_1p8 is out of bounds: 1.70 V
xmsim: *W,WARSEV (./models/local_bias.sv,63): (time 0 FS).
local_bias_tb.dut
Input signals boundaries are not correct: vddana_1p8_check=0, vddana_0p8_check=1, vssana_check=1,
xmsim: *W,WARSEV (./models/local_bias.sv,63): (time 0 FS).
local_bias_tb.dut
Input signals boundaries are not correct: vddana_1p8_check=0, vddana_0p8_check=1, vssana_check=1,
xmsim: *W,ASRTST (./models/local_bias.sv,41): (time 20 NS) Assertion local_bias_tb.dut.vddana_1p8_boundaries has failed
Input voltge vddana_1p8 is out of bounds: 1.90 V
xmsim: *W,WARSEV (./models/local_bias.sv,63): (time 20 NS).
local_bias_tb.dut
Input signals boundaries are not correct: vddana_1p8_check=0, vddana_0p8_check=1, vssana_check=1,
Barrido de vddana_0p8:
xmsim: *W,ASRTST (./models/local_bias.sv,30): (time 30 NS) Assertion local_bias_tb.dut.vddana_0p8_boundaries has failed
Input voltge vddana_0p8 is out of bounds: 0.75 V
xmsim: *W,WARSEV (./models/local_bias.sv,63): (time 30 NS).
local_bias_tb.dut
Input signals boundaries are not correct: vddana_1p8_check=1, vddana_0p8_check=0, vssana_check=1,
xmsim: *W,ASRTST (./models/local_bias.sv,30): (time 50 NS) Assertion local_bias_tb.dut.vddana_0p8_boundaries has failed
Input voltge vddana_0p8 is out of bounds: 0.85 V
xmsim: *W,WARSEV (./models/local_bias.sv,63): (time 50 NS).
local_bias_tb.dut
Input signals boundaries are not correct: vddana_1p8_check=1, vddana_0p8_check=0, vssana_check=1,
Barrido de vssana:
xmsim: *W,ASRTST (./models/local_bias.sv,54): (time 60 NS) Assertion local_bias_tb.dut.vssana_boundaries has failed
Input voltge vssana is out of bounds: -0.10 V
xmsim: *W,WARSEV (./models/local_bias.sv,63): (time 60 NS).
local_bias_tb.dut
Input signals boundaries are not correct: vddana_1p8_check=1, vddana_0p8_check=0, vssana_check=0,
xmsim: *W,WARSEV (./models/local_bias.sv,63): (time 70 NS).
local_bias_tb.dut
Input signals boundaries are not correct: vddana_1p8_check=1, vddana_0p8_check=0, vssana_check=1,
xmsim: *W,ASRTST (./models/local_bias.sv,54): (time 80 NS) Assertion local_bias_tb.dut.vssana_boundaries has failed
Input voltge vssana is out of bounds: 0.10 V
xmsim: *W,WARSEV (./models/local_bias.sv,63): (time 80 NS).
local_bias_tb.dut
Input signals boundaries are not correct: vddana_1p8_check=1, vddana_0p8_check=0, vssana_check=0,
Test 2: Verificar salidas de los testbus (atb_ena)
xmsim: *W,WARSEV (./models/local_bias.sv,63): (time 90 NS).
local_bias_tb.dut
Input signals boundaries are not correct: vddana_1p8_check=1, vddana_0p8_check=1, vssana_check=0,
atb_ena = 2'b00 -> atb1 = `wrealZState, atb0 = `wrealZState
atb_ena = 2'b01 -> atb1 = 1.80, atb0 = 0.00
atb_ena = 2'b10 -> atb1 = 0.80, atb0 = 0.00
atb_ena = 2'b11 -> atb1 = 0.00, atb0 = 0.00
Test 3: Verificar funcionamiento de pdb
pdb = 0 -> atb1 = `wrealZState, atb0 = `wrealZState, iclkdist_25ua = `wrealZState
pdb = 1 -> atb1 = `wrealZState, atb0 = `wrealZState, iclkdist_25ua = 0.00
SimulaciÃ³n completada.
Simulation complete via $finish(1) at time 200 NS + 0
./tb/local_bias_tb.sv:108         $finish;
xcelium> xmsim: *W,NCTERM: Simulation received SIGTERM signal from process 4138104, user id 0 (<unknown>).
TOOL:	xrun(64)	24.03-s004: Exiting on Feb 11, 2026 at 14:39:04 CET  (total: 02:07:11)
