xrun(64): 24.03-s004: (c) Copyright 1995-2024 Cadence Design Systems, Inc.
TOOL:	xrun(64)	24.03-s004: Started on May 23, 2025 at 09:56:05 CEST
xrun
	-f xrun.f
		-clean
		./models/v2i.sv
		./tb/v2i_tb.sv
		-access +rw
		-gui
		-s
		-input /home/msegper/Documents/TFM/V2I/restore.tcl
xrun: *N,CLEAN: Removing existing directory ./xcelium.d.
file: ./models/v2i.sv
	module worklib.v2i:sv
		errors: 0, warnings: 0
file: ./tb/v2i_tb.sv
	module worklib.tb:sv
		errors: 0, warnings: 0
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
xmelab: *N,MSFLON: Xcelium will initiate mixed signal elaboration, Reason: RNM module.
	Top level design units:
		cds_rnm_pkg
		tb
	Building instance overlay tables: .................... Done
	Using implicit TMP libraries; associated with library worklib
	Generating native compiled code:
		worklib.v2i:sv <0x1f5e908a>
			streams:   2, words:   927
		worklib.tb:sv <0x0083a4eb>
			streams:   3, words:  3756
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                 Instances  Unique
		Modules:                 2       2
		Verilog packages:        1       1
		Registers:               5       5
		Scalar wires:            4       -
		Initial blocks:          1       1
		Cont. assignments:       2       2
		Pseudo assignments:      2       -
		Simulation timescale:  1ps
	Writing initial simulation snapshot: worklib.tb:sv
xmsim: *W,NOMTDGUI: Multi-Threaded Dumping is disabled for interactive debug mode.
[DMSINFO] Simulating with Xcelium Mixed-Signal App...

-------------------------------------
Relinquished control to SimVision...
xcelium> 
xcelium> source /eda/cadence/2024-25/RHELx86/XCELIUM_24.03.004/tools/xcelium/files/xmsimrc
xcelium> 
xcelium> # XM-Sim Command File
xcelium> # TOOL:	xmsim(64)	24.03-s004
xcelium> #
xcelium> #
xcelium> # You can restore this configuration with:
xcelium> #
xcelium> #      xrun -f xrun.f -s -input /home/msegper/Documents/TFM/V2I/restore.tcl
xcelium> #
xcelium> 
xcelium> set tcl_prompt1 {puts -nonewline "xcelium> "}
puts -nonewline "xcelium> "
xcelium> set tcl_prompt2 {puts -nonewline "> "}
puts -nonewline "> "
xcelium> set vlog_format %h
%h
xcelium> set vhdl_format %v
%v
xcelium> set real_precision 6
6
xcelium> set display_unit auto
auto
xcelium> set time_unit module
module
xcelium> set heap_garbage_size -200
-200
xcelium> set heap_garbage_time 0
0
xcelium> set assert_report_level note
note
xcelium> set assert_stop_level error
error
xcelium> set autoscope yes
yes
xcelium> set assert_1164_warnings yes
yes
xcelium> set pack_assert_off {}
xcelium> set severity_pack_assert_off {note warning}
note warning
xcelium> set assert_output_stop_level failed
failed
xcelium> set tcl_debug_level 0
0
xcelium> set relax_path_name 1
1
xcelium> set vhdl_vcdmap XX01ZX01X
XX01ZX01X
xcelium> set intovf_severity_level ERROR
ERROR
xcelium> set probe_screen_format 0
0
xcelium> set rangecnst_severity_level ERROR
ERROR
xcelium> set textio_severity_level ERROR
ERROR
xcelium> set vital_timing_checks_on 1
1
xcelium> set vlog_code_show_force 0
0
xcelium> set assert_count_attempts 1
1
xcelium> set tcl_all64 false
false
xcelium> set tcl_runerror_exit false
false
xcelium> set assert_report_incompletes 0
0
xcelium> set show_force 1
1
xcelium> set force_reset_by_reinvoke 0
0
xcelium> set tcl_relaxed_literal 0
0
xcelium> set probe_exclude_patterns {}
xcelium> set probe_packed_limit 4k
4k
xcelium> set probe_unpacked_limit 16k
16k
xcelium> set assert_internal_msg no
no
xcelium> set svseed 1
1
xcelium> set assert_reporting_mode 0
0
xcelium> set vcd_compact_mode 0
0
xcelium> set vhdl_forgen_loopindex_enum_pos 0
0
xcelium> set xmreplay_dc_debug 0
0
xcelium> set tcl_runcmd_interrupt next_command
next_command
xcelium> set tcl_sigval_prefix {#}
#
xcelium> alias . run
xcelium> alias indago verisium
xcelium> alias quit exit
xcelium> database -open -shm -into waves.shm waves -default
Created default SHM database waves
xcelium> probe -create -database waves tb.dut.IOUT tb.dut.VIN
Created probe 1
xcelium> 
xcelium> simvision -input restore.tcl.svcf
xcelium> run
Simulation complete via $finish(1) at time 4100 NS + 0
./tb/v2i_tb.sv:44         $finish;
xcelium> ^C
xcelium> exit
...Regained control from SimVision
-------------------------------------
TOOL:	xrun(64)	24.03-s004: Exiting on May 23, 2025 at 11:59:31 CEST  (total: 02:03:26)
