xrun(64): 24.03-s004: (c) Copyright 1995-2024 Cadence Design Systems, Inc.
TOOL:	xrun(64)	24.03-s004: Started on Feb 06, 2026 at 13:55:39 CET
xrun
	-f xrun.f
		-clean
		./models/currentSourceUnits_all_non_linearities.sv
		./tb/currentSourceUnits_tb.sv
		-access +rw
		-s
		-input /home/msegper/Documents/TFM/current_source_units/restore.tcl
xrun: *N,CLEAN: Removing existing directory ./xcelium.d.
file: ./models/currentSourceUnits_all_non_linearities.sv
        int mean = 0;         // Promedio de la distribución
                 |
xmvlog: *W,VARIST (./models/currentSourceUnits_all_non_linearities.sv,95|17): Local static variable with initializer requires 'static' keyword.
        int std_dev = 1000;     // Desviación estándar, sigma
                    |
xmvlog: *W,VARIST (./models/currentSourceUnits_all_non_linearities.sv,96|20): Local static variable with initializer requires 'static' keyword.
        real scalar =1e-12;  //Para ajustar el peso del ruido (1000*1e-12 = 1nA, el ruido tiene magnitud de nA)
                    |
xmvlog: *W,VARIST (./models/currentSourceUnits_all_non_linearities.sv,99|20): Local static variable with initializer requires 'static' keyword.
        int mean = 0;         // Promedio de la distribución
                 |
xmvlog: *W,VARIST (./models/currentSourceUnits_all_non_linearities.sv,126|17): Local static variable with initializer requires 'static' keyword.
        int std_dev = 20;     // Desviación estándar, sigma
                    |
xmvlog: *W,VARIST (./models/currentSourceUnits_all_non_linearities.sv,127|20): Local static variable with initializer requires 'static' keyword.
        real scale = 1000; // para escalar la desviación estándar y que sea 2%
                   |
xmvlog: *W,VARIST (./models/currentSourceUnits_all_non_linearities.sv,130|19): Local static variable with initializer requires 'static' keyword.
	module worklib.currentSourceUnits:sv
		errors: 0, warnings: 6
file: ./tb/currentSourceUnits_tb.sv
	module worklib.currentSourceUnits_tb:sv
		errors: 0, warnings: 0
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
	Top level design units:
		cds_rnm_pkg
		$unit_0x1b9ac963
		currentSourceUnits_tb
	Building instance overlay tables: .................... Done
	Using implicit TMP libraries; associated with library worklib
	Generating native compiled code:
		worklib.currentSourceUnits:sv <0x45cec808>
			streams:  14, words: 44949
		worklib.currentSourceUnits_tb:sv <0x21fa3dc8>
			streams:  34, words: 28672
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                 Instances  Unique
		Modules:                 2       2
		Verilog packages:        1       1
		Registers:             107     107
		Scalar wires:           31       -
		Vectored wires:          1       -
		Always blocks:           5       5
		Initial blocks:          9       9
		Pseudo assignments:     32       -
		Assertions:              4       4
		Compilation units:       1       1
		Simulation timescale:  1ps
	Writing initial simulation snapshot: worklib.currentSourceUnits_tb:sv
Loading snapshot worklib.currentSourceUnits_tb:sv .................... Done
SVSEED default: 1
[DMSINFO] Simulating with Xcelium Mixed-Signal App...
xcelium> source /eda/cadence/2024-25/RHELx86/XCELIUM_24.03.004/tools/xcelium/files/xmsimrc
xcelium> 
xcelium> # XM-Sim Command File
xcelium> # TOOL:	xmsim(64)	24.03-s004
xcelium> #
xcelium> #
xcelium> # You can restore this configuration with:
xcelium> #
xcelium> #      xrun -f xrun.f -input /home/msegper/Documents/TFM/current_source_units/restore.tcl
xcelium> #
xcelium> 
xcelium> set tcl_prompt1 {puts -nonewline "xcelium> "}
puts -nonewline "xcelium> "
xcelium> set tcl_prompt2 {puts -nonewline "> "}
puts -nonewline "> "
xcelium> set vlog_format %h
%h
xcelium> set vhdl_format %v
%v
xcelium> set real_precision 6
6
xcelium> set display_unit auto
auto
xcelium> set time_unit module
module
xcelium> set heap_garbage_size -200
-200
xcelium> set heap_garbage_time 0
0
xcelium> set assert_report_level note
note
xcelium> set assert_stop_level error
error
xcelium> set autoscope yes
yes
xcelium> set assert_1164_warnings yes
yes
xcelium> set pack_assert_off {}
xcelium> set severity_pack_assert_off {note warning}
note warning
xcelium> set assert_output_stop_level failed
failed
xcelium> set tcl_debug_level 0
0
xcelium> set relax_path_name 1
1
xcelium> set vhdl_vcdmap XX01ZX01X
XX01ZX01X
xcelium> set intovf_severity_level ERROR
ERROR
xcelium> set probe_screen_format 0
0
xcelium> set rangecnst_severity_level ERROR
ERROR
xcelium> set textio_severity_level ERROR
ERROR
xcelium> set vital_timing_checks_on 1
1
xcelium> set vlog_code_show_force 0
0
xcelium> set assert_count_attempts 1
1
xcelium> set tcl_all64 false
false
xcelium> set tcl_runerror_exit false
false
xcelium> set assert_report_incompletes 0
0
xcelium> set show_force 1
1
xcelium> set force_reset_by_reinvoke 0
0
xcelium> set tcl_relaxed_literal 0
0
xcelium> set probe_exclude_patterns {}
xcelium> set probe_packed_limit 4k
4k
xcelium> set probe_unpacked_limit 16k
16k
xcelium> set assert_internal_msg no
no
xcelium> set svseed 1
1
xcelium> set assert_reporting_mode 0
0
xcelium> set vcd_compact_mode 0
0
xcelium> set vhdl_forgen_loopindex_enum_pos 0
0
xcelium> set xmreplay_dc_debug 0
0
xcelium> set tcl_runcmd_interrupt next_command
next_command
xcelium> set tcl_sigval_prefix {#}
#
xcelium> alias . run
xcelium> alias indago verisium
xcelium> alias quit exit
xcelium> database -open -shm -into waves.shm waves -default
Created default SHM database waves
xcelium> probe -create -database waves currentSourceUnits_tb.dut.vssana currentSourceUnits_tb.dut.vddana_1p8 currentSourceUnits_tb.dut.vddana_0p8 currentSourceUnits_tb.dut.pdb currentSourceUnits_tb.dut.iref_500ua currentSourceUnits_tb.dut.atb_ena currentSourceUnits_tb.dut.atb1 currentSourceUnits_tb.dut.atb0 currentSourceUnits_tb.dut.Iout_binary_5 currentSourceUnits_tb.dut.Iout_binary_4 currentSourceUnits_tb.dut.Iout_binary_3 currentSourceUnits_tb.dut.Iout_binary_2 currentSourceUnits_tb.dut.Iout_binary_1 currentSourceUnits_tb.dut.Iout_binary_0_red currentSourceUnits_tb.dut.Iout_binary_0
Created probe 1
xcelium> probe -create -database waves currentSourceUnits_tb.dut.Iout_them_0 currentSourceUnits_tb.dut.Iout_them_1 currentSourceUnits_tb.dut.Iout_them_2 currentSourceUnits_tb.dut.Iout_them_3 currentSourceUnits_tb.dut.Iout_them_4 currentSourceUnits_tb.dut.Iout_them_5 currentSourceUnits_tb.dut.Iout_them_6 currentSourceUnits_tb.dut.Iout_them_7 currentSourceUnits_tb.dut.Iout_them_8 currentSourceUnits_tb.dut.Iout_them_9 currentSourceUnits_tb.dut.Iout_them_10 currentSourceUnits_tb.dut.Iout_them_11 currentSourceUnits_tb.dut.Iout_them_12 currentSourceUnits_tb.dut.Iout_them_13 currentSourceUnits_tb.dut.Iout_them_14 currentSourceUnits_tb.dut.Iout_them_15 currentSourceUnits_tb.dut.Iout_them_16
Created probe 2
xcelium> 
xcelium> simvision -input restore.tcl.svcf

-------------------------------------
Relinquished control to SimVision...
xcelium> 
xcelium> run
mismatch temporal = 0.0270 seed = 1647131094 media =0 sigma = 20
mismatch temporal = 0.0020 seed = -289871628 media =0 sigma = 20
mismatch temporal = -0.0130 seed = -882559483 media =0 sigma = 20
mismatch temporal = -0.0050 seed = -1595489963 media =0 sigma = 20
mismatch temporal = -0.0090 seed = -683839996 media =0 sigma = 20
mismatch temporal = -0.0260 seed = 1677312052 media =0 sigma = 20
mismatch temporal = 0.0110 seed = 968744563 media =0 sigma = 20
mismatch temporal = -0.0030 seed = -434172825 media =0 sigma = 20
mismatch temporal = 0.0350 seed = 1785419502 media =0 sigma = 20
mismatch temporal = -0.0350 seed = -1756486316 media =0 sigma = 20
mismatch temporal = -0.0030 seed = -259738831 media =0 sigma = 20
mismatch temporal = 0.0340 seed = -1786685995 media =0 sigma = 20
mismatch temporal = 0.0040 seed = 1004651839 media =0 sigma = 20
mismatch temporal = 0.0000 seed = 108804191 media =0 sigma = 20
mismatch temporal = 0.0240 seed = 2040667262 media =0 sigma = 20
mismatch temporal = 0.0080 seed = -1503757932 media =0 sigma = 20
mismatch temporal = 0.0180 seed = 1700834055 media =0 sigma = 20
mismatch temporal = -0.0460 seed = 1960714420 media =0 sigma = 20
mismatch temporal = 0.0040 seed = -415108424 media =0 sigma = 20
mismatch temporal = 0.0140 seed = -1168039664 media =0 sigma = 20
mismatch temporal = -0.0130 seed = 1418952621 media =0 sigma = 20
mismatch temporal = 0.0070 seed = -637034484 media =0 sigma = 20
mismatch temporal = -0.0290 seed = 1925184035 media =0 sigma = 20
mismatch temporal = -0.0040 seed = 313822460 media =0 sigma = 20
Barrido de iref_500ua:
xmsim: *W,ASRTST (./models/currentSourceUnits_all_non_linearities.sv,53): (time 0 FS) Assertion currentSourceUnits_tb.dut.iref_ua_boundaries has failed
Input current iref_500ua is out of bounds: 425.00 uA
xmsim: *W,WARSEV (./models/currentSourceUnits_all_non_linearities.sv,176): (time 0 FS).
currentSourceUnits_tb.dut
Input signals are not correct: iref_check=0, vddana_1p8_check=1, vddana_0p8_check=1, vssana_check=1
xmsim: *W,WARSEV (./models/currentSourceUnits_all_non_linearities.sv,176): (time 0 FS).
currentSourceUnits_tb.dut
Input signals are not correct: iref_check=0, vddana_1p8_check=1, vddana_0p8_check=1, vssana_check=1
iref_500ua = 0.000425 A
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.105000000000000e-9 seed = -1009769139 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.024000000000000e-9 seed = 1770757959 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.059000000000000e-9 seed = 2029538782 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.269000000000000e-9 seed = -1497980754 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.202000000000000e-9 seed = -1807904338 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.005000000000000e-9 seed = 10657304 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.269000000000000e-9 seed = -1709492419 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.727000000000000e-9 seed = -2096392428 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.461000000000000e-9 seed = -773957061 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.052000000000000e-9 seed = 1901731235 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.005000000000000e-9 seed = 618173521 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.133000000000000e-9 seed = 235108489 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.112000000000000e-9 seed = -1386904529 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.683000000000000e-9 seed = 947295572 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.901000000000000e-9 seed = 1133700373 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.495000000000000e-9 seed = -2041953706 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.240000000000000e-9 seed = -867210118 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.443000000000000e-9 seed = 820459441 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.342000000000000e-9 seed = 1510779773 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.431000000000000e-9 seed = -629247586 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.397000000000000e-9 seed = 712931728 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.401000000000000e-9 seed = 563874389 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.605000000000000e-9 seed = 992109417 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.266000000000000e-9 seed = 1533979010 media =0.000000000000000 sigma = 0.000000001000000
iref_500ua = 0.000475 A
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.604000000000000e-9 seed = -1692395621 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.032000000000000e-9 seed = 828172533 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.033000000000000e-9 seed = -1638464960 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.826000000000000e-9 seed = 1985702005 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.503000000000000e-9 seed = 1603271524 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.112000000000000e-9 seed = -1327467644 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.167000000000000e-9 seed = 1670549747 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.137000000000000e-9 seed = -335148331 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.806000000000000e-9 seed = 1866875498 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.273000000000000e-9 seed = 432400225 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.694000000000000e-9 seed = -1258939105 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.052000000000000e-9 seed = 393613799 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.597000000000000e-9 seed = -1015419554 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.687000000000000e-9 seed = 2125602478 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.864000000000000e-9 seed = 1882749878 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.268000000000000e-9 seed = -840722776 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.022000000000000e-9 seed = -164437983 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.742000000000000e-9 seed = -1665127431 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.882000000000000e-9 seed = -1907193538 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.364000000000000e-9 seed = 1451627674 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.359000000000000e-9 seed = -2074675634 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.109000000000000e-9 seed = -215046683 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.990000000000000e-9 seed = 1239524862 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.364000000000000e-9 seed = -728474993 media =0.000000000000000 sigma = 0.000000001000000
iref_500ua = 0.000525 A
xmsim: *W,ASRTST (./models/currentSourceUnits_all_non_linearities.sv,53): (time 30 PS) Assertion currentSourceUnits_tb.dut.iref_ua_boundaries has failed
Input current iref_500ua is out of bounds: 575.00 uA
xmsim: *W,WARSEV (./models/currentSourceUnits_all_non_linearities.sv,176): (time 30 PS).
currentSourceUnits_tb.dut
Input signals are not correct: iref_check=0, vddana_1p8_check=1, vddana_0p8_check=1, vssana_check=1
iref_500ua = 0.000575 A
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.310000000000000e-9 seed = -647202630 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.333000000000000e-9 seed = -769406417 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.271000000000000e-9 seed = 461224541 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.220000000000000e-9 seed = 1328606474 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.819000000000000e-9 seed = 1476789021 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.776000000000000e-9 seed = 1054409211 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.225000000000000e-9 seed = 492577704 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.132000000000000e-9 seed = -661020020 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.161000000000000e-9 seed = -256328692 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.095000000000000e-9 seed = 1937930375 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.003000000000000e-9 seed = -553453278 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.570000000000000e-9 seed = -1836862270 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.147000000000000e-9 seed = 1956222469 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.368000000000000e-9 seed = -1669607341 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.558000000000000e-9 seed = -827272322 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.031000000000000e-9 seed = 1923545052 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.140000000000000e-9 seed = -1419390774 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.140000000000000e-9 seed = 572549107 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.607000000000000e-9 seed = -828298903 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.601000000000000e-9 seed = -827664268 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.835000000000000e-9 seed = -1326508347 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.750000000000000e-9 seed = 1066089789 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.031000000000000e-9 seed = -1309670523 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.291000000000000e-9 seed = 752786790 media =0.000000000000000 sigma = 0.000000001000000
Barrido de vddana_1p8:
xmsim: *W,ASRTST (./models/currentSourceUnits_all_non_linearities.sv,64): (time 50 PS) Assertion currentSourceUnits_tb.dut.vddana_1p8_boundaries has failed
Input voltge vddana_1p8 is out of bounds: 1.62 V
xmsim: *W,WARSEV (./models/currentSourceUnits_all_non_linearities.sv,176): (time 50 PS).
currentSourceUnits_tb.dut
Input signals are not correct: iref_check=1, vddana_1p8_check=0, vddana_0p8_check=1, vssana_check=1
vddana_1p8 = 1.62 V
xmsim: *W,ASRTST (./models/currentSourceUnits_all_non_linearities.sv,64): (time 60 PS) Assertion currentSourceUnits_tb.dut.vddana_1p8_boundaries has failed
Input voltge vddana_1p8 is out of bounds: 1.67 V
xmsim: *W,WARSEV (./models/currentSourceUnits_all_non_linearities.sv,176): (time 60 PS).
currentSourceUnits_tb.dut
Input signals are not correct: iref_check=1, vddana_1p8_check=0, vddana_0p8_check=1, vssana_check=1
vddana_1p8 = 1.67 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.495000000000000e-9 seed = -1618167430 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.537000000000000e-9 seed = 759876727 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.831000000000000e-9 seed = -1124525202 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.498000000000000e-9 seed = -1239307434 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.001000000000000e-9 seed = -1289639418 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.234000000000000e-9 seed = 1481084406 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.698000000000000e-9 seed = 1257792990 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.731000000000000e-9 seed = 1229018388 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.941000000000000e-9 seed = 1881718122 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.829000000000000e-9 seed = 1792158382 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.501000000000000e-9 seed = 1666058203 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.167000000000000e-9 seed = -1379663607 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.006000000000000e-9 seed = -1304958971 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.221000000000000e-9 seed = -417572573 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.961000000000000e-9 seed = -2041480219 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.513000000000000e-9 seed = 994673339 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.289000000000000e-9 seed = -477260716 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.059000000000000e-9 seed = -1285879862 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.054000000000000e-9 seed = 357573187 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.702000000000000e-9 seed = -954014670 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.846000000000000e-9 seed = 1668382565 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.340000000000000e-9 seed = -508676225 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.224000000000000e-9 seed = -508957299 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.521000000000000e-9 seed = -773323080 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.72 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.221000000000000e-9 seed = 502082308 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.600000000000000e-9 seed = 1362951183 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.776000000000000e-9 seed = 1196345634 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.703000000000000e-9 seed = 1731609609 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -3.306000000000000e-9 seed = -2123355595 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.104000000000000e-9 seed = 1272951067 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.456000000000000e-9 seed = -1597069902 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.235000000000000e-9 seed = -1633018199 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.557000000000000e-9 seed = -1755221795 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.286000000000000e-9 seed = 424532309 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.734000000000000e-9 seed = 1227051874 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.338000000000000e-9 seed = 1111680554 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.261000000000000e-9 seed = -499353532 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.021000000000000e-9 seed = 1252833904 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.526000000000000e-9 seed = -2147473035 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.381000000000000e-9 seed = 1324572919 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.397000000000000e-9 seed = 1313646624 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.029000000000000e-9 seed = -2133184059 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.012000000000000e-9 seed = -946071297 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.747000000000000e-9 seed = -1618462880 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.506000000000000e-9 seed = 1335553802 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.408000000000000e-9 seed = 623092545 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.580000000000000e-9 seed = -1458008782 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.480000000000000e-9 seed = 834682063 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.77 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.061000000000000e-9 seed = 318426413 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.412000000000000e-9 seed = 589665662 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.608000000000000e-9 seed = 1796131427 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.827000000000000e-9 seed = -1058628257 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.932000000000000e-9 seed = -1856570931 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.182000000000000e-9 seed = -352312415 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.023000000000000e-9 seed = -1265054756 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.784000000000000e-9 seed = -1249352704 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.578000000000000e-9 seed = -963326422 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.722000000000000e-9 seed = -1971785734 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.268000000000000e-9 seed = -1959263519 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.766000000000000e-9 seed = -1813461943 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.240000000000000e-9 seed = 350722637 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.026000000000000e-9 seed = -1655369357 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.578000000000000e-9 seed = 802879229 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.236000000000000e-9 seed = -368902009 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.210000000000000e-9 seed = -1448526541 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.320000000000000e-9 seed = -626272369 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.170000000000000e-9 seed = 1390246069 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.358000000000000e-9 seed = 982733663 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.392000000000000e-9 seed = -1077249637 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.246000000000000e-9 seed = 1047161834 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.520000000000000e-9 seed = -719671496 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.963000000000000e-9 seed = -2124376922 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.82 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.686000000000000e-9 seed = 1004180243 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.197000000000000e-9 seed = -1521427834 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.047000000000000e-9 seed = 390455454 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.142000000000000e-9 seed = 293862346 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.591000000000000e-9 seed = -813584148 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.408000000000000e-9 seed = -1328914726 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.863000000000000e-9 seed = 1610899453 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.751000000000000e-9 seed = 2050231647 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.850000000000000e-9 seed = -1336554192 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.253000000000000e-9 seed = 2067687994 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.707000000000000e-9 seed = 1426950169 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.209000000000000e-9 seed = 1587410144 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.676000000000000e-9 seed = -1036981603 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.105000000000000e-9 seed = -974393780 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.169000000000000e-9 seed = -485710119 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.452000000000000e-9 seed = 921657030 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.222000000000000e-9 seed = 1940790954 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.722000000000000e-9 seed = 1944261871 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.327000000000000e-9 seed = 473485894 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.328000000000000e-9 seed = 1501891939 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.936000000000000e-9 seed = -1171319880 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.107000000000000e-9 seed = 1662444526 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.588000000000000e-9 seed = -1223083912 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.867000000000000e-9 seed = 1118818694 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.87 V
xmsim: *W,ASRTST (./models/currentSourceUnits_all_non_linearities.sv,64): (time 110 PS) Assertion currentSourceUnits_tb.dut.vddana_1p8_boundaries has failed
Input voltge vddana_1p8 is out of bounds: 1.92 V
xmsim: *W,WARSEV (./models/currentSourceUnits_all_non_linearities.sv,176): (time 110 PS).
currentSourceUnits_tb.dut
Input signals are not correct: iref_check=1, vddana_1p8_check=0, vddana_0p8_check=1, vssana_check=1
vddana_1p8 = 1.92 V
xmsim: *W,ASRTST (./models/currentSourceUnits_all_non_linearities.sv,64): (time 120 PS) Assertion currentSourceUnits_tb.dut.vddana_1p8_boundaries has failed
Input voltge vddana_1p8 is out of bounds: 1.97 V
xmsim: *W,WARSEV (./models/currentSourceUnits_all_non_linearities.sv,176): (time 120 PS).
currentSourceUnits_tb.dut
Input signals are not correct: iref_check=1, vddana_1p8_check=0, vddana_0p8_check=1, vssana_check=1
vddana_1p8 = 1.97 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.405000000000000e-9 seed = 2091071082 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.163000000000000e-9 seed = 241846656 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.658000000000000e-9 seed = 2006841383 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.075000000000000e-9 seed = -658106358 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.262000000000000e-9 seed = -1630622147 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.772000000000000e-9 seed = -1956772490 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.465000000000000e-9 seed = 1590249797 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.271000000000000e-9 seed = 1466282721 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.501000000000000e-9 seed = 1619485490 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.150000000000000e-9 seed = -352713211 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.269000000000000e-9 seed = -1642224245 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.754000000000000e-9 seed = -1708094783 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.270000000000000e-9 seed = -596569056 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.347000000000000e-9 seed = -1143193203 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.222000000000000e-9 seed = 1765351215 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.014000000000000e-9 seed = -1375609516 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.818000000000000e-9 seed = 1668249003 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.698000000000000e-9 seed = 997882599 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.124000000000000e-9 seed = -1905847177 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.250000000000000e-9 seed = 853715870 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.738000000000000e-9 seed = 1378542360 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.736000000000000e-9 seed = -985043392 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.535000000000000e-9 seed = 1838310212 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.341000000000000e-9 seed = -1600639624 media =0.000000000000000 sigma = 0.000000001000000
Barrido de vddana_0p8:
xmsim: *W,ASRTST (./models/currentSourceUnits_all_non_linearities.sv,75): (time 140 PS) Assertion currentSourceUnits_tb.dut.vddana_0p8_boundaries has failed
Input voltge vddana_0p8 is out of bounds: 0.72 V
xmsim: *W,WARSEV (./models/currentSourceUnits_all_non_linearities.sv,176): (time 140 PS).
currentSourceUnits_tb.dut
Input signals are not correct: iref_check=1, vddana_1p8_check=1, vddana_0p8_check=0, vssana_check=1
vddana_0p8 = 0.72 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.494000000000000e-9 seed = 1300538221 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.552000000000000e-9 seed = 1893403675 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.250000000000000e-9 seed = -1429876715 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.079000000000000e-9 seed = -127278742 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.527000000000000e-9 seed = 1915744552 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.640000000000000e-9 seed = -939374664 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.466000000000000e-9 seed = 902468241 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.090000000000000e-9 seed = 1996975393 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.587000000000000e-9 seed = 802084792 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.823000000000000e-9 seed = -1089058663 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.856000000000000e-9 seed = -1136198024 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.694000000000000e-9 seed = 920297813 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.863000000000000e-9 seed = 1767340225 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.317000000000000e-9 seed = -1496657534 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.038000000000000e-9 seed = -226882126 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.219000000000000e-9 seed = -1413480666 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.146000000000000e-9 seed = 1444653386 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.471000000000000e-9 seed = -2025830640 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.555000000000000e-9 seed = -945581924 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.514000000000000e-9 seed = -705413371 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.305000000000000e-9 seed = -1972695624 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.070000000000000e-9 seed = 164065325 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.173000000000000e-9 seed = -1831911544 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.915000000000000e-9 seed = 1158449772 media =0.000000000000000 sigma = 0.000000001000000
vddana_0p8 = 0.77 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.666000000000000e-9 seed = 1056610790 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.047000000000000e-9 seed = -207419835 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.505000000000000e-9 seed = 1801835981 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.826000000000000e-9 seed = 1449905241 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.115000000000000e-9 seed = 1408965630 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.006000000000000e-9 seed = -47397868 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.094000000000000e-9 seed = 142709295 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.381000000000000e-9 seed = 550447359 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.182000000000000e-9 seed = -1940378317 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.319000000000000e-9 seed = 1777374291 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.044000000000000e-9 seed = -1960234824 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.301000000000000e-9 seed = -1253133272 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.427000000000000e-9 seed = 1663813864 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.254000000000000e-9 seed = -652137669 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.858000000000000e-9 seed = -1090009510 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.539000000000000e-9 seed = -819209151 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.542000000000000e-9 seed = 1638756670 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.582000000000000e-9 seed = 1593729004 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.508000000000000e-9 seed = 1980134373 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.178000000000000e-9 seed = -1942758398 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.450000000000000e-9 seed = 1192552464 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.632000000000000e-9 seed = -1695007497 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.059000000000000e-9 seed = 205125657 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.408000000000000e-9 seed = 743395999 media =0.000000000000000 sigma = 0.000000001000000
vddana_0p8 = 0.82 V
xmsim: *W,ASRTST (./models/currentSourceUnits_all_non_linearities.sv,75): (time 170 PS) Assertion currentSourceUnits_tb.dut.vddana_0p8_boundaries has failed
Input voltge vddana_0p8 is out of bounds: 0.87 V
xmsim: *W,WARSEV (./models/currentSourceUnits_all_non_linearities.sv,176): (time 170 PS).
currentSourceUnits_tb.dut
Input signals are not correct: iref_check=1, vddana_1p8_check=1, vddana_0p8_check=0, vssana_check=1
vddana_0p8 = 0.87 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 3.222000000000000e-9 seed = -2128045330 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.196000000000000e-9 seed = -1299845327 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.912000000000000e-9 seed = -1840041389 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.235000000000000e-9 seed = 585897987 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.851000000000000e-9 seed = -2130675166 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.072000000000000e-9 seed = 1745521219 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.467000000000000e-9 seed = 821854111 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.690000000000000e-9 seed = -939290556 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.619000000000000e-9 seed = -1688434002 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.716000000000000e-9 seed = 1277168404 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.685000000000000e-9 seed = 1548041566 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.063000000000000e-9 seed = -2073681455 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.699000000000000e-9 seed = 1763675663 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.524000000000000e-9 seed = -2077442895 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.638000000000000e-9 seed = 919251976 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.834000000000000e-9 seed = 2141975579 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.539000000000000e-9 seed = 2019350163 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.888000000000000e-9 seed = -1156281278 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.772000000000000e-9 seed = -1355183437 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.895000000000000e-9 seed = 1570106343 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.301000000000000e-9 seed = -908088276 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.837000000000000e-9 seed = -1909514482 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.775000000000000e-9 seed = -1695737946 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.060000000000000e-9 seed = 95318438 media =0.000000000000000 sigma = 0.000000001000000
Barrido de vssana:
xmsim: *W,ASRTST (./models/currentSourceUnits_all_non_linearities.sv,88): (time 190 PS) Assertion currentSourceUnits_tb.dut.vssana_boundaries has failed
Input voltge vssana is out of bounds: -0.10 V
xmsim: *W,WARSEV (./models/currentSourceUnits_all_non_linearities.sv,176): (time 190 PS).
currentSourceUnits_tb.dut
Input signals are not correct: iref_check=1, vddana_1p8_check=1, vddana_0p8_check=1, vssana_check=0
vssana = -0.10 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.391000000000000e-9 seed = 1655808695 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.256000000000000e-9 seed = -531496473 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.180000000000000e-9 seed = 1385274510 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.025000000000000e-9 seed = -1584219956 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.023000000000000e-9 seed = -1761127190 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.465000000000000e-9 seed = 1196954872 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.033000000000000e-9 seed = -1170208108 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.152000000000000e-9 seed = 355705721 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.811000000000000e-9 seed = -1694120349 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.096000000000000e-9 seed = 1532220062 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.356000000000000e-9 seed = -1682448999 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.876000000000000e-9 seed = 1550419264 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.846000000000000e-9 seed = 1452728862 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.385000000000000e-9 seed = 756081862 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.276000000000000e-9 seed = 1601129053 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.449000000000000e-9 seed = 1253447871 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.575000000000000e-9 seed = -2061500038 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.871000000000000e-9 seed = 1291976305 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.173000000000000e-9 seed = 568996711 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.347000000000000e-9 seed = -550288141 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.312000000000000e-9 seed = -527467550 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.955000000000000e-9 seed = -1658002176 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.830000000000000e-9 seed = -2037691464 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.226000000000000e-9 seed = -338201943 media =0.000000000000000 sigma = 0.000000001000000
vssana = -0.05 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.116000000000000e-9 seed = 1377098420 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.439000000000000e-9 seed = -1769077783 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.093000000000000e-9 seed = 156053108 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.613000000000000e-9 seed = -824575137 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.215000000000000e-9 seed = -386689182 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.411000000000000e-9 seed = 624154179 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.845000000000000e-9 seed = 2055473414 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.517000000000000e-9 seed = -1628291056 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.054000000000000e-9 seed = -82187037 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.685000000000000e-9 seed = 935546186 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.296000000000000e-9 seed = -448276566 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.318000000000000e-9 seed = -521592205 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.255000000000000e-9 seed = -1452156913 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.939000000000000e-9 seed = -2037573901 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.136000000000000e-9 seed = 353852387 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.417000000000000e-9 seed = 1088544776 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.275000000000000e-9 seed = 1524317924 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.469000000000000e-9 seed = 716408274 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.755000000000000e-9 seed = -1341998843 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.768000000000000e-9 seed = 1120248996 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.225000000000000e-9 seed = -550143298 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.706000000000000e-9 seed = 1774972427 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.223000000000000e-9 seed = -514227552 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.560000000000000e-9 seed = 1413147551 media =0.000000000000000 sigma = 0.000000001000000
vssana = 0.00 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.692000000000000e-9 seed = -917953617 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.025000000000000e-9 seed = -1554397732 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.309000000000000e-9 seed = 772093167 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.490000000000000e-9 seed = 1775528358 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.850000000000000e-9 seed = -1123232672 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.931000000000000e-9 seed = -2128957114 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.279000000000000e-9 seed = 717545430 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.578000000000000e-9 seed = 1668962240 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.196000000000000e-9 seed = 1616056630 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.481000000000000e-9 seed = 680072794 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.011000000000000e-9 seed = 219188964 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.809000000000000e-9 seed = 1504321435 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.294000000000000e-9 seed = 423637834 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.702000000000000e-9 seed = -1429214392 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.704000000000000e-9 seed = 1852224252 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.626000000000000e-9 seed = -1842251436 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.088000000000000e-9 seed = -132804478 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.039000000000000e-9 seed = -98497241 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.947000000000000e-9 seed = -1770700082 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.886000000000000e-9 seed = -1334882930 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.262000000000000e-9 seed = 2081477654 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.464000000000000e-9 seed = 1589850874 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.039000000000000e-9 seed = 213373481 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.682000000000000e-9 seed = 1054182156 media =0.000000000000000 sigma = 0.000000001000000
vssana = 0.05 V
xmsim: *W,ASRTST (./models/currentSourceUnits_all_non_linearities.sv,88): (time 230 PS) Assertion currentSourceUnits_tb.dut.vssana_boundaries has failed
Input voltge vssana is out of bounds: 0.10 V
xmsim: *W,WARSEV (./models/currentSourceUnits_all_non_linearities.sv,176): (time 230 PS).
currentSourceUnits_tb.dut
Input signals are not correct: iref_check=1, vddana_1p8_check=1, vddana_0p8_check=1, vssana_check=0
vssana = 0.10 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.214000000000000e-9 seed = 1366132959 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.548000000000000e-9 seed = -1593017081 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.325000000000000e-9 seed = -508490327 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.407000000000000e-9 seed = -1722154125 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.307000000000000e-9 seed = 866476144 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.322000000000000e-9 seed = 2027340366 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.618000000000000e-9 seed = 970906234 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.762000000000000e-9 seed = -1914487900 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.170000000000000e-9 seed = 1463915199 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.820000000000000e-9 seed = 1107061355 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.714000000000000e-9 seed = 938951903 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.395000000000000e-9 seed = -862378068 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.177000000000000e-9 seed = 290312265 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.348000000000000e-9 seed = 1721703102 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.879000000000000e-9 seed = -1996359308 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.350000000000000e-9 seed = -1382913038 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.379000000000000e-9 seed = 1748122821 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.905000000000000e-9 seed = 1148110339 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.356000000000000e-9 seed = -1269995325 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.830000000000000e-9 seed = -1736643598 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.335000000000000e-9 seed = -577645322 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.213000000000000e-9 seed = 1766171869 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.517000000000000e-9 seed = 1660689573 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.655000000000000e-9 seed = 1595995031 media =0.000000000000000 sigma = 0.000000001000000
Barrido de atb_ena:
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.331000000000000e-9 seed = -733145045 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.108000000000000e-9 seed = -1635716116 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.283000000000000e-9 seed = -580168559 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.098000000000000e-9 seed = 190943535 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.414000000000000e-9 seed = 1061080593 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.054000000000000e-9 seed = -782808726 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.183000000000000e-9 seed = -632655322 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.154000000000000e-9 seed = 945123612 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.252000000000000e-9 seed = 1439517501 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.935000000000000e-9 seed = -1167093548 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.304000000000000e-9 seed = -2013131789 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.741000000000000e-9 seed = 1420957478 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.408000000000000e-9 seed = 1680790045 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.164000000000000e-9 seed = 796268814 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.026000000000000e-9 seed = -51035176 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.536000000000000e-9 seed = 801635214 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.616000000000000e-9 seed = 2102288094 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.085000000000000e-9 seed = -236573930 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.187000000000000e-9 seed = -358768982 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.261000000000000e-9 seed = 1477170837 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.556000000000000e-9 seed = -1837209507 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.628000000000000e-9 seed = -2056221738 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.285000000000000e-9 seed = -1705242368 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.137000000000000e-9 seed = 339630777 media =0.000000000000000 sigma = 0.000000001000000
atb_ena = 00
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.696000000000000e-9 seed = -1235586666 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.691000000000000e-9 seed = -925550643 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.965000000000000e-9 seed = 1663907042 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.417000000000000e-9 seed = 1777513434 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.178000000000000e-9 seed = 1939847380 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.670000000000000e-9 seed = -1716783596 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.371000000000000e-9 seed = -575558491 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.244000000000000e-9 seed = 2042272369 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.914000000000000e-9 seed = 1187623341 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.623000000000000e-9 seed = 1198871712 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.197000000000000e-9 seed = -1400880246 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.079000000000000e-9 seed = -155964476 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.499000000000000e-9 seed = 754528878 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.134000000000000e-9 seed = 1447645311 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.187000000000000e-9 seed = -1617917327 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.655000000000000e-9 seed = -2137257183 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.393000000000000e-9 seed = -987203906 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.321000000000000e-9 seed = 2115681355 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.035000000000000e-9 seed = 58266276 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.731000000000000e-9 seed = -1898928433 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.389000000000000e-9 seed = 1627906652 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.842000000000000e-9 seed = -1372733835 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.500000000000000e-9 seed = 715507890 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.082000000000000e-9 seed = -2114557964 media =0.000000000000000 sigma = 0.000000001000000
atb_ena = 01
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.221000000000000e-9 seed = -1431015856 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.650000000000000e-9 seed = 1345603121 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.144000000000000e-9 seed = -1445937663 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.790000000000000e-9 seed = -1029286010 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.671000000000000e-9 seed = 2078793523 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.126000000000000e-9 seed = -1418644515 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.709000000000000e-9 seed = -980106909 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.380000000000000e-9 seed = -1542073365 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.631000000000000e-9 seed = -880433571 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.271000000000000e-9 seed = 1044809845 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.658000000000000e-9 seed = 1517798821 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.011000000000000e-9 seed = -130981068 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.148000000000000e-9 seed = -1373291059 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.274000000000000e-9 seed = 475445595 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.206000000000000e-9 seed = 301728302 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.029000000000000e-9 seed = 1593545286 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.317000000000000e-9 seed = 1784281366 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.277000000000000e-9 seed = 1470354345 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.139000000000000e-9 seed = 206566050 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.153000000000000e-9 seed = 1714423821 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.013000000000000e-9 seed = 195828205 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.493000000000000e-9 seed = 2058788490 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.003000000000000e-9 seed = -6190052 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.284000000000000e-9 seed = 408755163 media =0.000000000000000 sigma = 0.000000001000000
atb_ena = 10
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.166000000000000e-9 seed = 1037491008 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.163000000000000e-9 seed = 280093146 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.227000000000000e-9 seed = -1673517877 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.317000000000000e-9 seed = -1967851254 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.313000000000000e-9 seed = 1979242469 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.244000000000000e-9 seed = 1982576501 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.483000000000000e-9 seed = -1073669336 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.375000000000000e-9 seed = 533187323 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.786000000000000e-9 seed = -1750520916 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.514000000000000e-9 seed = 1692998932 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.494000000000000e-9 seed = 770930396 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.471000000000000e-9 seed = -1610899750 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.462000000000000e-9 seed = -800316492 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.166000000000000e-9 seed = -1639972255 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.164000000000000e-9 seed = 1384023616 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.657000000000000e-9 seed = 2069011677 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.297000000000000e-9 seed = 507204992 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.172000000000000e-9 seed = -1382814047 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.048000000000000e-9 seed = 1704428072 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.757000000000000e-9 seed = -1066434908 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.884000000000000e-9 seed = -1427043167 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.078000000000000e-9 seed = 1061284763 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.773000000000000e-9 seed = -1603408801 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.579000000000000e-9 seed = 1787161271 media =0.000000000000000 sigma = 0.000000001000000
atb_ena = 11
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.171000000000000e-9 seed = -294859930 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.408000000000000e-9 seed = -790312415 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.766000000000000e-9 seed = -2098653072 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.171000000000000e-9 seed = 353811740 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.522000000000000e-9 seed = -1538897504 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.548000000000000e-9 seed = -1710857634 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.760000000000000e-9 seed = -1382611663 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.658000000000000e-9 seed = 2070291978 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.808000000000000e-9 seed = -1534650880 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.012000000000000e-9 seed = -69824447 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.504000000000000e-9 seed = 1594142466 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.780000000000000e-9 seed = -1170952733 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.517000000000000e-9 seed = -894395852 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.635000000000000e-9 seed = 853636261 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.662000000000000e-9 seed = 881695712 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.693000000000000e-9 seed = 1985150677 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.754000000000000e-9 seed = 1303490011 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.520000000000000e-9 seed = -1821467466 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.254000000000000e-9 seed = -1492616458 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.154000000000000e-9 seed = -1180064213 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.981000000000000e-9 seed = -1240502624 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.604000000000000e-9 seed = -1541358159 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.261000000000000e-9 seed = -565917307 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.390000000000000e-9 seed = 612955578 media =0.000000000000000 sigma = 0.000000001000000
Barrido de pdb:
pdb = 0
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.502000000000000e-9 seed = 1670733151 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.403000000000000e-9 seed = -1469135419 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.394000000000000e-9 seed = 602584305 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.097000000000000e-9 seed = 1876699686 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.057000000000000e-9 seed = 1369673232 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.423000000000000e-9 seed = 1616761748 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.554000000000000e-9 seed = -1706638107 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.966000000000000e-9 seed = 1850911917 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.748000000000000e-9 seed = -1003842140 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.056000000000000e-9 seed = 1470030465 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.608000000000000e-9 seed = 1274056900 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.233000000000000e-9 seed = 387565919 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.156000000000000e-9 seed = 1397059061 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.372000000000000e-9 seed = -1854500919 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.030000000000000e-9 seed = -1986474043 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.250000000000000e-9 seed = 1557460549 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.091000000000000e-9 seed = -2062931135 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.940000000000000e-9 seed = 1424671536 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.098000000000000e-9 seed = 2106775007 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.280000000000000e-9 seed = -1812108428 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.869000000000000e-9 seed = -1215246190 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.340000000000000e-9 seed = -519040274 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.017000000000000e-9 seed = -28999674 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.539000000000000e-9 seed = -1067761061 media =0.000000000000000 sigma = 0.000000001000000
pdb = 1
Simulation complete via $finish(1) at time 420 PS + 0
./tb/currentSourceUnits_tb.sv:143         $finish;
xcelium> ^C
xcelium> exit
...Regained control from SimVision
-------------------------------------
TOOL:	xrun(64)	24.03-s004: Exiting on Feb 09, 2026 at 12:18:09 CET  (total: 70:22:30)
