xrun(64): 24.03-s004: (c) Copyright 1995-2024 Cadence Design Systems, Inc.
TOOL:	xrun(64)	24.03-s004: Started on Jan 22, 2026 at 20:55:16 CET
xrun
	-f xrun.f
		-clean
		./models/currentSourceUnits_all_non_linearities.sv
		./tb/currentSourceUnits_tb.sv
		-access +rw
		-s
		-input /home/msegper/Documents/TFM/current_source_units/restore.tcl
xrun: *N,CLEAN: Removing existing directory ./xcelium.d.
file: ./models/currentSourceUnits_all_non_linearities.sv
        int mean = 0;         // Promedio de la distribución
                 |
xmvlog: *W,VARIST (./models/currentSourceUnits_all_non_linearities.sv,95|17): Local static variable with initializer requires 'static' keyword.
        int std_dev = 1000;     // Desviación estándar, sigma
                    |
xmvlog: *W,VARIST (./models/currentSourceUnits_all_non_linearities.sv,96|20): Local static variable with initializer requires 'static' keyword.
        real scalar =1e-12;  //Para ajustar el peso del ruido (1000*1e-12 = 1nA, el ruido tiene magnitud de nA)
                    |
xmvlog: *W,VARIST (./models/currentSourceUnits_all_non_linearities.sv,99|20): Local static variable with initializer requires 'static' keyword.
        int mean = 0;         // Promedio de la distribución
                 |
xmvlog: *W,VARIST (./models/currentSourceUnits_all_non_linearities.sv,126|17): Local static variable with initializer requires 'static' keyword.
        int std_dev = 20;     // Desviación estándar, sigma
                    |
xmvlog: *W,VARIST (./models/currentSourceUnits_all_non_linearities.sv,127|20): Local static variable with initializer requires 'static' keyword.
        real scale = 1000; // para escalar la desviación estándar y que sea 2%
                   |
xmvlog: *W,VARIST (./models/currentSourceUnits_all_non_linearities.sv,130|19): Local static variable with initializer requires 'static' keyword.
	module worklib.currentSourceUnits:sv
		errors: 0, warnings: 6
file: ./tb/currentSourceUnits_tb.sv
	module worklib.currentSourceUnits_tb:sv
		errors: 0, warnings: 0
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
	Top level design units:
		cds_rnm_pkg
		$unit_0x1b9ac963
		currentSourceUnits_tb
	Building instance overlay tables: .................... Done
	Using implicit TMP libraries; associated with library worklib
	Generating native compiled code:
		worklib.currentSourceUnits:sv <0x45cec808>
			streams:  14, words: 44949
		worklib.currentSourceUnits_tb:sv <0x3f60fdfb>
			streams:  34, words: 26473
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                 Instances  Unique
		Modules:                 2       2
		Verilog packages:        1       1
		Registers:             107     107
		Scalar wires:           31       -
		Vectored wires:          1       -
		Always blocks:           5       5
		Initial blocks:          9       9
		Pseudo assignments:     32       -
		Assertions:              4       4
		Compilation units:       1       1
		Simulation timescale:  1ps
	Writing initial simulation snapshot: worklib.currentSourceUnits_tb:sv
Loading snapshot worklib.currentSourceUnits_tb:sv .................... Done
SVSEED default: 1
[DMSINFO] Simulating with Xcelium Mixed-Signal App...
xcelium> source /eda/cadence/2024-25/RHELx86/XCELIUM_24.03.004/tools/xcelium/files/xmsimrc
xcelium> 
xcelium> # XM-Sim Command File
xcelium> # TOOL:	xmsim(64)	24.03-s004
xcelium> #
xcelium> #
xcelium> # You can restore this configuration with:
xcelium> #
xcelium> #      xrun -f xrun.f -input /home/msegper/Documents/TFM/current_source_units/restore.tcl
xcelium> #
xcelium> 
xcelium> set tcl_prompt1 {puts -nonewline "xcelium> "}
puts -nonewline "xcelium> "
xcelium> set tcl_prompt2 {puts -nonewline "> "}
puts -nonewline "> "
xcelium> set vlog_format %h
%h
xcelium> set vhdl_format %v
%v
xcelium> set real_precision 6
6
xcelium> set display_unit auto
auto
xcelium> set time_unit module
module
xcelium> set heap_garbage_size -200
-200
xcelium> set heap_garbage_time 0
0
xcelium> set assert_report_level note
note
xcelium> set assert_stop_level error
error
xcelium> set autoscope yes
yes
xcelium> set assert_1164_warnings yes
yes
xcelium> set pack_assert_off {}
xcelium> set severity_pack_assert_off {note warning}
note warning
xcelium> set assert_output_stop_level failed
failed
xcelium> set tcl_debug_level 0
0
xcelium> set relax_path_name 1
1
xcelium> set vhdl_vcdmap XX01ZX01X
XX01ZX01X
xcelium> set intovf_severity_level ERROR
ERROR
xcelium> set probe_screen_format 0
0
xcelium> set rangecnst_severity_level ERROR
ERROR
xcelium> set textio_severity_level ERROR
ERROR
xcelium> set vital_timing_checks_on 1
1
xcelium> set vlog_code_show_force 0
0
xcelium> set assert_count_attempts 1
1
xcelium> set tcl_all64 false
false
xcelium> set tcl_runerror_exit false
false
xcelium> set assert_report_incompletes 0
0
xcelium> set show_force 1
1
xcelium> set force_reset_by_reinvoke 0
0
xcelium> set tcl_relaxed_literal 0
0
xcelium> set probe_exclude_patterns {}
xcelium> set probe_packed_limit 4k
4k
xcelium> set probe_unpacked_limit 16k
16k
xcelium> set assert_internal_msg no
no
xcelium> set svseed 1
1
xcelium> set assert_reporting_mode 0
0
xcelium> set vcd_compact_mode 0
0
xcelium> set vhdl_forgen_loopindex_enum_pos 0
0
xcelium> set xmreplay_dc_debug 0
0
xcelium> set tcl_runcmd_interrupt next_command
next_command
xcelium> set tcl_sigval_prefix {#}
#
xcelium> alias . run
xcelium> alias indago verisium
xcelium> alias quit exit
xcelium> database -open -shm -into waves.shm waves -default
Created default SHM database waves
xcelium> probe -create -database waves currentSourceUnits_tb.dut.vssana currentSourceUnits_tb.dut.vddana_1p8 currentSourceUnits_tb.dut.vddana_0p8 currentSourceUnits_tb.dut.pdb currentSourceUnits_tb.dut.iref_500ua currentSourceUnits_tb.dut.atb_ena currentSourceUnits_tb.dut.atb1 currentSourceUnits_tb.dut.atb0 currentSourceUnits_tb.dut.Iout_binary_5 currentSourceUnits_tb.dut.Iout_binary_4 currentSourceUnits_tb.dut.Iout_binary_3 currentSourceUnits_tb.dut.Iout_binary_2 currentSourceUnits_tb.dut.Iout_binary_1 currentSourceUnits_tb.dut.Iout_binary_0_red currentSourceUnits_tb.dut.Iout_binary_0
Created probe 1
xcelium> probe -create -database waves currentSourceUnits_tb.dut.Iout_them_0 currentSourceUnits_tb.dut.Iout_them_1 currentSourceUnits_tb.dut.Iout_them_2 currentSourceUnits_tb.dut.Iout_them_3 currentSourceUnits_tb.dut.Iout_them_4 currentSourceUnits_tb.dut.Iout_them_5 currentSourceUnits_tb.dut.Iout_them_6 currentSourceUnits_tb.dut.Iout_them_7 currentSourceUnits_tb.dut.Iout_them_8 currentSourceUnits_tb.dut.Iout_them_9 currentSourceUnits_tb.dut.Iout_them_10 currentSourceUnits_tb.dut.Iout_them_11 currentSourceUnits_tb.dut.Iout_them_12 currentSourceUnits_tb.dut.Iout_them_13 currentSourceUnits_tb.dut.Iout_them_14 currentSourceUnits_tb.dut.Iout_them_15 currentSourceUnits_tb.dut.Iout_them_16
Created probe 2
xcelium> 
xcelium> simvision -input restore.tcl.svcf

-------------------------------------
Relinquished control to SimVision...
xcelium> 
xcelium> run
mismatch temporal = 0.0270 seed = 1647131094 media =0 sigma = 20
mismatch temporal = 0.0020 seed = -289871628 media =0 sigma = 20
mismatch temporal = -0.0130 seed = -882559483 media =0 sigma = 20
mismatch temporal = -0.0050 seed = -1595489963 media =0 sigma = 20
mismatch temporal = -0.0090 seed = -683839996 media =0 sigma = 20
mismatch temporal = -0.0260 seed = 1677312052 media =0 sigma = 20
mismatch temporal = 0.0110 seed = 968744563 media =0 sigma = 20
mismatch temporal = -0.0030 seed = -434172825 media =0 sigma = 20
mismatch temporal = 0.0350 seed = 1785419502 media =0 sigma = 20
mismatch temporal = -0.0350 seed = -1756486316 media =0 sigma = 20
mismatch temporal = -0.0030 seed = -259738831 media =0 sigma = 20
mismatch temporal = 0.0340 seed = -1786685995 media =0 sigma = 20
mismatch temporal = 0.0040 seed = 1004651839 media =0 sigma = 20
mismatch temporal = 0.0000 seed = 108804191 media =0 sigma = 20
mismatch temporal = 0.0240 seed = 2040667262 media =0 sigma = 20
mismatch temporal = 0.0080 seed = -1503757932 media =0 sigma = 20
mismatch temporal = 0.0180 seed = 1700834055 media =0 sigma = 20
mismatch temporal = -0.0460 seed = 1960714420 media =0 sigma = 20
mismatch temporal = 0.0040 seed = -415108424 media =0 sigma = 20
mismatch temporal = 0.0140 seed = -1168039664 media =0 sigma = 20
mismatch temporal = -0.0130 seed = 1418952621 media =0 sigma = 20
mismatch temporal = 0.0070 seed = -637034484 media =0 sigma = 20
mismatch temporal = -0.0290 seed = 1925184035 media =0 sigma = 20
mismatch temporal = -0.0040 seed = 313822460 media =0 sigma = 20
Barrido de iref_500ua:
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.105000000000000e-9 seed = -1009769139 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.024000000000000e-9 seed = 1770757959 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.059000000000000e-9 seed = 2029538782 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.269000000000000e-9 seed = -1497980754 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.202000000000000e-9 seed = -1807904338 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.005000000000000e-9 seed = 10657304 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.269000000000000e-9 seed = -1709492419 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.727000000000000e-9 seed = -2096392428 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.461000000000000e-9 seed = -773957061 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.052000000000000e-9 seed = 1901731235 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.005000000000000e-9 seed = 618173521 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.133000000000000e-9 seed = 235108489 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.112000000000000e-9 seed = -1386904529 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.683000000000000e-9 seed = 947295572 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.901000000000000e-9 seed = 1133700373 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.495000000000000e-9 seed = -2041953706 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.240000000000000e-9 seed = -867210118 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.443000000000000e-9 seed = 820459441 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.342000000000000e-9 seed = 1510779773 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.431000000000000e-9 seed = -629247586 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.397000000000000e-9 seed = 712931728 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.401000000000000e-9 seed = 563874389 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.605000000000000e-9 seed = 992109417 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.266000000000000e-9 seed = 1533979010 media =0.000000000000000 sigma = 0.000000001000000
iref_500ua = 0.000450 A
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.604000000000000e-9 seed = -1692395621 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.032000000000000e-9 seed = 828172533 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.033000000000000e-9 seed = -1638464960 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.826000000000000e-9 seed = 1985702005 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.503000000000000e-9 seed = 1603271524 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.112000000000000e-9 seed = -1327467644 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.167000000000000e-9 seed = 1670549747 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.137000000000000e-9 seed = -335148331 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.806000000000000e-9 seed = 1866875498 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.273000000000000e-9 seed = 432400225 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.694000000000000e-9 seed = -1258939105 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.052000000000000e-9 seed = 393613799 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.597000000000000e-9 seed = -1015419554 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.687000000000000e-9 seed = 2125602478 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.864000000000000e-9 seed = 1882749878 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.268000000000000e-9 seed = -840722776 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.022000000000000e-9 seed = -164437983 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.742000000000000e-9 seed = -1665127431 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.882000000000000e-9 seed = -1907193538 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.364000000000000e-9 seed = 1451627674 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.359000000000000e-9 seed = -2074675634 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.109000000000000e-9 seed = -215046683 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.990000000000000e-9 seed = 1239524862 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.364000000000000e-9 seed = -728474993 media =0.000000000000000 sigma = 0.000000001000000
iref_500ua = 0.000500 A
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.310000000000000e-9 seed = -647202630 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.333000000000000e-9 seed = -769406417 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.271000000000000e-9 seed = 461224541 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.220000000000000e-9 seed = 1328606474 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.819000000000000e-9 seed = 1476789021 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.776000000000000e-9 seed = 1054409211 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.225000000000000e-9 seed = 492577704 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.132000000000000e-9 seed = -661020020 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.161000000000000e-9 seed = -256328692 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.095000000000000e-9 seed = 1937930375 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.003000000000000e-9 seed = -553453278 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.570000000000000e-9 seed = -1836862270 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.147000000000000e-9 seed = 1956222469 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.368000000000000e-9 seed = -1669607341 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.558000000000000e-9 seed = -827272322 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.031000000000000e-9 seed = 1923545052 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.140000000000000e-9 seed = -1419390774 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.140000000000000e-9 seed = 572549107 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.607000000000000e-9 seed = -828298903 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.601000000000000e-9 seed = -827664268 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.835000000000000e-9 seed = -1326508347 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.750000000000000e-9 seed = 1066089789 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.031000000000000e-9 seed = -1309670523 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.291000000000000e-9 seed = 752786790 media =0.000000000000000 sigma = 0.000000001000000
iref_500ua = 0.000550 A
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.495000000000000e-9 seed = -1618167430 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.537000000000000e-9 seed = 759876727 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.831000000000000e-9 seed = -1124525202 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.498000000000000e-9 seed = -1239307434 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.001000000000000e-9 seed = -1289639418 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.234000000000000e-9 seed = 1481084406 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.698000000000000e-9 seed = 1257792990 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.731000000000000e-9 seed = 1229018388 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.941000000000000e-9 seed = 1881718122 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.829000000000000e-9 seed = 1792158382 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.501000000000000e-9 seed = 1666058203 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.167000000000000e-9 seed = -1379663607 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.006000000000000e-9 seed = -1304958971 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.221000000000000e-9 seed = -417572573 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.961000000000000e-9 seed = -2041480219 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.513000000000000e-9 seed = 994673339 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.289000000000000e-9 seed = -477260716 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.059000000000000e-9 seed = -1285879862 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.054000000000000e-9 seed = 357573187 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.702000000000000e-9 seed = -954014670 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.846000000000000e-9 seed = 1668382565 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.340000000000000e-9 seed = -508676225 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.224000000000000e-9 seed = -508957299 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.521000000000000e-9 seed = -773323080 media =0.000000000000000 sigma = 0.000000001000000
Barrido de vddana_1p8:
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.221000000000000e-9 seed = 502082308 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.600000000000000e-9 seed = 1362951183 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.776000000000000e-9 seed = 1196345634 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.703000000000000e-9 seed = 1731609609 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -3.306000000000000e-9 seed = -2123355595 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.104000000000000e-9 seed = 1272951067 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.456000000000000e-9 seed = -1597069902 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.235000000000000e-9 seed = -1633018199 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.557000000000000e-9 seed = -1755221795 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.286000000000000e-9 seed = 424532309 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.734000000000000e-9 seed = 1227051874 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.338000000000000e-9 seed = 1111680554 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.261000000000000e-9 seed = -499353532 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.021000000000000e-9 seed = 1252833904 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.526000000000000e-9 seed = -2147473035 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.381000000000000e-9 seed = 1324572919 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.397000000000000e-9 seed = 1313646624 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.029000000000000e-9 seed = -2133184059 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.012000000000000e-9 seed = -946071297 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.747000000000000e-9 seed = -1618462880 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.506000000000000e-9 seed = 1335553802 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.408000000000000e-9 seed = 623092545 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.580000000000000e-9 seed = -1458008782 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.480000000000000e-9 seed = 834682063 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.71 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.061000000000000e-9 seed = 318426413 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.412000000000000e-9 seed = 589665662 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.608000000000000e-9 seed = 1796131427 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.827000000000000e-9 seed = -1058628257 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.932000000000000e-9 seed = -1856570931 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.182000000000000e-9 seed = -352312415 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.023000000000000e-9 seed = -1265054756 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.784000000000000e-9 seed = -1249352704 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.578000000000000e-9 seed = -963326422 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.722000000000000e-9 seed = -1971785734 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.268000000000000e-9 seed = -1959263519 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.766000000000000e-9 seed = -1813461943 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.240000000000000e-9 seed = 350722637 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.026000000000000e-9 seed = -1655369357 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.578000000000000e-9 seed = 802879229 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.236000000000000e-9 seed = -368902009 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.210000000000000e-9 seed = -1448526541 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.320000000000000e-9 seed = -626272369 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.170000000000000e-9 seed = 1390246069 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.358000000000000e-9 seed = 982733663 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.392000000000000e-9 seed = -1077249637 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.246000000000000e-9 seed = 1047161834 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.520000000000000e-9 seed = -719671496 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.963000000000000e-9 seed = -2124376922 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.72 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.686000000000000e-9 seed = 1004180243 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.197000000000000e-9 seed = -1521427834 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.047000000000000e-9 seed = 390455454 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.142000000000000e-9 seed = 293862346 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.591000000000000e-9 seed = -813584148 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.408000000000000e-9 seed = -1328914726 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.863000000000000e-9 seed = 1610899453 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.751000000000000e-9 seed = 2050231647 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.850000000000000e-9 seed = -1336554192 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.253000000000000e-9 seed = 2067687994 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.707000000000000e-9 seed = 1426950169 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.209000000000000e-9 seed = 1587410144 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.676000000000000e-9 seed = -1036981603 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.105000000000000e-9 seed = -974393780 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.169000000000000e-9 seed = -485710119 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.452000000000000e-9 seed = 921657030 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.222000000000000e-9 seed = 1940790954 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.722000000000000e-9 seed = 1944261871 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.327000000000000e-9 seed = 473485894 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.328000000000000e-9 seed = 1501891939 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.936000000000000e-9 seed = -1171319880 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.107000000000000e-9 seed = 1662444526 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.588000000000000e-9 seed = -1223083912 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.867000000000000e-9 seed = 1118818694 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.73 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.405000000000000e-9 seed = 2091071082 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.163000000000000e-9 seed = 241846656 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.658000000000000e-9 seed = 2006841383 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.075000000000000e-9 seed = -658106358 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.262000000000000e-9 seed = -1630622147 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.772000000000000e-9 seed = -1956772490 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.465000000000000e-9 seed = 1590249797 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.271000000000000e-9 seed = 1466282721 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.501000000000000e-9 seed = 1619485490 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.150000000000000e-9 seed = -352713211 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.269000000000000e-9 seed = -1642224245 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.754000000000000e-9 seed = -1708094783 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.270000000000000e-9 seed = -596569056 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.347000000000000e-9 seed = -1143193203 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.222000000000000e-9 seed = 1765351215 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.014000000000000e-9 seed = -1375609516 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.818000000000000e-9 seed = 1668249003 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.698000000000000e-9 seed = 997882599 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.124000000000000e-9 seed = -1905847177 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.250000000000000e-9 seed = 853715870 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.738000000000000e-9 seed = 1378542360 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.736000000000000e-9 seed = -985043392 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.535000000000000e-9 seed = 1838310212 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.341000000000000e-9 seed = -1600639624 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.74 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.494000000000000e-9 seed = 1300538221 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.552000000000000e-9 seed = 1893403675 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.250000000000000e-9 seed = -1429876715 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.079000000000000e-9 seed = -127278742 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.527000000000000e-9 seed = 1915744552 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.640000000000000e-9 seed = -939374664 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.466000000000000e-9 seed = 902468241 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.090000000000000e-9 seed = 1996975393 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.587000000000000e-9 seed = 802084792 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.823000000000000e-9 seed = -1089058663 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.856000000000000e-9 seed = -1136198024 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.694000000000000e-9 seed = 920297813 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.863000000000000e-9 seed = 1767340225 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.317000000000000e-9 seed = -1496657534 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.038000000000000e-9 seed = -226882126 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.219000000000000e-9 seed = -1413480666 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.146000000000000e-9 seed = 1444653386 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.471000000000000e-9 seed = -2025830640 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.555000000000000e-9 seed = -945581924 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.514000000000000e-9 seed = -705413371 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.305000000000000e-9 seed = -1972695624 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.070000000000000e-9 seed = 164065325 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.173000000000000e-9 seed = -1831911544 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.915000000000000e-9 seed = 1158449772 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.75 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.666000000000000e-9 seed = 1056610790 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.047000000000000e-9 seed = -207419835 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.505000000000000e-9 seed = 1801835981 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.826000000000000e-9 seed = 1449905241 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.115000000000000e-9 seed = 1408965630 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.006000000000000e-9 seed = -47397868 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.094000000000000e-9 seed = 142709295 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.381000000000000e-9 seed = 550447359 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.182000000000000e-9 seed = -1940378317 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.319000000000000e-9 seed = 1777374291 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.044000000000000e-9 seed = -1960234824 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.301000000000000e-9 seed = -1253133272 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.427000000000000e-9 seed = 1663813864 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.254000000000000e-9 seed = -652137669 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.858000000000000e-9 seed = -1090009510 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.539000000000000e-9 seed = -819209151 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.542000000000000e-9 seed = 1638756670 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.582000000000000e-9 seed = 1593729004 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.508000000000000e-9 seed = 1980134373 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.178000000000000e-9 seed = -1942758398 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.450000000000000e-9 seed = 1192552464 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.632000000000000e-9 seed = -1695007497 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.059000000000000e-9 seed = 205125657 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.408000000000000e-9 seed = 743395999 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.76 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 3.222000000000000e-9 seed = -2128045330 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.196000000000000e-9 seed = -1299845327 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.912000000000000e-9 seed = -1840041389 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.235000000000000e-9 seed = 585897987 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.851000000000000e-9 seed = -2130675166 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.072000000000000e-9 seed = 1745521219 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.467000000000000e-9 seed = 821854111 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.690000000000000e-9 seed = -939290556 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.619000000000000e-9 seed = -1688434002 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.716000000000000e-9 seed = 1277168404 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.685000000000000e-9 seed = 1548041566 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.063000000000000e-9 seed = -2073681455 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.699000000000000e-9 seed = 1763675663 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.524000000000000e-9 seed = -2077442895 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.638000000000000e-9 seed = 919251976 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.834000000000000e-9 seed = 2141975579 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.539000000000000e-9 seed = 2019350163 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.888000000000000e-9 seed = -1156281278 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.772000000000000e-9 seed = -1355183437 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.895000000000000e-9 seed = 1570106343 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.301000000000000e-9 seed = -908088276 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.837000000000000e-9 seed = -1909514482 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.775000000000000e-9 seed = -1695737946 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.060000000000000e-9 seed = 95318438 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.77 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.391000000000000e-9 seed = 1655808695 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.256000000000000e-9 seed = -531496473 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.180000000000000e-9 seed = 1385274510 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.025000000000000e-9 seed = -1584219956 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.023000000000000e-9 seed = -1761127190 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.465000000000000e-9 seed = 1196954872 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.033000000000000e-9 seed = -1170208108 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.152000000000000e-9 seed = 355705721 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.811000000000000e-9 seed = -1694120349 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.096000000000000e-9 seed = 1532220062 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.356000000000000e-9 seed = -1682448999 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.876000000000000e-9 seed = 1550419264 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.846000000000000e-9 seed = 1452728862 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.385000000000000e-9 seed = 756081862 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.276000000000000e-9 seed = 1601129053 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.449000000000000e-9 seed = 1253447871 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.575000000000000e-9 seed = -2061500038 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.871000000000000e-9 seed = 1291976305 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.173000000000000e-9 seed = 568996711 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.347000000000000e-9 seed = -550288141 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.312000000000000e-9 seed = -527467550 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.955000000000000e-9 seed = -1658002176 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.830000000000000e-9 seed = -2037691464 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.226000000000000e-9 seed = -338201943 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.78 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.116000000000000e-9 seed = 1377098420 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.439000000000000e-9 seed = -1769077783 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.093000000000000e-9 seed = 156053108 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.613000000000000e-9 seed = -824575137 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.215000000000000e-9 seed = -386689182 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.411000000000000e-9 seed = 624154179 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.845000000000000e-9 seed = 2055473414 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.517000000000000e-9 seed = -1628291056 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.054000000000000e-9 seed = -82187037 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.685000000000000e-9 seed = 935546186 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.296000000000000e-9 seed = -448276566 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.318000000000000e-9 seed = -521592205 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.255000000000000e-9 seed = -1452156913 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.939000000000000e-9 seed = -2037573901 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.136000000000000e-9 seed = 353852387 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.417000000000000e-9 seed = 1088544776 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.275000000000000e-9 seed = 1524317924 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.469000000000000e-9 seed = 716408274 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.755000000000000e-9 seed = -1341998843 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.768000000000000e-9 seed = 1120248996 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.225000000000000e-9 seed = -550143298 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.706000000000000e-9 seed = 1774972427 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.223000000000000e-9 seed = -514227552 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.560000000000000e-9 seed = 1413147551 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.79 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.692000000000000e-9 seed = -917953617 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.025000000000000e-9 seed = -1554397732 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.309000000000000e-9 seed = 772093167 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.490000000000000e-9 seed = 1775528358 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.850000000000000e-9 seed = -1123232672 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.931000000000000e-9 seed = -2128957114 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.279000000000000e-9 seed = 717545430 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.578000000000000e-9 seed = 1668962240 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.196000000000000e-9 seed = 1616056630 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.481000000000000e-9 seed = 680072794 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.011000000000000e-9 seed = 219188964 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.809000000000000e-9 seed = 1504321435 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.294000000000000e-9 seed = 423637834 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.702000000000000e-9 seed = -1429214392 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.704000000000000e-9 seed = 1852224252 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.626000000000000e-9 seed = -1842251436 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.088000000000000e-9 seed = -132804478 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.039000000000000e-9 seed = -98497241 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.947000000000000e-9 seed = -1770700082 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.886000000000000e-9 seed = -1334882930 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.262000000000000e-9 seed = 2081477654 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.464000000000000e-9 seed = 1589850874 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.039000000000000e-9 seed = 213373481 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.682000000000000e-9 seed = 1054182156 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.80 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.214000000000000e-9 seed = 1366132959 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.548000000000000e-9 seed = -1593017081 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.325000000000000e-9 seed = -508490327 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.407000000000000e-9 seed = -1722154125 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.307000000000000e-9 seed = 866476144 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.322000000000000e-9 seed = 2027340366 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.618000000000000e-9 seed = 970906234 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.762000000000000e-9 seed = -1914487900 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.170000000000000e-9 seed = 1463915199 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.820000000000000e-9 seed = 1107061355 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.714000000000000e-9 seed = 938951903 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.395000000000000e-9 seed = -862378068 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.177000000000000e-9 seed = 290312265 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.348000000000000e-9 seed = 1721703102 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.879000000000000e-9 seed = -1996359308 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.350000000000000e-9 seed = -1382913038 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.379000000000000e-9 seed = 1748122821 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.905000000000000e-9 seed = 1148110339 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.356000000000000e-9 seed = -1269995325 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.830000000000000e-9 seed = -1736643598 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.335000000000000e-9 seed = -577645322 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.213000000000000e-9 seed = 1766171869 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.517000000000000e-9 seed = 1660689573 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.655000000000000e-9 seed = 1595995031 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.81 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.331000000000000e-9 seed = -733145045 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.108000000000000e-9 seed = -1635716116 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.283000000000000e-9 seed = -580168559 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.098000000000000e-9 seed = 190943535 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.414000000000000e-9 seed = 1061080593 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.054000000000000e-9 seed = -782808726 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.183000000000000e-9 seed = -632655322 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.154000000000000e-9 seed = 945123612 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.252000000000000e-9 seed = 1439517501 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.935000000000000e-9 seed = -1167093548 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.304000000000000e-9 seed = -2013131789 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.741000000000000e-9 seed = 1420957478 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.408000000000000e-9 seed = 1680790045 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.164000000000000e-9 seed = 796268814 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.026000000000000e-9 seed = -51035176 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.536000000000000e-9 seed = 801635214 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.616000000000000e-9 seed = 2102288094 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.085000000000000e-9 seed = -236573930 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.187000000000000e-9 seed = -358768982 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.261000000000000e-9 seed = 1477170837 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.556000000000000e-9 seed = -1837209507 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.628000000000000e-9 seed = -2056221738 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.285000000000000e-9 seed = -1705242368 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.137000000000000e-9 seed = 339630777 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.82 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.696000000000000e-9 seed = -1235586666 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.691000000000000e-9 seed = -925550643 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.965000000000000e-9 seed = 1663907042 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.417000000000000e-9 seed = 1777513434 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.178000000000000e-9 seed = 1939847380 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.670000000000000e-9 seed = -1716783596 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.371000000000000e-9 seed = -575558491 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.244000000000000e-9 seed = 2042272369 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.914000000000000e-9 seed = 1187623341 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.623000000000000e-9 seed = 1198871712 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.197000000000000e-9 seed = -1400880246 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.079000000000000e-9 seed = -155964476 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.499000000000000e-9 seed = 754528878 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.134000000000000e-9 seed = 1447645311 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.187000000000000e-9 seed = -1617917327 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.655000000000000e-9 seed = -2137257183 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.393000000000000e-9 seed = -987203906 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.321000000000000e-9 seed = 2115681355 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.035000000000000e-9 seed = 58266276 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.731000000000000e-9 seed = -1898928433 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.389000000000000e-9 seed = 1627906652 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.842000000000000e-9 seed = -1372733835 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.500000000000000e-9 seed = 715507890 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.082000000000000e-9 seed = -2114557964 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.83 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.221000000000000e-9 seed = -1431015856 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.650000000000000e-9 seed = 1345603121 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.144000000000000e-9 seed = -1445937663 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.790000000000000e-9 seed = -1029286010 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.671000000000000e-9 seed = 2078793523 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.126000000000000e-9 seed = -1418644515 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.709000000000000e-9 seed = -980106909 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.380000000000000e-9 seed = -1542073365 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.631000000000000e-9 seed = -880433571 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.271000000000000e-9 seed = 1044809845 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.658000000000000e-9 seed = 1517798821 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.011000000000000e-9 seed = -130981068 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.148000000000000e-9 seed = -1373291059 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.274000000000000e-9 seed = 475445595 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.206000000000000e-9 seed = 301728302 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.029000000000000e-9 seed = 1593545286 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.317000000000000e-9 seed = 1784281366 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.277000000000000e-9 seed = 1470354345 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.139000000000000e-9 seed = 206566050 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.153000000000000e-9 seed = 1714423821 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.013000000000000e-9 seed = 195828205 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.493000000000000e-9 seed = 2058788490 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.003000000000000e-9 seed = -6190052 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.284000000000000e-9 seed = 408755163 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.84 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.166000000000000e-9 seed = 1037491008 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.163000000000000e-9 seed = 280093146 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.227000000000000e-9 seed = -1673517877 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.317000000000000e-9 seed = -1967851254 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.313000000000000e-9 seed = 1979242469 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.244000000000000e-9 seed = 1982576501 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.483000000000000e-9 seed = -1073669336 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.375000000000000e-9 seed = 533187323 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.786000000000000e-9 seed = -1750520916 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.514000000000000e-9 seed = 1692998932 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.494000000000000e-9 seed = 770930396 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.471000000000000e-9 seed = -1610899750 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.462000000000000e-9 seed = -800316492 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.166000000000000e-9 seed = -1639972255 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.164000000000000e-9 seed = 1384023616 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.657000000000000e-9 seed = 2069011677 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.297000000000000e-9 seed = 507204992 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.172000000000000e-9 seed = -1382814047 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.048000000000000e-9 seed = 1704428072 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.757000000000000e-9 seed = -1066434908 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.884000000000000e-9 seed = -1427043167 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.078000000000000e-9 seed = 1061284763 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.773000000000000e-9 seed = -1603408801 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.579000000000000e-9 seed = 1787161271 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.85 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.171000000000000e-9 seed = -294859930 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.408000000000000e-9 seed = -790312415 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.766000000000000e-9 seed = -2098653072 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.171000000000000e-9 seed = 353811740 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.522000000000000e-9 seed = -1538897504 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.548000000000000e-9 seed = -1710857634 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.760000000000000e-9 seed = -1382611663 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.658000000000000e-9 seed = 2070291978 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.808000000000000e-9 seed = -1534650880 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.012000000000000e-9 seed = -69824447 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.504000000000000e-9 seed = 1594142466 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.780000000000000e-9 seed = -1170952733 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.517000000000000e-9 seed = -894395852 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.635000000000000e-9 seed = 853636261 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.662000000000000e-9 seed = 881695712 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.693000000000000e-9 seed = 1985150677 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.754000000000000e-9 seed = 1303490011 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.520000000000000e-9 seed = -1821467466 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.254000000000000e-9 seed = -1492616458 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.154000000000000e-9 seed = -1180064213 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.981000000000000e-9 seed = -1240502624 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.604000000000000e-9 seed = -1541358159 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.261000000000000e-9 seed = -565917307 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.390000000000000e-9 seed = 612955578 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.86 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.502000000000000e-9 seed = 1670733151 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.403000000000000e-9 seed = -1469135419 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.394000000000000e-9 seed = 602584305 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.097000000000000e-9 seed = 1876699686 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.057000000000000e-9 seed = 1369673232 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.423000000000000e-9 seed = 1616761748 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.554000000000000e-9 seed = -1706638107 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.966000000000000e-9 seed = 1850911917 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.748000000000000e-9 seed = -1003842140 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.056000000000000e-9 seed = 1470030465 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.608000000000000e-9 seed = 1274056900 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.233000000000000e-9 seed = 387565919 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.156000000000000e-9 seed = 1397059061 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.372000000000000e-9 seed = -1854500919 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.030000000000000e-9 seed = -1986474043 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.250000000000000e-9 seed = 1557460549 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.091000000000000e-9 seed = -2062931135 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.940000000000000e-9 seed = 1424671536 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.098000000000000e-9 seed = 2106775007 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.280000000000000e-9 seed = -1812108428 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.869000000000000e-9 seed = -1215246190 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.340000000000000e-9 seed = -519040274 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.017000000000000e-9 seed = -28999674 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.539000000000000e-9 seed = -1067761061 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.87 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.198000000000000e-9 seed = 1550865821 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.018000000000000e-9 seed = -1535728252 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.176000000000000e-9 seed = 1385043727 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.429000000000000e-9 seed = -1036860912 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.437000000000000e-9 seed = 1155053751 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.732000000000000e-9 seed = -991114521 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.200000000000000e-9 seed = -1931793724 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.580000000000000e-9 seed = 801300041 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.644000000000000e-9 seed = 1765391824 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.294000000000000e-9 seed = 1611798724 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.422000000000000e-9 seed = 1784792850 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.753000000000000e-9 seed = 1878562991 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.849000000000000e-9 seed = 1920300209 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.319000000000000e-9 seed = 1673003485 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.288000000000000e-9 seed = -434291790 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.390000000000000e-9 seed = -1362482456 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.198000000000000e-9 seed = 1419677498 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.170000000000000e-9 seed = 1186525618 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.477000000000000e-9 seed = -938142766 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.901000000000000e-9 seed = -1299657281 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.679000000000000e-9 seed = 1740241643 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.519000000000000e-9 seed = 1637402973 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.350000000000000e-9 seed = 717347651 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.265000000000000e-9 seed = -1385626251 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.88 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.072000000000000e-9 seed = -1316492123 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.386000000000000e-9 seed = 2023840571 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.074000000000000e-9 seed = 1088649169 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.107000000000000e-9 seed = 1323676031 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.200000000000000e-9 seed = -1361329653 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.145000000000000e-9 seed = -1922238192 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.226000000000000e-9 seed = 914693802 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.312000000000000e-9 seed = 494023893 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.557000000000000e-9 seed = 1338887561 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.536000000000000e-9 seed = 1427540666 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.572000000000000e-9 seed = -1045735449 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.848000000000000e-9 seed = -1079809631 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.312000000000000e-9 seed = -878754672 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.745000000000000e-9 seed = -1204584375 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.523000000000000e-9 seed = -734889032 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.347000000000000e-9 seed = 503000616 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.217000000000000e-9 seed = 1578987227 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.174000000000000e-9 seed = 320988705 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.496000000000000e-9 seed = 726862073 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.444000000000000e-9 seed = -1162754210 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.323000000000000e-9 seed = 1500271683 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.213000000000000e-9 seed = 1795142495 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.998000000000000e-9 seed = -1225611898 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.827000000000000e-9 seed = -1997309912 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.89 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.538000000000000e-9 seed = -1051921451 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.982000000000000e-9 seed = 1804146292 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.182000000000000e-9 seed = 1637059773 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.136000000000000e-9 seed = -1748209016 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.402000000000000e-9 seed = -1559094784 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.671000000000000e-9 seed = -902012189 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.566000000000000e-9 seed = -1688343304 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.569000000000000e-9 seed = 1182406234 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.708000000000000e-9 seed = -1283781908 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.194000000000000e-9 seed = -1879449819 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.025000000000000e-9 seed = -1377232675 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.027000000000000e-9 seed = -178945257 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.844000000000000e-9 seed = 1552822906 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.534000000000000e-9 seed = 1565281739 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.659000000000000e-9 seed = -1213101365 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.812000000000000e-9 seed = 1129288075 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.428000000000000e-9 seed = -1568183160 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.937000000000000e-9 seed = -1235835208 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.122000000000000e-9 seed = -795175915 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.460000000000000e-9 seed = 874186264 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.442000000000000e-9 seed = -688127724 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.075000000000000e-9 seed = 2092014440 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.154000000000000e-9 seed = 228775303 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.776000000000000e-9 seed = 1064222845 media =0.000000000000000 sigma = 0.000000001000000
Barrido de vddana_0p8:
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.704000000000000e-9 seed = -1292689721 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.272000000000000e-9 seed = 411878472 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.446000000000000e-9 seed = -630526577 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.450000000000000e-9 seed = -671180368 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.216000000000000e-9 seed = 1112487684 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.333000000000000e-9 seed = 833580762 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.081000000000000e-9 seed = 347250936 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.487000000000000e-9 seed = 2105012484 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.158000000000000e-9 seed = 1890292154 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.616000000000000e-9 seed = 1088338270 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.476000000000000e-9 seed = 1927619975 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.278000000000000e-9 seed = -1469008979 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.043000000000000e-9 seed = 2117147917 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.915000000000000e-9 seed = 1589383086 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.075000000000000e-9 seed = -728020572 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.707000000000000e-9 seed = 1096461236 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.093000000000000e-9 seed = -1524537469 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.638000000000000e-9 seed = 1945902352 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.116000000000000e-9 seed = -1637899097 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 3.127000000000000e-9 seed = 2105787603 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.166000000000000e-9 seed = -2030966012 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.121000000000000e-9 seed = -2111898654 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.716000000000000e-9 seed = 1706983967 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.707000000000000e-9 seed = -946435267 media =0.000000000000000 sigma = 0.000000001000000
vddana_0p8 = 0.76 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.823000000000000e-9 seed = -1261345992 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.180000000000000e-9 seed = 833844813 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.519000000000000e-9 seed = 1578684034 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.057000000000000e-9 seed = -1382287402 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.245000000000000e-9 seed = 2040866563 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.044000000000000e-9 seed = -235401811 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.138000000000000e-9 seed = -913952158 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.655000000000000e-9 seed = -1569884517 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.737000000000000e-9 seed = 1420762294 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.826000000000000e-9 seed = 1101209485 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.587000000000000e-9 seed = -2061422188 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.636000000000000e-9 seed = 904658392 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.358000000000000e-9 seed = -630346227 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.656000000000000e-9 seed = -1618052338 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.823000000000000e-9 seed = 2146728177 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.199000000000000e-9 seed = 1727730830 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.648000000000000e-9 seed = 1756043689 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.319000000000000e-9 seed = -2016057982 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.077000000000000e-9 seed = 1581800365 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.428000000000000e-9 seed = -628678428 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.075000000000000e-9 seed = 116188174 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.333000000000000e-9 seed = -511852524 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.177000000000000e-9 seed = 262338055 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.792000000000000e-9 seed = 1031442970 media =0.000000000000000 sigma = 0.000000001000000
vddana_0p8 = 0.77 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.680000000000000e-9 seed = 1033499857 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.451000000000000e-9 seed = 694379452 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.672000000000000e-9 seed = -1105674217 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.099000000000000e-9 seed = 1593671109 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.696000000000000e-9 seed = 929368887 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.033000000000000e-9 seed = -260132422 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.576000000000000e-9 seed = -1025484483 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.497000000000000e-9 seed = 784269565 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.749000000000000e-9 seed = -1780784449 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.687000000000000e-9 seed = 1923326087 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.309000000000000e-9 seed = -1482402834 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.304000000000000e-9 seed = -1516233934 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.359000000000000e-9 seed = -554717411 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.641000000000000e-9 seed = -1236814917 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.806000000000000e-9 seed = 1829316948 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.045000000000000e-9 seed = -403000562 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.022000000000000e-9 seed = 1680442175 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.014000000000000e-9 seed = 281665319 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.828000000000000e-9 seed = -1720286139 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.994000000000000e-9 seed = -1225913317 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.637000000000000e-9 seed = 1799657882 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.222000000000000e-9 seed = -1588273477 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.642000000000000e-9 seed = -1992048079 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.570000000000000e-9 seed = 886821643 media =0.000000000000000 sigma = 0.000000001000000
vddana_0p8 = 0.78 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.482000000000000e-9 seed = 1419385506 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.781000000000000e-9 seed = 1179290958 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.082000000000000e-9 seed = -261931674 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.226000000000000e-9 seed = 334052111 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.654000000000000e-9 seed = 1010359153 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.603000000000000e-9 seed = 896579817 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.742000000000000e-9 seed = 1158745559 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.532000000000000e-9 seed = 731464309 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.978000000000000e-9 seed = 1315715494 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.480000000000000e-9 seed = 1980910528 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.254000000000000e-9 seed = 1540537878 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.368000000000000e-9 seed = -1528914853 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.395000000000000e-9 seed = 558269989 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.203000000000000e-9 seed = -1119337321 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.046000000000000e-9 seed = 97293676 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.651000000000000e-9 seed = 2099362105 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.959000000000000e-9 seed = 1879797213 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.570000000000000e-9 seed = 779404719 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.007000000000000e-9 seed = 241023728 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.979000000000000e-9 seed = 1896195804 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.561000000000000e-9 seed = -1202856967 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.868000000000000e-9 seed = 1386652754 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.369000000000000e-9 seed = -535175395 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.588000000000000e-9 seed = -1514349717 media =0.000000000000000 sigma = 0.000000001000000
vddana_0p8 = 0.79 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.023000000000000e-9 seed = 79501643 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.030000000000000e-9 seed = -1928840865 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.778000000000000e-9 seed = 2002832608 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.486000000000000e-9 seed = -1979620940 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.666000000000000e-9 seed = 930870809 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.897000000000000e-9 seed = -1445467528 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.717000000000000e-9 seed = 1011208568 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.728000000000000e-9 seed = -1395088970 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.834000000000000e-9 seed = -1384051424 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.498000000000000e-9 seed = 2040186283 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.344000000000000e-9 seed = -699053020 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.107000000000000e-9 seed = 452244460 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.026000000000000e-9 seed = -2113528842 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.886000000000000e-9 seed = -1855498510 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.416000000000000e-9 seed = 2143197897 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.189000000000000e-9 seed = -452034683 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.377000000000000e-9 seed = 1268532431 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.107000000000000e-9 seed = -743040507 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.466000000000000e-9 seed = 806405435 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.178000000000000e-9 seed = -280546946 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.442000000000000e-9 seed = -683528603 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.896000000000000e-9 seed = -1686216435 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.162000000000000e-9 seed = -719280788 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.256000000000000e-9 seed = -375350054 media =0.000000000000000 sigma = 0.000000001000000
vddana_0p8 = 0.80 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.388000000000000e-9 seed = 553502745 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.422000000000000e-9 seed = -1647701304 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.000000000000000e-9 seed = 1604599416 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.515000000000000e-9 seed = -1113469052 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.878000000000000e-9 seed = -1509516160 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.034000000000000e-9 seed = -1877625294 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.640000000000000e-9 seed = -1720829827 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.089000000000000e-9 seed = -1426921271 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.057000000000000e-9 seed = -1404802696 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.191000000000000e-9 seed = -459088031 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.055000000000000e-9 seed = 98330097 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.111000000000000e-9 seed = -196281465 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.318000000000000e-9 seed = 566455370 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.262000000000000e-9 seed = -1533502674 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.976000000000000e-9 seed = -1265351331 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.262000000000000e-9 seed = -1452579075 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.060000000000000e-9 seed = 2056572470 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.647000000000000e-9 seed = -1458289538 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.128000000000000e-9 seed = -285954623 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.880000000000000e-9 seed = -1453994605 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.054000000000000e-9 seed = -1919587665 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.759000000000000e-9 seed = 1021504234 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.098000000000000e-9 seed = -1903141720 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.446000000000000e-9 seed = 2055362017 media =0.000000000000000 sigma = 0.000000001000000
vddana_0p8 = 0.81 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.352000000000000e-9 seed = -522651418 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.497000000000000e-9 seed = -873439925 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.296000000000000e-9 seed = -1583414234 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.798000000000000e-9 seed = -1146677524 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.011000000000000e-9 seed = -1606073426 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.345000000000000e-9 seed = -1890788817 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.389000000000000e-9 seed = -612972537 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.003000000000000e-9 seed = -76384914 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.040000000000000e-9 seed = 102440846 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.573000000000000e-9 seed = 1019135634 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.378000000000000e-9 seed = 1741388088 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.742000000000000e-9 seed = -1378643069 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.256000000000000e-9 seed = -1490933390 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.895000000000000e-9 seed = -1297121253 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.458000000000000e-9 seed = -2111085557 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.009000000000000e-9 seed = -109490436 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.378000000000000e-9 seed = -551561492 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.179000000000000e-9 seed = 308204443 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.014000000000000e-9 seed = 1288577626 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.687000000000000e-9 seed = 2071150363 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.664000000000000e-9 seed = -1724296897 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.659000000000000e-9 seed = 900317556 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.818000000000000e-9 seed = 1925605577 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.690000000000000e-9 seed = 2069930482 media =0.000000000000000 sigma = 0.000000001000000
vddana_0p8 = 0.82 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.144000000000000e-9 seed = 216126522 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.900000000000000e-9 seed = -1418384145 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.849000000000000e-9 seed = 1987303636 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.822000000000000e-9 seed = -1062904980 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.235000000000000e-9 seed = -490703862 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.043000000000000e-9 seed = -1276736949 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.482000000000000e-9 seed = 2047082814 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.375000000000000e-9 seed = -859835237 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.464000000000000e-9 seed = 1085855725 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.503000000000000e-9 seed = -788861399 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.768000000000000e-9 seed = -1800996197 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.446000000000000e-9 seed = 1644786754 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.945000000000000e-9 seed = -1175917676 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.450000000000000e-9 seed = -636312206 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.793000000000000e-9 seed = -1928928269 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.164000000000000e-9 seed = 1214905122 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.233000000000000e-9 seed = 925541014 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.471000000000000e-9 seed = 1032970189 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.198000000000000e-9 seed = 1921725465 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.603000000000000e-9 seed = -1932274392 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.873000000000000e-9 seed = -2072347761 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.205000000000000e-9 seed = 2144268818 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.905000000000000e-9 seed = 1917533360 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.897000000000000e-9 seed = 1169797316 media =0.000000000000000 sigma = 0.000000001000000
vddana_0p8 = 0.83 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.128000000000000e-9 seed = 260827608 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.484000000000000e-9 seed = -1817320652 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.921000000000000e-9 seed = 1313397143 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.165000000000000e-9 seed = 540308114 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.024000000000000e-9 seed = 2031739238 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.567000000000000e-9 seed = -1181133686 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.652000000000000e-9 seed = 2106642556 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.893000000000000e-9 seed = -1203324669 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.760000000000000e-9 seed = -2068919628 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.432000000000000e-9 seed = -604766060 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.437000000000000e-9 seed = 1557131334 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.125000000000000e-9 seed = 1914910562 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.140000000000000e-9 seed = 1269630704 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.047000000000000e-9 seed = -2032735275 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.544000000000000e-9 seed = 772353600 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.004000000000000e-9 seed = 22311457 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.053000000000000e-9 seed = 946399511 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.919000000000000e-9 seed = 1469206920 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.980000000000000e-9 seed = -1219580883 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.894000000000000e-9 seed = -1763502237 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.115000000000000e-9 seed = 1356993415 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.568000000000000e-9 seed = 1469403402 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.520000000000000e-9 seed = -2046523379 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.803000000000000e-9 seed = 1773441394 media =0.000000000000000 sigma = 0.000000001000000
vddana_0p8 = 0.84 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.382000000000000e-9 seed = -907281464 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.175000000000000e-9 seed = 1486858000 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.774000000000000e-9 seed = -1982528658 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.053000000000000e-9 seed = -251609271 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.352000000000000e-9 seed = -1711476628 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.855000000000000e-9 seed = 1223584438 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.896000000000000e-9 seed = 2033532856 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.881000000000000e-9 seed = -2078773023 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.384000000000000e-9 seed = -1024922434 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.360000000000000e-9 seed = -731050487 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.826000000000000e-9 seed = 1609772206 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.439000000000000e-9 seed = 1944036450 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.878000000000000e-9 seed = 1824816040 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.634000000000000e-9 seed = -1174134188 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.314000000000000e-9 seed = -1554997021 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.396000000000000e-9 seed = -791494928 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.619000000000000e-9 seed = -1917356809 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.282000000000000e-9 seed = 1476008741 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.712000000000000e-9 seed = -1577426729 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.877000000000000e-9 seed = -1315419083 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.412000000000000e-9 seed = -1569375199 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.341000000000000e-9 seed = -1199042529 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.748000000000000e-9 seed = 1251461412 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.669000000000000e-9 seed = -2078734500 media =0.000000000000000 sigma = 0.000000001000000
Barrido de atb_ena:
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.317000000000000e-9 seed = 559769339 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.892000000000000e-9 seed = -1123330520 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.396000000000000e-9 seed = 1841977829 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.765000000000000e-9 seed = 1118921351 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.438000000000000e-9 seed = 1152535670 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.590000000000000e-9 seed = -1061117637 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.368000000000000e-9 seed = 572127654 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.085000000000000e-9 seed = -1307432962 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.382000000000000e-9 seed = 627999245 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.988000000000000e-9 seed = 1355217987 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.295000000000000e-9 seed = -424957374 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.051000000000000e-9 seed = 83945854 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.026000000000000e-9 seed = -352705032 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.396000000000000e-9 seed = -1592004847 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.980000000000000e-9 seed = 1876379711 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.767000000000000e-9 seed = -1852687382 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.981000000000000e-9 seed = 2047277049 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.060000000000000e-9 seed = 1399810022 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.038000000000000e-9 seed = -1890990742 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.069000000000000e-9 seed = 574165662 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.955000000000000e-9 seed = -1184642875 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.308000000000000e-9 seed = -610454459 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.635000000000000e-9 seed = 1095698830 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.057000000000000e-9 seed = -2029423925 media =0.000000000000000 sigma = 0.000000001000000
atb_ena = 00
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.653000000000000e-9 seed = 1702265920 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.465000000000000e-9 seed = 819763308 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.245000000000000e-9 seed = -396732601 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.269000000000000e-9 seed = 1533398652 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.718000000000000e-9 seed = 1552741410 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.671000000000000e-9 seed = 1129126459 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.097000000000000e-9 seed = -153517306 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.095000000000000e-9 seed = -275988253 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.541000000000000e-9 seed = 973997728 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.568000000000000e-9 seed = -957237851 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.507000000000000e-9 seed = 1416514773 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.094000000000000e-9 seed = -139723590 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.584000000000000e-9 seed = -1687973432 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.060000000000000e-9 seed = 925828764 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.170000000000000e-9 seed = 1379586055 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.987000000000000e-9 seed = 1235707823 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.636000000000000e-9 seed = 1250743845 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.891000000000000e-9 seed = -1830628526 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.731000000000000e-9 seed = 969229931 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.100000000000000e-9 seed = 151850876 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.446000000000000e-9 seed = -1656248851 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.586000000000000e-9 seed = -1258909620 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.084000000000000e-9 seed = 1727368832 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.239000000000000e-9 seed = -1459202090 media =0.000000000000000 sigma = 0.000000001000000
atb_ena = 01
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.012000000000000e-9 seed = 200725678 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.641000000000000e-9 seed = -1480766725 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.934000000000000e-9 seed = 1960747925 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.514000000000000e-9 seed = 779236531 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.498000000000000e-9 seed = 854208893 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.553000000000000e-9 seed = -821637905 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.176000000000000e-9 seed = -1440627603 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.555000000000000e-9 seed = 1143765762 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.511000000000000e-9 seed = 736652160 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.633000000000000e-9 seed = -1404210529 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.281000000000000e-9 seed = 1959575638 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.525000000000000e-9 seed = 1646108448 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.725000000000000e-9 seed = 1311491090 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.292000000000000e-9 seed = 579247726 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.141000000000000e-9 seed = 1363621144 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.423000000000000e-9 seed = 2118866847 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.164000000000000e-9 seed = -328005071 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.000000000000000e-9 seed = 1930706915 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.755000000000000e-9 seed = -1032211093 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.411000000000000e-9 seed = 757071595 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.054000000000000e-9 seed = 382963841 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.582000000000000e-9 seed = -1214145002 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.936000000000000e-9 seed = -1329974522 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.763000000000000e-9 seed = 1278528796 media =0.000000000000000 sigma = 0.000000001000000
atb_ena = 10
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.412000000000000e-9 seed = -1254401840 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.610000000000000e-9 seed = -1315403393 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.013000000000000e-9 seed = -173313689 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.487000000000000e-9 seed = -1909729930 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.030000000000000e-9 seed = 504450573 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.667000000000000e-9 seed = -887385735 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.986000000000000e-9 seed = 2108060774 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.819000000000000e-9 seed = 1680419346 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.579000000000000e-9 seed = 1613043238 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.438000000000000e-9 seed = 638966833 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.069000000000000e-9 seed = -1869034042 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.681000000000000e-9 seed = -932134091 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.877000000000000e-9 seed = -1450153881 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.586000000000000e-9 seed = -1946387223 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.511000000000000e-9 seed = -1663439527 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.516000000000000e-9 seed = -1106389508 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.550000000000000e-9 seed = -1835513176 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.060000000000000e-9 seed = 278480023 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.661000000000000e-9 seed = -2005609829 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.023000000000000e-9 seed = 1560022999 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.255000000000000e-9 seed = 370966139 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.535000000000000e-9 seed = -981879309 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.447000000000000e-9 seed = -1662691240 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.362000000000000e-9 seed = 554976377 media =0.000000000000000 sigma = 0.000000001000000
atb_ena = 11
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.518000000000000e-9 seed = 1287149945 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.550000000000000e-9 seed = -769455899 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.093000000000000e-9 seed = -218306928 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.697000000000000e-9 seed = -1259220329 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.071000000000000e-9 seed = -1504759819 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.614000000000000e-9 seed = 1652280937 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.310000000000000e-9 seed = -833795709 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.845000000000000e-9 seed = -1331592914 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.402000000000000e-9 seed = -1752028466 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.209000000000000e-9 seed = 1742499780 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.603000000000000e-9 seed = -1676909948 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.475000000000000e-9 seed = 947806946 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.860000000000000e-9 seed = -1135714065 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.377000000000000e-9 seed = -1772413690 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.298000000000000e-9 seed = 2005368839 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.680000000000000e-9 seed = 921810104 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.757000000000000e-9 seed = 1020365702 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.540000000000000e-9 seed = 1560842437 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.969000000000000e-9 seed = 1507749135 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.046000000000000e-9 seed = 238432193 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.031000000000000e-9 seed = 2045299820 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.545000000000000e-9 seed = 1350956869 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.418000000000000e-9 seed = -760848745 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.905000000000000e-9 seed = -1136776190 media =0.000000000000000 sigma = 0.000000001000000
Barrido de pdb:
pdb = 0
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.536000000000000e-9 seed = 735498627 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.227000000000000e-9 seed = 1496167220 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.820000000000000e-9 seed = 1067217151 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.090000000000000e-9 seed = -134572417 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.477000000000000e-9 seed = -1600602577 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.211000000000000e-9 seed = 1052608966 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.812000000000000e-9 seed = 1790644324 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.545000000000000e-9 seed = -2087589962 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.823000000000000e-9 seed = 1091848809 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.300000000000000e-9 seed = -447940434 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.179000000000000e-9 seed = 676464347 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.846000000000000e-9 seed = -1283170404 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.783000000000000e-9 seed = 1386955451 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.512000000000000e-9 seed = 755714092 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.599000000000000e-9 seed = 2093366887 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.208000000000000e-9 seed = 2110322341 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.699000000000000e-9 seed = -1446594890 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.086000000000000e-9 seed = 1342949461 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.400000000000000e-9 seed = -1771341473 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.726000000000000e-9 seed = 1310317410 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.752000000000000e-9 seed = -1165995256 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.778000000000000e-9 seed = 1770850739 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.176000000000000e-9 seed = -274778931 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.375000000000000e-9 seed = -1721270898 media =0.000000000000000 sigma = 0.000000001000000
pdb = 1
Simulation complete via $finish(1) at time 510 PS + 0
./tb/currentSourceUnits_tb.sv:134         $finish;
xcelium> ^C
xcelium> exit
TOOL:	xrun(64)	24.03-s004: Exiting on Jan 22, 2026 at 21:00:51 CET  (total: 00:05:35)
