xrun(64): 24.03-s004: (c) Copyright 1995-2024 Cadence Design Systems, Inc.
TOOL:	xrun(64)	24.03-s004: Started on Jan 22, 2026 at 20:15:39 CET
xrun
	-f xrun.f
		-clean
		./models/currentSourceUnits_noise.sv
		./tb/currentSourceUnits_tb.sv
		-access +rw
		-s
		-input /home/msegper/Documents/TFM/current_source_units/restore.tcl
xrun: *N,CLEAN: Removing existing directory ./xcelium.d.
file: ./models/currentSourceUnits_noise.sv
        int mean = 0;         // Promedio de la distribución
                 |
xmvlog: *W,VARIST (./models/currentSourceUnits_noise.sv,95|17): Local static variable with initializer requires 'static' keyword.
        int std_dev = 1000;     // Desviación estándar, sigma
                    |
xmvlog: *W,VARIST (./models/currentSourceUnits_noise.sv,96|20): Local static variable with initializer requires 'static' keyword.
        real scalar =1e-12;  //Para ajustar el peso del ruido (1000*1e-12 = 1nA, el ruido tiene magnitud de nA)
                    |
xmvlog: *W,VARIST (./models/currentSourceUnits_noise.sv,99|20): Local static variable with initializer requires 'static' keyword.
	module worklib.currentSourceUnits:sv
		errors: 0, warnings: 3
file: ./tb/currentSourceUnits_tb.sv
	module worklib.currentSourceUnits_tb:sv
		errors: 0, warnings: 0
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
	Top level design units:
		cds_rnm_pkg
		$unit_0x6d800340
		currentSourceUnits_tb
	Building instance overlay tables: .................... Done
	Using implicit TMP libraries; associated with library worklib
	Generating native compiled code:
		worklib.currentSourceUnits:sv <0x3a27716f>
			streams:  11, words: 34043
		worklib.currentSourceUnits_tb:sv <0x777d797d>
			streams:  34, words: 26473
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                 Instances  Unique
		Modules:                 2       2
		Verilog packages:        1       1
		Registers:              77      77
		Scalar wires:           31       -
		Vectored wires:          1       -
		Always blocks:           5       5
		Initial blocks:          7       7
		Pseudo assignments:     32       -
		Assertions:              4       4
		Compilation units:       1       1
		Simulation timescale:  1ps
	Writing initial simulation snapshot: worklib.currentSourceUnits_tb:sv
Loading snapshot worklib.currentSourceUnits_tb:sv .................... Done
SVSEED default: 1
[DMSINFO] Simulating with Xcelium Mixed-Signal App...
xcelium> source /eda/cadence/2024-25/RHELx86/XCELIUM_24.03.004/tools/xcelium/files/xmsimrc
xcelium> 
xcelium> # XM-Sim Command File
xcelium> # TOOL:	xmsim(64)	24.03-s004
xcelium> #
xcelium> #
xcelium> # You can restore this configuration with:
xcelium> #
xcelium> #      xrun -f xrun.f -input /home/msegper/Documents/TFM/current_source_units/restore.tcl
xcelium> #
xcelium> 
xcelium> set tcl_prompt1 {puts -nonewline "xcelium> "}
puts -nonewline "xcelium> "
xcelium> set tcl_prompt2 {puts -nonewline "> "}
puts -nonewline "> "
xcelium> set vlog_format %h
%h
xcelium> set vhdl_format %v
%v
xcelium> set real_precision 6
6
xcelium> set display_unit auto
auto
xcelium> set time_unit module
module
xcelium> set heap_garbage_size -200
-200
xcelium> set heap_garbage_time 0
0
xcelium> set assert_report_level note
note
xcelium> set assert_stop_level error
error
xcelium> set autoscope yes
yes
xcelium> set assert_1164_warnings yes
yes
xcelium> set pack_assert_off {}
xcelium> set severity_pack_assert_off {note warning}
note warning
xcelium> set assert_output_stop_level failed
failed
xcelium> set tcl_debug_level 0
0
xcelium> set relax_path_name 1
1
xcelium> set vhdl_vcdmap XX01ZX01X
XX01ZX01X
xcelium> set intovf_severity_level ERROR
ERROR
xcelium> set probe_screen_format 0
0
xcelium> set rangecnst_severity_level ERROR
ERROR
xcelium> set textio_severity_level ERROR
ERROR
xcelium> set vital_timing_checks_on 1
1
xcelium> set vlog_code_show_force 0
0
xcelium> set assert_count_attempts 1
1
xcelium> set tcl_all64 false
false
xcelium> set tcl_runerror_exit false
false
xcelium> set assert_report_incompletes 0
0
xcelium> set show_force 1
1
xcelium> set force_reset_by_reinvoke 0
0
xcelium> set tcl_relaxed_literal 0
0
xcelium> set probe_exclude_patterns {}
xcelium> set probe_packed_limit 4k
4k
xcelium> set probe_unpacked_limit 16k
16k
xcelium> set assert_internal_msg no
no
xcelium> set svseed 1
1
xcelium> set assert_reporting_mode 0
0
xcelium> set vcd_compact_mode 0
0
xcelium> set vhdl_forgen_loopindex_enum_pos 0
0
xcelium> set xmreplay_dc_debug 0
0
xcelium> set tcl_runcmd_interrupt next_command
next_command
xcelium> set tcl_sigval_prefix {#}
#
xcelium> alias . run
xcelium> alias indago verisium
xcelium> alias quit exit
xcelium> database -open -shm -into waves.shm waves -default
Created default SHM database waves
xcelium> probe -create -database waves currentSourceUnits_tb.dut.vssana currentSourceUnits_tb.dut.vddana_1p8 currentSourceUnits_tb.dut.vddana_0p8 currentSourceUnits_tb.dut.pdb currentSourceUnits_tb.dut.iref_500ua currentSourceUnits_tb.dut.atb_ena currentSourceUnits_tb.dut.atb1 currentSourceUnits_tb.dut.atb0 currentSourceUnits_tb.dut.Iout_binary_5 currentSourceUnits_tb.dut.Iout_binary_4 currentSourceUnits_tb.dut.Iout_binary_3 currentSourceUnits_tb.dut.Iout_binary_2 currentSourceUnits_tb.dut.Iout_binary_1 currentSourceUnits_tb.dut.Iout_binary_0_red currentSourceUnits_tb.dut.Iout_binary_0
Created probe 1
xcelium> probe -create -database waves currentSourceUnits_tb.dut.Iout_them_0 currentSourceUnits_tb.dut.Iout_them_1 currentSourceUnits_tb.dut.Iout_them_2 currentSourceUnits_tb.dut.Iout_them_3 currentSourceUnits_tb.dut.Iout_them_4 currentSourceUnits_tb.dut.Iout_them_5 currentSourceUnits_tb.dut.Iout_them_6 currentSourceUnits_tb.dut.Iout_them_7 currentSourceUnits_tb.dut.Iout_them_8 currentSourceUnits_tb.dut.Iout_them_9 currentSourceUnits_tb.dut.Iout_them_10 currentSourceUnits_tb.dut.Iout_them_11 currentSourceUnits_tb.dut.Iout_them_12 currentSourceUnits_tb.dut.Iout_them_13 currentSourceUnits_tb.dut.Iout_them_14 currentSourceUnits_tb.dut.Iout_them_15 currentSourceUnits_tb.dut.Iout_them_16
Created probe 2
xcelium> 
xcelium> simvision -input restore.tcl.svcf

-------------------------------------
Relinquished control to SimVision...
xcelium> 
xcelium> run
Barrido de iref_500ua:
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.451000000000000e-9 seed = 1840269805 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.381000000000000e-9 seed = 928968188 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.041000000000000e-9 seed = -534203927 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.592000000000000e-9 seed = 1279713169 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.206000000000000e-9 seed = -1430061861 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.579000000000000e-9 seed = 791161322 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.920000000000000e-9 seed = -1152288105 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.338000000000000e-9 seed = -1910851880 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.493000000000000e-9 seed = -1741221507 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.749000000000000e-9 seed = 2002757025 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.627000000000000e-9 seed = -1296375947 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.061000000000000e-9 seed = 676098319 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.587000000000000e-9 seed = -1481781317 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.505000000000000e-9 seed = 1711176387 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.053000000000000e-9 seed = 619648634 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.514000000000000e-9 seed = 1659360218 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.186000000000000e-9 seed = 1986516043 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.077000000000000e-9 seed = 1365106268 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.265000000000000e-9 seed = -393730850 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.642000000000000e-9 seed = -972016066 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.400000000000000e-9 seed = -1694214983 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.691000000000000e-9 seed = -912121123 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.084000000000000e-9 seed = 1307061901 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.709000000000000e-9 seed = -1402409784 media =0.000000000000000 sigma = 0.000000001000000
iref_500ua = 0.000450 A
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.741000000000000e-9 seed = -2120624742 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.305000000000000e-9 seed = -524728420 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.601000000000000e-9 seed = -2098884571 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.759000000000000e-9 seed = 1933925669 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.595000000000000e-9 seed = -2050917685 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.855000000000000e-9 seed = -2129193511 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.125000000000000e-9 seed = -2065082983 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.138000000000000e-9 seed = 547617411 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.938000000000000e-9 seed = -2025707494 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.522000000000000e-9 seed = 1067416720 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.244000000000000e-9 seed = 1895777027 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.069000000000000e-9 seed = 1769227701 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.192000000000000e-9 seed = -2130484739 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.338000000000000e-9 seed = 601444980 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.538000000000000e-9 seed = -735126302 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.112000000000000e-9 seed = 730033802 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.025000000000000e-9 seed = -81259774 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.966000000000000e-9 seed = -1203148208 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.049000000000000e-9 seed = -1358438264 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.310000000000000e-9 seed = 927130916 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.056000000000000e-9 seed = 785202888 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.773000000000000e-9 seed = -1130492506 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.184000000000000e-9 seed = 2038331346 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.098000000000000e-9 seed = -1090526791 media =0.000000000000000 sigma = 0.000000001000000
iref_500ua = 0.000500 A
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.054000000000000e-9 seed = -799662221 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.029000000000000e-9 seed = -1259187317 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.550000000000000e-9 seed = 1723460414 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.202000000000000e-9 seed = -2073708281 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.904000000000000e-9 seed = 1851600735 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.557000000000000e-9 seed = -816723458 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.408000000000000e-9 seed = -1608980342 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.381000000000000e-9 seed = -1555100739 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.896000000000000e-9 seed = -1200852586 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.606000000000000e-9 seed = 2101693022 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.698000000000000e-9 seed = 2142850284 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.412000000000000e-9 seed = 950562011 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.203000000000000e-9 seed = 1350924542 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.233000000000000e-9 seed = 338476491 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.318000000000000e-9 seed = -1169077327 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.256000000000000e-9 seed = 1990072533 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.765000000000000e-9 seed = 1597063682 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.886000000000000e-9 seed = -1168120502 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.017000000000000e-9 seed = 557117721 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.083000000000000e-9 seed = -242114665 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.443000000000000e-9 seed = -1527894674 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.416000000000000e-9 seed = 2029962012 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.501000000000000e-9 seed = 1535131453 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.539000000000000e-9 seed = 762501035 media =0.000000000000000 sigma = 0.000000001000000
iref_500ua = 0.000550 A
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.111000000000000e-9 seed = -183837940 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.229000000000000e-9 seed = 335803413 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.508000000000000e-9 seed = 908673577 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.073000000000000e-9 seed = 1897810498 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.602000000000000e-9 seed = 2043437030 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.259000000000000e-9 seed = -744929344 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.164000000000000e-9 seed = 828880711 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.578000000000000e-9 seed = 1378294925 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.722000000000000e-9 seed = -1270989615 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.123000000000000e-9 seed = 1562558103 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.069000000000000e-9 seed = -1436319656 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.260000000000000e-9 seed = 511569604 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.884000000000000e-9 seed = 1459686196 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.468000000000000e-9 seed = 690538269 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.664000000000000e-9 seed = -949047080 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.468000000000000e-9 seed = 1798829388 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.552000000000000e-9 seed = -801823454 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.508000000000000e-9 seed = -1713693674 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.082000000000000e-9 seed = 345363771 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.127000000000000e-9 seed = 261211514 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.130000000000000e-9 seed = 196701711 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.833000000000000e-9 seed = 1066671275 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.583000000000000e-9 seed = -1818952813 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.695000000000000e-9 seed = 1674774480 media =0.000000000000000 sigma = 0.000000001000000
Barrido de vddana_1p8:
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.820000000000000e-9 seed = -1050582379 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.430000000000000e-9 seed = 1583627242 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.162000000000000e-9 seed = -1367871550 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.351000000000000e-9 seed = 1486210191 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.539000000000000e-9 seed = -2028801728 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.041000000000000e-9 seed = 101479104 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.446000000000000e-9 seed = -1254099945 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.348000000000000e-9 seed = 530013845 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.183000000000000e-9 seed = 343946081 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.498000000000000e-9 seed = 786187952 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.280000000000000e-9 seed = -1265881400 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.751000000000000e-9 seed = -1062160814 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.211000000000000e-9 seed = -839164797 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.515000000000000e-9 seed = -1097975681 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.031000000000000e-9 seed = -388914125 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.580000000000000e-9 seed = -2120692217 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.796000000000000e-9 seed = -1798176794 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.427000000000000e-9 seed = -647233646 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.552000000000000e-9 seed = 916074322 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.422000000000000e-9 seed = 594925620 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.721000000000000e-9 seed = 1076743447 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.257000000000000e-9 seed = -375192070 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.571000000000000e-9 seed = 798405539 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.843000000000000e-9 seed = 2098019084 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.71 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.621000000000000e-9 seed = 994129877 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.784000000000000e-9 seed = 1730257028 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.589000000000000e-9 seed = 1693349953 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.644000000000000e-9 seed = 1203526891 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.500000000000000e-9 seed = 1814126033 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.325000000000000e-9 seed = -1926689223 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.825000000000000e-9 seed = -1061974000 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.100000000000000e-9 seed = 1543844040 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.381000000000000e-9 seed = 1012597189 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.359000000000000e-9 seed = -838805779 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.067000000000000e-9 seed = -839543536 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.220000000000000e-9 seed = 1334948436 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.415000000000000e-9 seed = -591190303 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.065000000000000e-9 seed = 1503589789 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.689000000000000e-9 seed = -1283981900 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.379000000000000e-9 seed = 583338820 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.003000000000000e-9 seed = -370719959 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.553000000000000e-9 seed = -1967905311 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.564000000000000e-9 seed = -1411184990 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.139000000000000e-9 seed = -2093250284 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.774000000000000e-9 seed = 1087209608 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.266000000000000e-9 seed = 1961628108 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.804000000000000e-9 seed = -1081336220 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.262000000000000e-9 seed = -1555524970 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.72 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.319000000000000e-9 seed = 859857604 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.090000000000000e-9 seed = -362881558 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.023000000000000e-9 seed = 2023164509 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.204000000000000e-9 seed = 2065964845 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.449000000000000e-9 seed = -1749221402 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.267000000000000e-9 seed = -1453736916 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.306000000000000e-9 seed = 1765934681 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.766000000000000e-9 seed = 1082989286 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.835000000000000e-9 seed = 1068051895 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.013000000000000e-9 seed = -213943448 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.232000000000000e-9 seed = 752045737 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.108000000000000e-9 seed = 716319212 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.109000000000000e-9 seed = 2058853257 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.399000000000000e-9 seed = 561242699 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.187000000000000e-9 seed = -1465323247 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.827000000000000e-9 seed = 1935872499 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.865000000000000e-9 seed = 1882715250 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.156000000000000e-9 seed = -247538456 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.778000000000000e-9 seed = 2040340081 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.059000000000000e-9 seed = 342387231 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.172000000000000e-9 seed = 253424657 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.137000000000000e-9 seed = -327020810 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.089000000000000e-9 seed = -2107637732 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.647000000000000e-9 seed = -1868894445 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.73 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.386000000000000e-9 seed = -624720768 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.224000000000000e-9 seed = -379054744 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.910000000000000e-9 seed = -1626120278 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.636000000000000e-9 seed = -1218544810 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.428000000000000e-9 seed = -2122227275 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.329000000000000e-9 seed = -1498162882 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.805000000000000e-9 seed = 1238719567 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.872000000000000e-9 seed = -1457748562 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.269000000000000e-9 seed = 525420249 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.193000000000000e-9 seed = -443530360 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.510000000000000e-9 seed = -702687502 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.475000000000000e-9 seed = 1651881055 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.242000000000000e-9 seed = -378969021 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.431000000000000e-9 seed = -603141220 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.246000000000000e-9 seed = 935321827 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.124000000000000e-9 seed = -1550639974 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.615000000000000e-9 seed = 1506569538 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.616000000000000e-9 seed = 870566927 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.554000000000000e-9 seed = 2110948509 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.640000000000000e-9 seed = -1699281085 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.005000000000000e-9 seed = 52952946 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.340000000000000e-9 seed = -1814046625 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.629000000000000e-9 seed = 948850774 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.202000000000000e-9 seed = 955397823 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.74 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.171000000000000e-9 seed = -281514657 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.003000000000000e-9 seed = -458262989 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.271000000000000e-9 seed = 419818446 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.066000000000000e-9 seed = -579382422 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.571000000000000e-9 seed = -1330767872 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.419000000000000e-9 seed = 701046637 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.855000000000000e-9 seed = 1574835000 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.066000000000000e-9 seed = 334769866 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.693000000000000e-9 seed = 1211770531 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.401000000000000e-9 seed = 2135155420 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.644000000000000e-9 seed = 2006527674 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.360000000000000e-9 seed = 568284187 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.516000000000000e-9 seed = -1312497759 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.602000000000000e-9 seed = 913290983 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.277000000000000e-9 seed = -441427618 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.290000000000000e-9 seed = -530653113 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.590000000000000e-9 seed = -862081010 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.517000000000000e-9 seed = 953716297 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.166000000000000e-9 seed = 440160135 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.589000000000000e-9 seed = -2068733905 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.745000000000000e-9 seed = 1133076687 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.335000000000000e-9 seed = -961213592 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.007000000000000e-9 seed = -1783642879 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.079000000000000e-9 seed = 253003752 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.75 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.372000000000000e-9 seed = -1816323762 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.120000000000000e-9 seed = -1351903424 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.764000000000000e-9 seed = -2135270861 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.544000000000000e-9 seed = 1734304641 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.307000000000000e-9 seed = 1543688954 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.408000000000000e-9 seed = 1560261198 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.508000000000000e-9 seed = -1983275105 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.057000000000000e-9 seed = 2090603563 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.705000000000000e-9 seed = 1311365708 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.096000000000000e-9 seed = 1410948505 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.784000000000000e-9 seed = 1924509546 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.014000000000000e-9 seed = -1245273929 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.598000000000000e-9 seed = 1922874592 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.375000000000000e-9 seed = -1529373984 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.773000000000000e-9 seed = -1002364257 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.971000000000000e-9 seed = -1249816202 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.111000000000000e-9 seed = 645867636 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.885000000000000e-9 seed = 1144127826 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.002000000000000e-9 seed = 81528433 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.531000000000000e-9 seed = 1649995997 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.353000000000000e-9 seed = -501578187 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.382000000000000e-9 seed = 2041859659 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.003000000000000e-9 seed = 292284241 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.068000000000000e-9 seed = 550449226 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.76 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.120000000000000e-9 seed = -1571129862 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.777000000000000e-9 seed = -1060249698 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.586000000000000e-9 seed = -1356949763 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.628000000000000e-9 seed = -1421298496 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.209000000000000e-9 seed = 419806009 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.102000000000000e-9 seed = 2120886132 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.548000000000000e-9 seed = 1716092490 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.680000000000000e-9 seed = -1719669145 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.750000000000000e-9 seed = 1004137153 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.824000000000000e-9 seed = 1809667549 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.522000000000000e-9 seed = -731007447 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.188000000000000e-9 seed = -1809482351 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.303000000000000e-9 seed = 1563329034 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.020000000000000e-9 seed = 58002923 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.090000000000000e-9 seed = -1308157309 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.988000000000000e-9 seed = 1859407029 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.498000000000000e-9 seed = -2007925781 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.458000000000000e-9 seed = -1590635099 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.154000000000000e-9 seed = 228934483 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.234000000000000e-9 seed = 549241286 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.860000000000000e-9 seed = -1367745126 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.291000000000000e-9 seed = 450993804 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.844000000000000e-9 seed = 1717648483 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.182000000000000e-9 seed = -1430003830 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.77 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.642000000000000e-9 seed = 1462022864 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.374000000000000e-9 seed = 1186583261 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.773000000000000e-9 seed = -2134770709 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.115000000000000e-9 seed = -614423106 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.944000000000000e-9 seed = -2098360665 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.431000000000000e-9 seed = -1574824687 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.652000000000000e-9 seed = 871309759 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.276000000000000e-9 seed = 1616608588 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.539000000000000e-9 seed = 1639355055 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.089000000000000e-9 seed = 740587828 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.027000000000000e-9 seed = 405934799 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.904000000000000e-9 seed = -1178176104 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.365000000000000e-9 seed = 1746099183 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.393000000000000e-9 seed = -2105601865 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.279000000000000e-9 seed = 566819536 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.677000000000000e-9 seed = -1763340800 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.268000000000000e-9 seed = -736817125 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.006000000000000e-9 seed = -1239784787 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.964000000000000e-9 seed = 2114842392 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.570000000000000e-9 seed = -1278242897 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.782000000000000e-9 seed = -1043024562 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.341000000000000e-9 seed = -1612478730 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.671000000000000e-9 seed = -1099817196 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.723000000000000e-9 seed = -1300166284 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.78 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.916000000000000e-9 seed = -2061659907 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.086000000000000e-9 seed = 349433213 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.674000000000000e-9 seed = -1680908037 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.340000000000000e-9 seed = -1973915602 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.471000000000000e-9 seed = 1441422122 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.560000000000000e-9 seed = 1094769373 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.599000000000000e-9 seed = -1466275362 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.479000000000000e-9 seed = 804354086 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.297000000000000e-9 seed = -1635960956 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.066000000000000e-9 seed = -664095981 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.530000000000000e-9 seed = 818629864 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.448000000000000e-9 seed = -1945343512 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.049000000000000e-9 seed = -2067051157 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.043000000000000e-9 seed = 1290063122 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.315000000000000e-9 seed = 1743507601 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.785000000000000e-9 seed = 1846078715 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.478000000000000e-9 seed = -1703286885 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.474000000000000e-9 seed = 1576834328 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.746000000000000e-9 seed = 1003277501 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.200000000000000e-9 seed = 1042629545 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.494000000000000e-9 seed = 739354115 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.702000000000000e-9 seed = 958752948 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.187000000000000e-9 seed = 913575937 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.710000000000000e-9 seed = 1800007283 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.79 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.863000000000000e-9 seed = -1350063141 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.816000000000000e-9 seed = 1243875678 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.456000000000000e-9 seed = 643368281 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.131000000000000e-9 seed = -1434684036 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.314000000000000e-9 seed = 1268844994 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.320000000000000e-9 seed = -457571578 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.682000000000000e-9 seed = -1119650665 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.526000000000000e-9 seed = 996094122 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.870000000000000e-9 seed = 1351382593 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.257000000000000e-9 seed = -1596946769 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.347000000000000e-9 seed = -563156577 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.003000000000000e-9 seed = -146835098 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.832000000000000e-9 seed = 1157917961 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.806000000000000e-9 seed = 2057652003 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.220000000000000e-9 seed = 1485093703 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.907000000000000e-9 seed = -2040303008 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.763000000000000e-9 seed = 1945062548 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.643000000000000e-9 seed = 1674182710 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.932000000000000e-9 seed = -1358706351 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.471000000000000e-9 seed = -653194899 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.575000000000000e-9 seed = 2039681336 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.748000000000000e-9 seed = -1205204406 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.415000000000000e-9 seed = -1992620665 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.623000000000000e-9 seed = 1756897789 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.80 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.733000000000000e-9 seed = -1069713241 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.749000000000000e-9 seed = -1676660437 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.387000000000000e-9 seed = 1077907079 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.781000000000000e-9 seed = 1374809779 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.633000000000000e-9 seed = 2097959940 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.647000000000000e-9 seed = -938267597 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.218000000000000e-9 seed = 683753373 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.510000000000000e-9 seed = 1994997437 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.172000000000000e-9 seed = 1107718143 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.871000000000000e-9 seed = 2083337444 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.281000000000000e-9 seed = -928614351 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.379000000000000e-9 seed = -1783328805 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.577000000000000e-9 seed = 908138433 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.135000000000000e-9 seed = 1418365485 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.132000000000000e-9 seed = -1827436729 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.197000000000000e-9 seed = 299746431 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.181000000000000e-9 seed = 660399899 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.292000000000000e-9 seed = -480172243 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.080000000000000e-9 seed = 817303766 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.129000000000000e-9 seed = 265049732 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.105000000000000e-9 seed = 1652598089 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.165000000000000e-9 seed = -355799266 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.679000000000000e-9 seed = -1162232893 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.671000000000000e-9 seed = 906006649 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.81 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.317000000000000e-9 seed = 453881150 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.381000000000000e-9 seed = 1853043759 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.172000000000000e-9 seed = 1639388349 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.267000000000000e-9 seed = -832555077 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.354000000000000e-9 seed = -1375787366 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -3.281000000000000e-9 seed = -2123965401 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.936000000000000e-9 seed = 1218452536 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.428000000000000e-9 seed = -600654081 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.774000000000000e-9 seed = 1122014099 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.603000000000000e-9 seed = -1907272485 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.639000000000000e-9 seed = -957029907 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.739000000000000e-9 seed = 1281028808 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.203000000000000e-9 seed = 1940964257 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.702000000000000e-9 seed = -958972539 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.440000000000000e-9 seed = -1491421258 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.500000000000000e-9 seed = -937350596 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.766000000000000e-9 seed = -1175558647 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.866000000000000e-9 seed = -1106832439 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.205000000000000e-9 seed = 1240273936 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.832000000000000e-9 seed = -1155686733 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.515000000000000e-9 seed = -726050744 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.153000000000000e-9 seed = 1412303833 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.294000000000000e-9 seed = -546997573 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.854000000000000e-9 seed = 1897998965 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.82 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.035000000000000e-9 seed = -1193492946 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.501000000000000e-9 seed = 1775415592 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.432000000000000e-9 seed = 1803567696 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.565000000000000e-9 seed = -1894407425 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.237000000000000e-9 seed = 1672510808 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.238000000000000e-9 seed = 1433766624 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.156000000000000e-9 seed = -1952557023 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.808000000000000e-9 seed = -1384734475 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.610000000000000e-9 seed = -846178280 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.023000000000000e-9 seed = 729486014 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.308000000000000e-9 seed = -568628047 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.154000000000000e-9 seed = 1539099323 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.688000000000000e-9 seed = 982597558 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.123000000000000e-9 seed = 2024699026 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.872000000000000e-9 seed = 1975095990 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.441000000000000e-9 seed = -857239038 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.440000000000000e-9 seed = 739102710 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.408000000000000e-9 seed = 2053152826 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.130000000000000e-9 seed = 516987526 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.663000000000000e-9 seed = -917458090 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.580000000000000e-9 seed = -934094636 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.834000000000000e-9 seed = -1195110274 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.063000000000000e-9 seed = 643202200 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.347000000000000e-9 seed = 1718475604 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.83 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.595000000000000e-9 seed = 1717053178 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.925000000000000e-9 seed = -1212695285 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.948000000000000e-9 seed = 1854097894 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.304000000000000e-9 seed = -592953909 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.378000000000000e-9 seed = 1789539283 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.314000000000000e-9 seed = 1920017354 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.034000000000000e-9 seed = 1515934346 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.960000000000000e-9 seed = -1222965602 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.533000000000000e-9 seed = -765908764 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.833000000000000e-9 seed = -1364709751 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.024000000000000e-9 seed = -161711455 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.211000000000000e-9 seed = -765709220 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.298000000000000e-9 seed = -1497151198 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.942000000000000e-9 seed = 1953675735 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.409000000000000e-9 seed = -1638422928 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.512000000000000e-9 seed = -1434064615 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.388000000000000e-9 seed = -1566034759 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.221000000000000e-9 seed = 420063610 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.353000000000000e-9 seed = 544938050 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.723000000000000e-9 seed = -1294585230 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.796000000000000e-9 seed = 2114596049 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.857000000000000e-9 seed = 1969084706 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.026000000000000e-9 seed = 1941229167 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.001000000000000e-9 seed = -1295443802 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.84 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.366000000000000e-9 seed = 969106325 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.926000000000000e-9 seed = -1164303219 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.975000000000000e-9 seed = 1249982523 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.866000000000000e-9 seed = 2023435375 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.295000000000000e-9 seed = -554474337 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.079000000000000e-9 seed = 1181164684 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.107000000000000e-9 seed = 1554731568 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.117000000000000e-9 seed = 1415995990 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.771000000000000e-9 seed = -1056676165 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.443000000000000e-9 seed = -1655453606 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.531000000000000e-9 seed = -813691268 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.204000000000000e-9 seed = -1605382306 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.246000000000000e-9 seed = 1074565573 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.013000000000000e-9 seed = -1291599874 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.029000000000000e-9 seed = -1271238471 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.012000000000000e-9 seed = -56105880 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.505000000000000e-9 seed = -2053417345 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.239000000000000e-9 seed = 352121616 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.464000000000000e-9 seed = 767253132 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.223000000000000e-9 seed = 1953105231 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.753000000000000e-9 seed = 1106595893 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.507000000000000e-9 seed = 1576714394 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.284000000000000e-9 seed = 1958888357 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.812000000000000e-9 seed = -1187381778 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.85 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.283000000000000e-9 seed = -612772086 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.600000000000000e-9 seed = -881348020 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.070000000000000e-9 seed = 958257033 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.975000000000000e-9 seed = -2005342296 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.795000000000000e-9 seed = -1775445292 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.229000000000000e-9 seed = -802672151 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.633000000000000e-9 seed = -1987029172 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.432000000000000e-9 seed = -988950097 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.051000000000000e-9 seed = -1707735396 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.794000000000000e-9 seed = 1152350223 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.545000000000000e-9 seed = 1554613452 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.487000000000000e-9 seed = 950349542 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.669000000000000e-9 seed = 1848620697 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.302000000000000e-9 seed = -738948826 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.686000000000000e-9 seed = 911091324 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.419000000000000e-9 seed = -590750229 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.413000000000000e-9 seed = -578870516 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.442000000000000e-9 seed = 1416548255 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.021000000000000e-9 seed = -882779446 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.323000000000000e-9 seed = -1060428070 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.569000000000000e-9 seed = 788769892 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.103000000000000e-9 seed = -2126766561 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.848000000000000e-9 seed = 1147282059 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.707000000000000e-9 seed = -934514244 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.86 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.690000000000000e-9 seed = 1739419633 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.360000000000000e-9 seed = 926719060 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.499000000000000e-9 seed = -755236854 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.291000000000000e-9 seed = 461302180 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.075000000000000e-9 seed = 726780617 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.127000000000000e-9 seed = -543808801 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.200000000000000e-9 seed = 765013891 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.221000000000000e-9 seed = -583201385 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.027000000000000e-9 seed = -1250943797 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.436000000000000e-9 seed = -1408749324 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.155000000000000e-9 seed = -1410516699 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.089000000000000e-9 seed = 245887253 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.041000000000000e-9 seed = -1449662122 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.397000000000000e-9 seed = 1968148053 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.749000000000000e-9 seed = -1256058286 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.522000000000000e-9 seed = -1741867088 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.867000000000000e-9 seed = 1881660511 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.030000000000000e-9 seed = 1578607150 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.650000000000000e-9 seed = 2011206608 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.847000000000000e-9 seed = 1784578636 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.882000000000000e-9 seed = 1121307307 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.084000000000000e-9 seed = 1508272953 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.943000000000000e-9 seed = 1313399701 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.476000000000000e-9 seed = -1887897112 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.87 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.918000000000000e-9 seed = 1248729517 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.742000000000000e-9 seed = -1752779110 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.520000000000000e-9 seed = 1249648897 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.040000000000000e-9 seed = 66992680 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.510000000000000e-9 seed = -718284190 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.078000000000000e-9 seed = 1350861274 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.284000000000000e-9 seed = 786707558 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.584000000000000e-9 seed = -1663850918 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.163000000000000e-9 seed = 1918537548 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.771000000000000e-9 seed = -1301646274 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.004000000000000e-9 seed = -37306067 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.037000000000000e-9 seed = -888472248 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.613000000000000e-9 seed = -2147382839 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.723000000000000e-9 seed = 1208598087 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.935000000000000e-9 seed = -1758378132 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.298000000000000e-9 seed = -871935181 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.354000000000000e-9 seed = -1522127469 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.348000000000000e-9 seed = 1677257010 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.580000000000000e-9 seed = 2030054020 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.998000000000000e-9 seed = -1744282060 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.828000000000000e-9 seed = 2129765440 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.071000000000000e-9 seed = 1217732687 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.156000000000000e-9 seed = -1363842272 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.003000000000000e-9 seed = 2106176178 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.88 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.553000000000000e-9 seed = -994407783 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.750000000000000e-9 seed = 1282622204 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.457000000000000e-9 seed = 1323442814 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.638000000000000e-9 seed = -914646613 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.750000000000000e-9 seed = 1629021845 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.898000000000000e-9 seed = 1298115457 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.974000000000000e-9 seed = 1561467753 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.157000000000000e-9 seed = -241237208 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.915000000000000e-9 seed = -1172745675 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.056000000000000e-9 seed = 1298538763 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.101000000000000e-9 seed = -1341496328 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.093000000000000e-9 seed = -1903277816 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.433000000000000e-9 seed = 1077409718 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.613000000000000e-9 seed = 1605400905 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.212000000000000e-9 seed = -1216122468 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.957000000000000e-9 seed = -2094677031 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.303000000000000e-9 seed = 1515763198 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 3.188000000000000e-9 seed = -2110386546 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.116000000000000e-9 seed = -1475683485 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.174000000000000e-9 seed = -1459746819 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.481000000000000e-9 seed = 2102120109 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.201000000000000e-9 seed = 1755124237 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.304000000000000e-9 seed = 1546906896 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.616000000000000e-9 seed = -1348948379 media =0.000000000000000 sigma = 0.000000001000000
vddana_1p8 = 1.89 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.127000000000000e-9 seed = -735637295 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.966000000000000e-9 seed = -2061506403 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.737000000000000e-9 seed = 1888533391 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.450000000000000e-9 seed = 628467402 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.609000000000000e-9 seed = -1787679959 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.042000000000000e-9 seed = -947559529 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.129000000000000e-9 seed = 363811726 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.056000000000000e-9 seed = 609208007 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.064000000000000e-9 seed = 110515507 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.599000000000000e-9 seed = -1192531010 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.056000000000000e-9 seed = -136887636 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.419000000000000e-9 seed = 836036744 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.357000000000000e-9 seed = -565101699 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.323000000000000e-9 seed = 1802132446 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.733000000000000e-9 seed = -981585563 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.001000000000000e-9 seed = 2145100350 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.339000000000000e-9 seed = -1505656691 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.473000000000000e-9 seed = 1805297087 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.406000000000000e-9 seed = 1145621121 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.124000000000000e-9 seed = -1793794799 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.428000000000000e-9 seed = 607384525 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.661000000000000e-9 seed = -1936812198 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.051000000000000e-9 seed = -77626858 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.168000000000000e-9 seed = -1966077487 media =0.000000000000000 sigma = 0.000000001000000
Barrido de vddana_0p8:
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.948000000000000e-9 seed = -1204877328 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.081000000000000e-9 seed = 163233540 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.171000000000000e-9 seed = 632401557 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.505000000000000e-9 seed = -1317597441 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.177000000000000e-9 seed = 2052020244 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.314000000000000e-9 seed = 1612409329 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.852000000000000e-9 seed = 1984950456 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.825000000000000e-9 seed = 1385845468 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.034000000000000e-9 seed = 467757909 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.299000000000000e-9 seed = 436136222 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.895000000000000e-9 seed = -1637676860 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.823000000000000e-9 seed = -1680724897 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.459000000000000e-9 seed = -637943773 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.352000000000000e-9 seed = -501473852 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.463000000000000e-9 seed = -2036119420 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.457000000000000e-9 seed = 1824513885 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.264000000000000e-9 seed = 382913005 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.657000000000000e-9 seed = 1578283695 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.717000000000000e-9 seed = 1765651972 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.372000000000000e-9 seed = 860548473 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.027000000000000e-9 seed = -41380152 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.979000000000000e-9 seed = 1265149968 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.008000000000000e-9 seed = 2073820016 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.254000000000000e-9 seed = 1949693819 media =0.000000000000000 sigma = 0.000000001000000
vddana_0p8 = 0.76 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.438000000000000e-9 seed = -2064801163 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.713000000000000e-9 seed = -945954051 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.929000000000000e-9 seed = -1297678506 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.737000000000000e-9 seed = -1009829013 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.579000000000000e-9 seed = 977273240 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -3.031000000000000e-9 seed = 2138524278 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.322000000000000e-9 seed = 1510007147 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.519000000000000e-9 seed = -789266532 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.459000000000000e-9 seed = -1104153886 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.812000000000000e-9 seed = 1172251447 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.134000000000000e-9 seed = -297343869 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.806000000000000e-9 seed = 1786287034 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.062000000000000e-9 seed = 1600650905 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.121000000000000e-9 seed = -272248397 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.370000000000000e-9 seed = -981668385 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.075000000000000e-9 seed = 350696860 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.321000000000000e-9 seed = -1431875445 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.216000000000000e-9 seed = -1948717451 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.346000000000000e-9 seed = -1944329303 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.312000000000000e-9 seed = -1701835541 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.719000000000000e-9 seed = -1081181494 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.422000000000000e-9 seed = -643514177 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.507000000000000e-9 seed = -1917871142 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.057000000000000e-9 seed = 781814365 media =0.000000000000000 sigma = 0.000000001000000
vddana_0p8 = 0.77 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.141000000000000e-9 seed = 1369519751 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.345000000000000e-9 seed = 1510219581 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.610000000000000e-9 seed = -1887303432 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.140000000000000e-9 seed = -550612148 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.057000000000000e-9 seed = 1890771207 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.443000000000000e-9 seed = 618227753 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.444000000000000e-9 seed = 1025662521 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.092000000000000e-9 seed = 684546205 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.331000000000000e-9 seed = -1779010131 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.353000000000000e-9 seed = -768572445 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.337000000000000e-9 seed = 2005072396 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.832000000000000e-9 seed = -1795085246 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.314000000000000e-9 seed = 450721880 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.975000000000000e-9 seed = -1797567424 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.432000000000000e-9 seed = -610128467 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.621000000000000e-9 seed = -945897296 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.380000000000000e-9 seed = 1092854932 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.406000000000000e-9 seed = -1590559943 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.214000000000000e-9 seed = -339382076 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.247000000000000e-9 seed = -502761364 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.753000000000000e-9 seed = 1049356566 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.894000000000000e-9 seed = 2082561352 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.041000000000000e-9 seed = -120296977 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.731000000000000e-9 seed = 959650115 media =0.000000000000000 sigma = 0.000000001000000
vddana_0p8 = 0.78 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.058000000000000e-9 seed = -1886512790 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.334000000000000e-9 seed = -2081702814 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.593000000000000e-9 seed = -1314588657 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.151000000000000e-9 seed = -532197335 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.397000000000000e-9 seed = 1549327485 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.129000000000000e-9 seed = -1992947640 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.674000000000000e-9 seed = -1730869425 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.027000000000000e-9 seed = -1419695778 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.180000000000000e-9 seed = -1710933978 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.884000000000000e-9 seed = 1753829754 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.040000000000000e-9 seed = -1512435937 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.791000000000000e-9 seed = -1957891176 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.630000000000000e-9 seed = -950733518 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.784000000000000e-9 seed = 1945983895 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.821000000000000e-9 seed = -1159321717 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.505000000000000e-9 seed = 719482637 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.194000000000000e-9 seed = -299957812 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.731000000000000e-9 seed = -956913250 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.254000000000000e-9 seed = 448267451 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.844000000000000e-9 seed = 1077883073 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.626000000000000e-9 seed = 1735593964 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.022000000000000e-9 seed = -446809992 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.311000000000000e-9 seed = 1770979752 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.971000000000000e-9 seed = 1801292601 media =0.000000000000000 sigma = 0.000000001000000
vddana_0p8 = 0.79 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.337000000000000e-9 seed = -2008968035 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.018000000000000e-9 seed = -461336826 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.382000000000000e-9 seed = 725612855 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.510000000000000e-9 seed = -2027498393 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.769000000000000e-9 seed = -2133377717 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.420000000000000e-9 seed = 664881576 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.321000000000000e-9 seed = 993822575 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.823000000000000e-9 seed = -1356077768 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.026000000000000e-9 seed = -827658654 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.718000000000000e-9 seed = -1811062660 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.231000000000000e-9 seed = -1942908127 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.907000000000000e-9 seed = -2010868849 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.887000000000000e-9 seed = 1591887238 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.973000000000000e-9 seed = -1361556283 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.587000000000000e-9 seed = -1289768746 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.925000000000000e-9 seed = 2123710578 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.229000000000000e-9 seed = 1551041033 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.381000000000000e-9 seed = 1512528555 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.986000000000000e-9 seed = -1359722398 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.244000000000000e-9 seed = 764499014 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.209000000000000e-9 seed = 1267144811 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.542000000000000e-9 seed = 913007683 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.451000000000000e-9 seed = 1676711089 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.009000000000000e-9 seed = -1709190211 media =0.000000000000000 sigma = 0.000000001000000
vddana_0p8 = 0.80 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.995000000000000e-9 seed = -1862337861 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.056000000000000e-9 seed = -136247436 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.149000000000000e-9 seed = -1551234869 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.557000000000000e-9 seed = -820519355 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.329000000000000e-9 seed = 568404401 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.785000000000000e-9 seed = -2048265035 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.473000000000000e-9 seed = -1313705039 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.329000000000000e-9 seed = 510726657 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.518000000000000e-9 seed = 739305190 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.289000000000000e-9 seed = -527133248 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.407000000000000e-9 seed = 1861178810 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.913000000000000e-9 seed = -1145295432 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.516000000000000e-9 seed = 1166663928 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.440000000000000e-9 seed = 2124493147 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.618000000000000e-9 seed = -830692181 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.176000000000000e-9 seed = -508676163 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.826000000000000e-9 seed = 1117775831 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.239000000000000e-9 seed = 1497434837 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.452000000000000e-9 seed = -2050552161 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.186000000000000e-9 seed = 1993262994 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.517000000000000e-9 seed = 827041614 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.777000000000000e-9 seed = 1040825819 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.209000000000000e-9 seed = -342280831 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.020000000000000e-9 seed = 967392007 media =0.000000000000000 sigma = 0.000000001000000
vddana_0p8 = 0.81 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.218000000000000e-9 seed = 1423585946 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.702000000000000e-9 seed = -1038823157 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.778000000000000e-9 seed = 1196064385 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.964000000000000e-9 seed = 1437680918 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.276000000000000e-9 seed = -1758332775 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.772000000000000e-9 seed = 1711320557 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.316000000000000e-9 seed = -1458952341 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.452000000000000e-9 seed = 717561351 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.918000000000000e-9 seed = 2121555514 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.027000000000000e-9 seed = -1312028393 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.450000000000000e-9 seed = -1511601154 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.567000000000000e-9 seed = 2001736041 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.076000000000000e-9 seed = 383848213 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.342000000000000e-9 seed = 2050822880 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.638000000000000e-9 seed = -1729779184 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.117000000000000e-9 seed = 192480851 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.628000000000000e-9 seed = 1922173231 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.390000000000000e-9 seed = -1560206849 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.214000000000000e-9 seed = 434127343 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.439000000000000e-9 seed = 1539457153 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.766000000000000e-9 seed = 1169097652 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.110000000000000e-9 seed = -1357749821 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.040000000000000e-9 seed = 1694474301 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.601000000000000e-9 seed = 839386515 media =0.000000000000000 sigma = 0.000000001000000
vddana_0p8 = 0.82 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.020000000000000e-9 seed = -1409601881 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.922000000000000e-9 seed = 2023223888 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.134000000000000e-9 seed = 580445055 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.330000000000000e-9 seed = 944077629 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.073000000000000e-9 seed = -138048066 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.073000000000000e-9 seed = 303588197 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.298000000000000e-9 seed = 442560743 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.725000000000000e-9 seed = -960917052 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.938000000000000e-9 seed = -1220144629 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.206000000000000e-9 seed = -1457267946 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.671000000000000e-9 seed = -1854683885 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.098000000000000e-9 seed = -1409198648 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.743000000000000e-9 seed = 1361983315 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.563000000000000e-9 seed = -2044785301 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.027000000000000e-9 seed = 1835707216 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -3.105000000000000e-9 seed = 2098716546 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.659000000000000e-9 seed = 1490217481 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.030000000000000e-9 seed = -549713808 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.915000000000000e-9 seed = -1204472730 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.423000000000000e-9 seed = -1725466449 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.261000000000000e-9 seed = 509160449 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.488000000000000e-9 seed = -703959367 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.552000000000000e-9 seed = -1578445168 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.683000000000000e-9 seed = 1718837231 media =0.000000000000000 sigma = 0.000000001000000
vddana_0p8 = 0.83 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.481000000000000e-9 seed = 1991226127 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.042000000000000e-9 seed = 1299990983 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.836000000000000e-9 seed = 1145416567 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.745000000000000e-9 seed = -1829543895 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.704000000000000e-9 seed = 1682276712 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.093000000000000e-9 seed = -1382145392 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.826000000000000e-9 seed = -1098030322 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.579000000000000e-9 seed = -898978653 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.533000000000000e-9 seed = 1365115334 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.637000000000000e-9 seed = 1697545294 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.731000000000000e-9 seed = 2053658550 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.282000000000000e-9 seed = 570593434 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.982000000000000e-9 seed = -1749234026 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.570000000000000e-9 seed = -1855243309 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.278000000000000e-9 seed = -407281382 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.001000000000000e-9 seed = -1502484986 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.154000000000000e-9 seed = -270780429 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.869000000000000e-9 seed = -1283373685 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.122000000000000e-9 seed = 210145928 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.339000000000000e-9 seed = 1923178483 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.325000000000000e-9 seed = -1219332949 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.234000000000000e-9 seed = -592577262 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.069000000000000e-9 seed = -112748471 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.469000000000000e-9 seed = 966685053 media =0.000000000000000 sigma = 0.000000001000000
vddana_0p8 = 0.84 V
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.780000000000000e-9 seed = -1095457345 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.635000000000000e-9 seed = 922039062 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.261000000000000e-9 seed = 506631331 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.729000000000000e-9 seed = 957640397 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.005000000000000e-9 seed = -384670255 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.448000000000000e-9 seed = -1639472128 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.696000000000000e-9 seed = 1746269294 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.178000000000000e-9 seed = -1698471828 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.070000000000000e-9 seed = 1110001775 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.340000000000000e-9 seed = -484664309 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.036000000000000e-9 seed = -1287572933 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.311000000000000e-9 seed = -1125050169 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.547000000000000e-9 seed = 835026900 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.701000000000000e-9 seed = 2047173718 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.536000000000000e-9 seed = -740953799 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.257000000000000e-9 seed = -1443769171 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.232000000000000e-9 seed = 398322604 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.060000000000000e-9 seed = -1305577664 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.462000000000000e-9 seed = 1976277199 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.619000000000000e-9 seed = 868034409 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.556000000000000e-9 seed = 1246166934 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.383000000000000e-9 seed = 951739619 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.597000000000000e-9 seed = 2095806102 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.237000000000000e-9 seed = -358845489 media =0.000000000000000 sigma = 0.000000001000000
Barrido de atb_ena:
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.703000000000000e-9 seed = 1833232443 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.029000000000000e-9 seed = -296623788 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.248000000000000e-9 seed = -1484076766 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.599000000000000e-9 seed = -1619269248 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.485000000000000e-9 seed = -862130789 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.484000000000000e-9 seed = -1175053811 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.056000000000000e-9 seed = 452177942 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.856000000000000e-9 seed = 1893370034 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.072000000000000e-9 seed = 1032340805 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.048000000000000e-9 seed = -2048105742 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.031000000000000e-9 seed = 1563446536 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.022000000000000e-9 seed = -1441571267 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.321000000000000e-9 seed = -838622351 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.421000000000000e-9 seed = -1581511051 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.888000000000000e-9 seed = -2132807716 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.263000000000000e-9 seed = 1180003292 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.478000000000000e-9 seed = 1692104463 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.701000000000000e-9 seed = -1008660919 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.308000000000000e-9 seed = -1637629957 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.961000000000000e-9 seed = 1962046445 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.558000000000000e-9 seed = -1654100337 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.794000000000000e-9 seed = -1823500328 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.334000000000000e-9 seed = -1972784360 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.702000000000000e-9 seed = -2049120911 media =0.000000000000000 sigma = 0.000000001000000
atb_ena = 00
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.536000000000000e-9 seed = 1738244162 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.180000000000000e-9 seed = -1421561915 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.927000000000000e-9 seed = 2100863316 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.069000000000000e-9 seed = 116894017 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.347000000000000e-9 seed = -1159135147 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.080000000000000e-9 seed = -120192466 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.313000000000000e-9 seed = -1489889254 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.336000000000000e-9 seed = -1887710035 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.174000000000000e-9 seed = -991856151 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.318000000000000e-9 seed = 460812393 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.520000000000000e-9 seed = 1723621873 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.018000000000000e-9 seed = -102903467 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.626000000000000e-9 seed = -1110183494 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.330000000000000e-9 seed = 488089350 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.153000000000000e-9 seed = 797537399 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.218000000000000e-9 seed = 2010595727 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.341000000000000e-9 seed = -718551461 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.424000000000000e-9 seed = -763868477 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.065000000000000e-9 seed = -202496277 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.425000000000000e-9 seed = 1292538006 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.234000000000000e-9 seed = -570143494 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.236000000000000e-9 seed = -1748544593 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.368000000000000e-9 seed = 1565458472 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.744000000000000e-9 seed = -2030645843 media =0.000000000000000 sigma = 0.000000001000000
atb_ena = 01
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.807000000000000e-9 seed = -2025739089 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.034000000000000e-9 seed = 58367066 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.024000000000000e-9 seed = 2100887159 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.726000000000000e-9 seed = -986354155 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.101000000000000e-9 seed = -647045216 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.402000000000000e-9 seed = -1652147912 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.921000000000000e-9 seed = -1208350101 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.394000000000000e-9 seed = 593465478 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.601000000000000e-9 seed = 1515286102 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.159000000000000e-9 seed = -251928108 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.259000000000000e-9 seed = -531444470 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.262000000000000e-9 seed = -385930229 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.561000000000000e-9 seed = -919117189 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.440000000000000e-9 seed = -1849087699 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.861000000000000e-9 seed = -1200602521 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.036000000000000e-9 seed = 57048491 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.287000000000000e-9 seed = 576184043 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.700000000000000e-9 seed = -946706289 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.522000000000000e-9 seed = -718461837 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.206000000000000e-9 seed = -1431144000 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.717000000000000e-9 seed = 1802730737 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.099000000000000e-9 seed = -1900572739 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.782000000000000e-9 seed = -1066391764 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.653000000000000e-9 seed = 898076617 media =0.000000000000000 sigma = 0.000000001000000
atb_ena = 10
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.672000000000000e-9 seed = -2117898088 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.234000000000000e-9 seed = -2108415668 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.239000000000000e-9 seed = -1814486863 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.486000000000000e-9 seed = 917175233 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.794000000000000e-9 seed = 1254642095 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.109000000000000e-9 seed = -1334524521 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.064000000000000e-9 seed = -95915723 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.569000000000000e-9 seed = 1766423967 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.282000000000000e-9 seed = 1786124047 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.025000000000000e-9 seed = -248431558 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.571000000000000e-9 seed = -1343954618 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.727000000000000e-9 seed = -1158187265 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.505000000000000e-9 seed = 1629148781 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.648000000000000e-9 seed = -866542067 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.050000000000000e-9 seed = 119710409 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.497000000000000e-9 seed = -1913017858 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.317000000000000e-9 seed = 1520593493 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.366000000000000e-9 seed = 2132875510 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.087000000000000e-9 seed = -233784967 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.532000000000000e-9 seed = -728100985 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.079000000000000e-9 seed = 1340336779 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.465000000000000e-9 seed = -675263250 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.692000000000000e-9 seed = -1647283624 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.362000000000000e-9 seed = 1878186154 media =0.000000000000000 sigma = 0.000000001000000
atb_ena = 11
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.408000000000000e-9 seed = -745796950 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.289000000000000e-9 seed = 1072102273 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.421000000000000e-9 seed = -926423000 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.461000000000000e-9 seed = 1607789002 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.098000000000000e-9 seed = 1339544832 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.820000000000000e-9 seed = -1096702811 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.214000000000000e-9 seed = -732192282 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.452000000000000e-9 seed = 1080963613 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.528000000000000e-9 seed = -730354162 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.063000000000000e-9 seed = -127322294 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.600000000000000e-9 seed = -811701693 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.042000000000000e-9 seed = -1292509314 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.521000000000000e-9 seed = -1637567398 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.539000000000000e-9 seed = 792348867 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.359000000000000e-9 seed = -1647397766 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.899000000000000e-9 seed = 1262428100 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.001000000000000e-9 seed = 1767779782 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.058000000000000e-9 seed = -1300327081 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.638000000000000e-9 seed = 1907492945 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.153000000000000e-9 seed = 1276004418 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.093000000000000e-9 seed = -1709188336 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.248000000000000e-9 seed = 1112459328 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.599000000000000e-9 seed = 807097469 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.718000000000000e-9 seed = -954208953 media =0.000000000000000 sigma = 0.000000001000000
Barrido de pdb:
pdb = 0
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.159000000000000e-9 seed = -2025465360 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.946000000000000e-9 seed = -1475792745 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.019000000000000e-9 seed = 1277508761 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.713000000000000e-9 seed = 1068004213 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.305000000000000e-9 seed = -1502789758 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.976000000000000e-9 seed = -1633506007 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.198000000000000e-9 seed = -360134525 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.317000000000000e-9 seed = 567437756 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.516000000000000e-9 seed = -2015826446 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -2.125000000000000e-9 seed = 1970714735 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.353000000000000e-9 seed = -507499271 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.508000000000000e-9 seed = -840543628 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.132000000000000e-9 seed = 1617035175 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.903000000000000e-9 seed = -1282607341 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 2.036000000000000e-9 seed = -2078854592 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.158000000000000e-9 seed = -1709920181 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.015000000000000e-9 seed = 1417334827 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.481000000000000e-9 seed = 695855957 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.187000000000000e-9 seed = 909213025 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.010000000000000e-9 seed = -159070876 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -1.166000000000000e-9 seed = 1382374116 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 1.189000000000000e-9 seed = -1797461944 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = 0.342000000000000e-9 seed = -540315095 media =0.000000000000000 sigma = 0.000000001000000
Probando $dist_normal con mean = 0.00 y std_dev = 1000.00
noise = -0.889000000000000e-9 seed = 1169440650 media =0.000000000000000 sigma = 0.000000001000000
pdb = 1
Simulation complete via $finish(1) at time 510 PS + 0
./tb/currentSourceUnits_tb.sv:134         $finish;
xcelium> ^C
xcelium> exit
TOOL:	xrun(64)	24.03-s004: Exiting on Jan 22, 2026 at 20:18:12 CET  (total: 00:02:33)
