xrun(64): 24.03-s004: (c) Copyright 1995-2024 Cadence Design Systems, Inc.
TOOL:	xrun(64)	24.03-s004: Started on Jan 07, 2026 at 09:57:51 CET
xrun
	-f xrun.f
		-clean
		./models/currentSourceUnits_mismatch.sv
		./tb/currentSourceUnits_tb.sv
		-access +rw
		-s
		-input /home/msegper/Documents/TFM/current_source_units/restore.tcl
xrun: *N,CLEAN: Removing existing directory ./xcelium.d.
file: ./models/currentSourceUnits_mismatch.sv
	module worklib.currentSourceUnits:sv
		errors: 0, warnings: 0
file: ./tb/currentSourceUnits_tb.sv
	module worklib.currentSourceUnits_tb:sv
		errors: 0, warnings: 0
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
	Top level design units:
		cds_rnm_pkg
		$unit_0x1db61142
		currentSourceUnits_tb
	Building instance overlay tables: ....................
        $display("Raw binary mismatch = %0d", temp);
                                                 |
xmelab: *W,REALCV (./models/currentSourceUnits_mismatch.sv,103|49): Real argument converted to integer for (%d).
 Done
	Using implicit TMP libraries; associated with library worklib
	Generating native compiled code:
		worklib.currentSourceUnits:sv <0x600e54fd>
			streams:  11, words: 38290
		worklib.currentSourceUnits_tb:sv <0x1850169b>
			streams:  34, words: 26473
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                 Instances  Unique
		Modules:                 2       2
		Verilog packages:        1       1
		Registers:              97      97
		Scalar wires:           31       -
		Vectored wires:          1       -
		Always blocks:           5       5
		Initial blocks:          7       7
		Pseudo assignments:     32       -
		Assertions:              4       4
		Compilation units:       1       1
		Simulation timescale:  1ps
	Writing initial simulation snapshot: worklib.currentSourceUnits_tb:sv
Loading snapshot worklib.currentSourceUnits_tb:sv .................... Done
SVSEED default: 1
[DMSINFO] Simulating with Xcelium Mixed-Signal App...
xcelium> source /eda/cadence/2024-25/RHELx86/XCELIUM_24.03.004/tools/xcelium/files/xmsimrc
xcelium> 
xcelium> # XM-Sim Command File
xcelium> # TOOL:	xmsim(64)	24.03-s004
xcelium> #
xcelium> #
xcelium> # You can restore this configuration with:
xcelium> #
xcelium> #      xrun -f xrun.f -input /home/msegper/Documents/TFM/current_source_units/restore.tcl
xcelium> #
xcelium> 
xcelium> set tcl_prompt1 {puts -nonewline "xcelium> "}
puts -nonewline "xcelium> "
xcelium> set tcl_prompt2 {puts -nonewline "> "}
puts -nonewline "> "
xcelium> set vlog_format %h
%h
xcelium> set vhdl_format %v
%v
xcelium> set real_precision 6
6
xcelium> set display_unit auto
auto
xcelium> set time_unit module
module
xcelium> set heap_garbage_size -200
-200
xcelium> set heap_garbage_time 0
0
xcelium> set assert_report_level note
note
xcelium> set assert_stop_level error
error
xcelium> set autoscope yes
yes
xcelium> set assert_1164_warnings yes
yes
xcelium> set pack_assert_off {}
xcelium> set severity_pack_assert_off {note warning}
note warning
xcelium> set assert_output_stop_level failed
failed
xcelium> set tcl_debug_level 0
0
xcelium> set relax_path_name 1
1
xcelium> set vhdl_vcdmap XX01ZX01X
XX01ZX01X
xcelium> set intovf_severity_level ERROR
ERROR
xcelium> set probe_screen_format 0
0
xcelium> set rangecnst_severity_level ERROR
ERROR
xcelium> set textio_severity_level ERROR
ERROR
xcelium> set vital_timing_checks_on 1
1
xcelium> set vlog_code_show_force 0
0
xcelium> set assert_count_attempts 1
1
xcelium> set tcl_all64 false
false
xcelium> set tcl_runerror_exit false
false
xcelium> set assert_report_incompletes 0
0
xcelium> set show_force 1
1
xcelium> set force_reset_by_reinvoke 0
0
xcelium> set tcl_relaxed_literal 0
0
xcelium> set probe_exclude_patterns {}
xcelium> set probe_packed_limit 4k
4k
xcelium> set probe_unpacked_limit 16k
16k
xcelium> set assert_internal_msg no
no
xcelium> set svseed 1
1
xcelium> set assert_reporting_mode 0
0
xcelium> set vcd_compact_mode 0
0
xcelium> set vhdl_forgen_loopindex_enum_pos 0
0
xcelium> set xmreplay_dc_debug 0
0
xcelium> set tcl_runcmd_interrupt next_command
next_command
xcelium> set tcl_sigval_prefix {#}
#
xcelium> alias . run
xcelium> alias indago verisium
xcelium> alias quit exit
xcelium> database -open -shm -into waves.shm waves -default
Created default SHM database waves
xcelium> probe -create -database waves currentSourceUnits_tb.dut.vssana currentSourceUnits_tb.dut.vddana_1p8 currentSourceUnits_tb.dut.vddana_0p8 currentSourceUnits_tb.dut.pdb currentSourceUnits_tb.dut.iref_500ua currentSourceUnits_tb.dut.atb_ena currentSourceUnits_tb.dut.atb1 currentSourceUnits_tb.dut.atb0 currentSourceUnits_tb.dut.Iout_binary_5 currentSourceUnits_tb.dut.Iout_binary_4 currentSourceUnits_tb.dut.Iout_binary_3 currentSourceUnits_tb.dut.Iout_binary_2 currentSourceUnits_tb.dut.Iout_binary_1 currentSourceUnits_tb.dut.Iout_binary_0_red currentSourceUnits_tb.dut.Iout_binary_0
Created probe 1
xcelium> probe -create -database waves currentSourceUnits_tb.dut.Iout_them_0 currentSourceUnits_tb.dut.Iout_them_1 currentSourceUnits_tb.dut.Iout_them_2 currentSourceUnits_tb.dut.Iout_them_3 currentSourceUnits_tb.dut.Iout_them_4 currentSourceUnits_tb.dut.Iout_them_5 currentSourceUnits_tb.dut.Iout_them_6 currentSourceUnits_tb.dut.Iout_them_7 currentSourceUnits_tb.dut.Iout_them_8 currentSourceUnits_tb.dut.Iout_them_9 currentSourceUnits_tb.dut.Iout_them_10 currentSourceUnits_tb.dut.Iout_them_11 currentSourceUnits_tb.dut.Iout_them_12 currentSourceUnits_tb.dut.Iout_them_13 currentSourceUnits_tb.dut.Iout_them_14 currentSourceUnits_tb.dut.Iout_them_15 currentSourceUnits_tb.dut.Iout_them_16
Created probe 2
xcelium> 
xcelium> simvision -input restore.tcl.svcf

-------------------------------------
Relinquished control to SimVision...
xcelium> 
xcelium> run
Raw binary mismatch =         504
Binary mismatch= -0.0150
Raw binary mismatch =        1373
Binary mismatch= -0.0063
Raw binary mismatch =         659
Binary mismatch= -0.0134
Raw binary mismatch =         122
Binary mismatch= -0.0188
Raw binary mismatch =        3842
Binary mismatch= 0.0184
Raw binary mismatch =         298
Binary mismatch= -0.0170
Raw binary mismatch =         629
Binary mismatch= -0.0137
Raw binary mismatch =        3411
Binary mismatch= 0.0141
Raw binary mismatch =        3321
Binary mismatch= 0.0132
Raw binary mismatch =          51
Binary mismatch= -0.0195
Raw binary mismatch =        1661
Binary mismatch= -0.0034
Raw binary mismatch =        2439
Binary mismatch= 0.0044
Raw binary mismatch =         579
Binary mismatch= -0.0142
Raw binary mismatch =        1342
Binary mismatch= -0.0066
Raw binary mismatch =        3977
Binary mismatch= 0.0198
Raw binary mismatch =         864
Binary mismatch= -0.0114
Raw binary mismatch =         884
Binary mismatch= -0.0112
Raw binary mismatch =        1020
Binary mismatch= -0.0098
Raw binary mismatch =        1024
Binary mismatch= -0.0098
Raw binary mismatch =        2933
Binary mismatch= 0.0093
Raw binary mismatch =        2504
Binary mismatch= 0.0050
Raw binary mismatch =        1387
Binary mismatch= -0.0061
Raw binary mismatch =         983
Binary mismatch= -0.0102
Raw binary mismatch =         618
Binary mismatch= -0.0138
Barrido de iref_500ua:
iref_500ua = 0.000450 A
iref_500ua = 0.000500 A
iref_500ua = 0.000550 A
Barrido de vddana_1p8:
vddana_1p8 = 1.71 V
vddana_1p8 = 1.72 V
vddana_1p8 = 1.73 V
vddana_1p8 = 1.74 V
vddana_1p8 = 1.75 V
vddana_1p8 = 1.76 V
vddana_1p8 = 1.77 V
vddana_1p8 = 1.78 V
vddana_1p8 = 1.79 V
vddana_1p8 = 1.80 V
vddana_1p8 = 1.81 V
vddana_1p8 = 1.82 V
vddana_1p8 = 1.83 V
vddana_1p8 = 1.84 V
vddana_1p8 = 1.85 V
vddana_1p8 = 1.86 V
vddana_1p8 = 1.87 V
vddana_1p8 = 1.88 V
vddana_1p8 = 1.89 V
Barrido de vddana_0p8:
vddana_0p8 = 0.76 V
vddana_0p8 = 0.77 V
vddana_0p8 = 0.78 V
vddana_0p8 = 0.79 V
vddana_0p8 = 0.80 V
vddana_0p8 = 0.81 V
vddana_0p8 = 0.82 V
vddana_0p8 = 0.83 V
vddana_0p8 = 0.84 V
Barrido de atb_ena:
atb_ena = 00
atb_ena = 01
atb_ena = 10
atb_ena = 11
Barrido de pdb:
pdb = 0
pdb = 1
Simulation complete via $finish(1) at time 510 PS + 0
./tb/currentSourceUnits_tb.sv:134         $finish;
xcelium> ^C
xcelium> exit
TOOL:	xrun(64)	24.03-s004: Exiting on Jan 07, 2026 at 10:04:38 CET  (total: 00:06:47)
