xrun(64): 24.03-s004: (c) Copyright 1995-2024 Cadence Design Systems, Inc.
TOOL:	xrun(64)	24.03-s004: Started on Jun 18, 2025 at 18:42:27 CEST
xrun
	-f xrun.f
		-clean
		./models/level_shifter.sv
		./tb/level_shifter_tb.sv
		-access +rw
		-gui
		-s
		-input /home/msegper/Documents/TFM/level_shifter/restore.tcl
xrun: *N,CLEAN: Removing existing directory ./xcelium.d.
file: ./models/level_shifter.sv
	module worklib.level_shifter:sv
		errors: 0, warnings: 0
file: ./tb/level_shifter_tb.sv
	module worklib.tb_level_shifter:sv
		errors: 0, warnings: 0
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
xmelab: *N,MSFLON: Xcelium will initiate mixed signal elaboration, Reason: RNM module.
	Top level design units:
		cds_rnm_pkg
		tb_level_shifter
	Building instance overlay tables: .................... Done
	Using implicit TMP libraries; associated with library worklib
	Generating native compiled code:
		worklib.level_shifter:sv <0x2ece349e>
			streams:   1, words:   645
		worklib.tb_level_shifter:sv <0x6ae310a6>
			streams:   5, words:  9218
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                 Instances  Unique
		Modules:                 2       2
		Verilog packages:        1       1
		Registers:               9       9
		Scalar wires:            4       -
		Always blocks:           1       1
		Initial blocks:          1       1
		Pseudo assignments:      4       -
		Simulation timescale:  1ps
	Writing initial simulation snapshot: worklib.tb_level_shifter:sv
xmsim: *W,NOMTDGUI: Multi-Threaded Dumping is disabled for interactive debug mode.
[DMSINFO] Simulating with Xcelium Mixed-Signal App...

-------------------------------------
Relinquished control to SimVision...
xcelium> 
xcelium> source /eda/cadence/2024-25/RHELx86/XCELIUM_24.03.004/tools/xcelium/files/xmsimrc
xcelium> 
xcelium> # XM-Sim Command File
xcelium> # TOOL:	xmsim(64)	24.03-s004
xcelium> #
xcelium> #
xcelium> # You can restore this configuration with:
xcelium> #
xcelium> #      xrun -f xrun.f -s -input /home/msegper/Documents/TFM/level_shifter/restore.tcl
xcelium> #
xcelium> 
xcelium> set tcl_prompt1 {puts -nonewline "xcelium> "}
puts -nonewline "xcelium> "
xcelium> set tcl_prompt2 {puts -nonewline "> "}
puts -nonewline "> "
xcelium> set vlog_format %h
%h
xcelium> set vhdl_format %v
%v
xcelium> set real_precision 6
6
xcelium> set display_unit auto
auto
xcelium> set time_unit module
module
xcelium> set heap_garbage_size -200
-200
xcelium> set heap_garbage_time 0
0
xcelium> set assert_report_level note
note
xcelium> set assert_stop_level error
error
xcelium> set autoscope yes
yes
xcelium> set assert_1164_warnings yes
yes
xcelium> set pack_assert_off {}
xcelium> set severity_pack_assert_off {note warning}
note warning
xcelium> set assert_output_stop_level failed
failed
xcelium> set tcl_debug_level 0
0
xcelium> set relax_path_name 1
1
xcelium> set vhdl_vcdmap XX01ZX01X
XX01ZX01X
xcelium> set intovf_severity_level ERROR
ERROR
xcelium> set probe_screen_format 0
0
xcelium> set rangecnst_severity_level ERROR
ERROR
xcelium> set textio_severity_level ERROR
ERROR
xcelium> set vital_timing_checks_on 1
1
xcelium> set vlog_code_show_force 0
0
xcelium> set assert_count_attempts 1
1
xcelium> set tcl_all64 false
false
xcelium> set tcl_runerror_exit false
false
xcelium> set assert_report_incompletes 0
0
xcelium> set show_force 1
1
xcelium> set force_reset_by_reinvoke 0
0
xcelium> set tcl_relaxed_literal 0
0
xcelium> set probe_exclude_patterns {}
xcelium> set probe_packed_limit 4k
4k
xcelium> set probe_unpacked_limit 16k
16k
xcelium> set assert_internal_msg no
no
xcelium> set svseed 1
1
xcelium> set assert_reporting_mode 0
0
xcelium> set vcd_compact_mode 0
0
xcelium> set vhdl_forgen_loopindex_enum_pos 0
0
xcelium> set xmreplay_dc_debug 0
0
xcelium> set tcl_runcmd_interrupt next_command
next_command
xcelium> set tcl_sigval_prefix {#}
#
xcelium> alias . run
xcelium> alias indago verisium
xcelium> alias quit exit
xcelium> database -open -shm -into waves.shm waves -default
Created default SHM database waves
xcelium> probe -create -database waves tb_level_shifter.dut.VCC_HIGH tb_level_shifter.dut.VCC_LOW tb_level_shifter.dut.VIN tb_level_shifter.dut.VOUT
Created probe 1
xcelium> probe -create -database waves tb_level_shifter.dut.VCC_HIGH tb_level_shifter.dut.VCC_LOW tb_level_shifter.dut.VIN tb_level_shifter.dut.VOUT
Created probe 2
xcelium> 
xcelium> simvision -input restore.tcl.svcf
xcelium> run
Barrido ascendente:
VIN = -0.99, VOUT = 0.00
VIN = -0.98, VOUT = 0.00
VIN = -0.97, VOUT = 0.00
VIN = -0.96, VOUT = 0.00
VIN = -0.95, VOUT = 0.00
VIN = -0.94, VOUT = 0.00
VIN = -0.93, VOUT = 0.00
VIN = -0.92, VOUT = 0.00
VIN = -0.91, VOUT = 0.00
VIN = -0.90, VOUT = 0.00
VIN = -0.89, VOUT = 0.00
VIN = -0.88, VOUT = 0.00
VIN = -0.87, VOUT = 0.00
VIN = -0.86, VOUT = 0.00
VIN = -0.85, VOUT = 0.00
VIN = -0.84, VOUT = 0.00
VIN = -0.83, VOUT = 0.00
VIN = -0.82, VOUT = 0.00
VIN = -0.81, VOUT = 0.00
VIN = -0.80, VOUT = 0.00
VIN = -0.79, VOUT = 0.00
VIN = -0.78, VOUT = 0.00
VIN = -0.77, VOUT = 0.00
VIN = -0.76, VOUT = 0.00
VIN = -0.75, VOUT = 0.00
VIN = -0.74, VOUT = 0.00
VIN = -0.73, VOUT = 0.00
VIN = -0.72, VOUT = 0.00
VIN = -0.71, VOUT = 0.00
VIN = -0.70, VOUT = 0.00
VIN = -0.69, VOUT = 0.00
VIN = -0.68, VOUT = 0.00
VIN = -0.67, VOUT = 0.00
VIN = -0.66, VOUT = 0.00
VIN = -0.65, VOUT = 0.00
VIN = -0.64, VOUT = 0.00
VIN = -0.63, VOUT = 0.00
VIN = -0.62, VOUT = 0.00
VIN = -0.61, VOUT = 0.00
VIN = -0.60, VOUT = 0.00
VIN = -0.59, VOUT = 0.00
VIN = -0.58, VOUT = 0.00
VIN = -0.57, VOUT = 0.00
VIN = -0.56, VOUT = 0.00
VIN = -0.55, VOUT = 0.00
VIN = -0.54, VOUT = 0.00
VIN = -0.53, VOUT = 0.00
VIN = -0.52, VOUT = 0.00
VIN = -0.51, VOUT = 0.00
VIN = -0.50, VOUT = 0.00
VIN = -0.49, VOUT = 0.00
VIN = -0.48, VOUT = 0.00
VIN = -0.47, VOUT = 0.00
VIN = -0.46, VOUT = 0.00
VIN = -0.45, VOUT = 0.00
VIN = -0.44, VOUT = 0.00
VIN = -0.43, VOUT = 0.00
VIN = -0.42, VOUT = 0.00
VIN = -0.41, VOUT = 0.00
VIN = -0.40, VOUT = 0.00
VIN = -0.39, VOUT = 0.00
VIN = -0.38, VOUT = 0.00
VIN = -0.37, VOUT = 0.00
VIN = -0.36, VOUT = 0.00
VIN = -0.35, VOUT = 0.00
VIN = -0.34, VOUT = 0.00
VIN = -0.33, VOUT = 0.00
VIN = -0.32, VOUT = 0.00
VIN = -0.31, VOUT = 0.00
VIN = -0.30, VOUT = 0.00
VIN = -0.29, VOUT = 0.00
VIN = -0.28, VOUT = 0.00
VIN = -0.27, VOUT = 0.00
VIN = -0.26, VOUT = 0.00
VIN = -0.25, VOUT = 0.00
VIN = -0.24, VOUT = 0.00
VIN = -0.23, VOUT = 0.00
VIN = -0.22, VOUT = 0.00
VIN = -0.21, VOUT = 0.00
VIN = -0.20, VOUT = 0.00
VIN = -0.19, VOUT = 0.00
VIN = -0.18, VOUT = 0.00
VIN = -0.17, VOUT = 0.00
VIN = -0.16, VOUT = 0.00
VIN = -0.15, VOUT = 0.00
VIN = -0.14, VOUT = 0.00
VIN = -0.13, VOUT = 0.00
VIN = -0.12, VOUT = 0.00
VIN = -0.11, VOUT = 0.00
VIN = -0.10, VOUT = 0.00
VIN = -0.09, VOUT = 0.00
VIN = -0.08, VOUT = 0.00
VIN = -0.07, VOUT = 0.00
VIN = -0.06, VOUT = 0.00
VIN = -0.05, VOUT = 0.00
VIN = -0.04, VOUT = 0.00
VIN = -0.03, VOUT = 0.00
VIN = -0.02, VOUT = 0.00
VIN = -0.01, VOUT = 0.00
VIN = 0.00, VOUT = 0.00
VIN = 0.01, VOUT = 0.00
VIN = 0.02, VOUT = 0.00
VIN = 0.03, VOUT = 0.00
VIN = 0.04, VOUT = 0.00
VIN = 0.05, VOUT = 0.00
VIN = 0.06, VOUT = 0.00
VIN = 0.07, VOUT = 0.00
VIN = 0.08, VOUT = 0.00
VIN = 0.09, VOUT = 0.00
VIN = 0.10, VOUT = 0.00
VIN = 0.11, VOUT = 0.00
VIN = 0.12, VOUT = 0.00
VIN = 0.13, VOUT = 0.00
VIN = 0.14, VOUT = 0.00
VIN = 0.15, VOUT = 0.00
VIN = 0.16, VOUT = 0.00
VIN = 0.17, VOUT = 0.00
VIN = 0.18, VOUT = 0.00
VIN = 0.19, VOUT = 0.00
VIN = 0.20, VOUT = 0.00
VIN = 0.21, VOUT = 0.00
VIN = 0.22, VOUT = 0.00
VIN = 0.23, VOUT = 0.00
VIN = 0.24, VOUT = 0.00
VIN = 0.25, VOUT = 0.00
VIN = 0.26, VOUT = 0.00
VIN = 0.27, VOUT = 0.00
VIN = 0.28, VOUT = 0.00
VIN = 0.29, VOUT = 0.00
VIN = 0.30, VOUT = 0.00
VIN = 0.31, VOUT = 0.00
VIN = 0.32, VOUT = 0.00
VIN = 0.33, VOUT = 0.00
VIN = 0.34, VOUT = 0.00
VIN = 0.35, VOUT = 0.00
VIN = 0.36, VOUT = 0.00
VIN = 0.37, VOUT = 0.00
VIN = 0.38, VOUT = 0.00
VIN = 0.39, VOUT = 0.00
VIN = 0.40, VOUT = 0.00
VIN = 0.41, VOUT = 0.00
VIN = 0.42, VOUT = 0.00
VIN = 0.43, VOUT = 0.00
VIN = 0.44, VOUT = 0.00
VIN = 0.45, VOUT = 0.00
VIN = 0.46, VOUT = 0.00
VIN = 0.47, VOUT = 0.00
VIN = 0.48, VOUT = 0.00
VIN = 0.49, VOUT = 0.00
VIN = 0.50, VOUT = 0.00
VIN = 0.51, VOUT = 1.80
VIN = 0.52, VOUT = 1.80
VIN = 0.53, VOUT = 1.80
VIN = 0.54, VOUT = 1.80
VIN = 0.55, VOUT = 1.80
VIN = 0.56, VOUT = 1.80
VIN = 0.57, VOUT = 1.80
VIN = 0.58, VOUT = 1.80
VIN = 0.59, VOUT = 1.80
VIN = 0.60, VOUT = 1.80
VIN = 0.61, VOUT = 1.80
VIN = 0.62, VOUT = 1.80
VIN = 0.63, VOUT = 1.80
VIN = 0.64, VOUT = 1.80
VIN = 0.65, VOUT = 1.80
VIN = 0.66, VOUT = 1.80
VIN = 0.67, VOUT = 1.80
VIN = 0.68, VOUT = 1.80
VIN = 0.69, VOUT = 1.80
VIN = 0.70, VOUT = 1.80
VIN = 0.71, VOUT = 1.80
VIN = 0.72, VOUT = 1.80
VIN = 0.73, VOUT = 1.80
VIN = 0.74, VOUT = 1.80
VIN = 0.75, VOUT = 1.80
VIN = 0.76, VOUT = 1.80
VIN = 0.77, VOUT = 1.80
VIN = 0.78, VOUT = 1.80
VIN = 0.79, VOUT = 1.80
VIN = 0.80, VOUT = 1.80
VIN = 0.81, VOUT = 1.80
VIN = 0.82, VOUT = 1.80
VIN = 0.83, VOUT = 1.80
VIN = 0.84, VOUT = 1.80
VIN = 0.85, VOUT = 1.80
VIN = 0.86, VOUT = 1.80
VIN = 0.87, VOUT = 1.80
VIN = 0.88, VOUT = 1.80
VIN = 0.89, VOUT = 1.80
VIN = 0.90, VOUT = 1.80
VIN = 0.91, VOUT = 1.80
VIN = 0.92, VOUT = 1.80
VIN = 0.93, VOUT = 1.80
VIN = 0.94, VOUT = 1.80
VIN = 0.95, VOUT = 1.80
VIN = 0.96, VOUT = 1.80
VIN = 0.97, VOUT = 1.80
VIN = 0.98, VOUT = 1.80
VIN = 0.99, VOUT = 1.80
VIN = 1.00, VOUT = 1.80
Barrido descendente:
VIN = 0.99, VOUT = 1.80
VIN = 0.98, VOUT = 1.80
VIN = 0.97, VOUT = 1.80
VIN = 0.96, VOUT = 1.80
VIN = 0.95, VOUT = 1.80
VIN = 0.94, VOUT = 1.80
VIN = 0.93, VOUT = 1.80
VIN = 0.92, VOUT = 1.80
VIN = 0.91, VOUT = 1.80
VIN = 0.90, VOUT = 1.80
VIN = 0.89, VOUT = 1.80
VIN = 0.88, VOUT = 1.80
VIN = 0.87, VOUT = 1.80
VIN = 0.86, VOUT = 1.80
VIN = 0.85, VOUT = 1.80
VIN = 0.84, VOUT = 1.80
VIN = 0.83, VOUT = 1.80
VIN = 0.82, VOUT = 1.80
VIN = 0.81, VOUT = 1.80
VIN = 0.80, VOUT = 1.80
VIN = 0.79, VOUT = 1.80
VIN = 0.78, VOUT = 1.80
VIN = 0.77, VOUT = 1.80
VIN = 0.76, VOUT = 1.80
VIN = 0.75, VOUT = 1.80
VIN = 0.74, VOUT = 1.80
VIN = 0.73, VOUT = 1.80
VIN = 0.72, VOUT = 1.80
VIN = 0.71, VOUT = 1.80
VIN = 0.70, VOUT = 1.80
VIN = 0.69, VOUT = 1.80
VIN = 0.68, VOUT = 1.80
VIN = 0.67, VOUT = 1.80
VIN = 0.66, VOUT = 1.80
VIN = 0.65, VOUT = 1.80
VIN = 0.64, VOUT = 1.80
VIN = 0.63, VOUT = 1.80
VIN = 0.62, VOUT = 1.80
VIN = 0.61, VOUT = 1.80
VIN = 0.60, VOUT = 1.80
VIN = 0.59, VOUT = 1.80
VIN = 0.58, VOUT = 1.80
VIN = 0.57, VOUT = 1.80
VIN = 0.56, VOUT = 1.80
VIN = 0.55, VOUT = 1.80
VIN = 0.54, VOUT = 1.80
VIN = 0.53, VOUT = 1.80
VIN = 0.52, VOUT = 1.80
VIN = 0.51, VOUT = 1.80
VIN = 0.50, VOUT = 1.80
VIN = 0.49, VOUT = 0.00
VIN = 0.48, VOUT = 0.00
VIN = 0.47, VOUT = 0.00
VIN = 0.46, VOUT = 0.00
VIN = 0.45, VOUT = 0.00
VIN = 0.44, VOUT = 0.00
VIN = 0.43, VOUT = 0.00
VIN = 0.42, VOUT = 0.00
VIN = 0.41, VOUT = 0.00
VIN = 0.40, VOUT = 0.00
VIN = 0.39, VOUT = 0.00
VIN = 0.38, VOUT = 0.00
VIN = 0.37, VOUT = 0.00
VIN = 0.36, VOUT = 0.00
VIN = 0.35, VOUT = 0.00
VIN = 0.34, VOUT = 0.00
VIN = 0.33, VOUT = 0.00
VIN = 0.32, VOUT = 0.00
VIN = 0.31, VOUT = 0.00
VIN = 0.30, VOUT = 0.00
VIN = 0.29, VOUT = 0.00
VIN = 0.28, VOUT = 0.00
VIN = 0.27, VOUT = 0.00
VIN = 0.26, VOUT = 0.00
VIN = 0.25, VOUT = 0.00
VIN = 0.24, VOUT = 0.00
VIN = 0.23, VOUT = 0.00
VIN = 0.22, VOUT = 0.00
VIN = 0.21, VOUT = 0.00
VIN = 0.20, VOUT = 0.00
VIN = 0.19, VOUT = 0.00
VIN = 0.18, VOUT = 0.00
VIN = 0.17, VOUT = 0.00
VIN = 0.16, VOUT = 0.00
VIN = 0.15, VOUT = 0.00
VIN = 0.14, VOUT = 0.00
VIN = 0.13, VOUT = 0.00
VIN = 0.12, VOUT = 0.00
VIN = 0.11, VOUT = 0.00
VIN = 0.10, VOUT = 0.00
VIN = 0.09, VOUT = 0.00
VIN = 0.08, VOUT = 0.00
VIN = 0.07, VOUT = 0.00
VIN = 0.06, VOUT = 0.00
VIN = 0.05, VOUT = 0.00
VIN = 0.04, VOUT = 0.00
VIN = 0.03, VOUT = 0.00
VIN = 0.02, VOUT = 0.00
VIN = 0.01, VOUT = 0.00
VIN = -0.00, VOUT = 0.00
VIN = -0.01, VOUT = 0.00
VIN = -0.02, VOUT = 0.00
VIN = -0.03, VOUT = 0.00
VIN = -0.04, VOUT = 0.00
VIN = -0.05, VOUT = 0.00
VIN = -0.06, VOUT = 0.00
VIN = -0.07, VOUT = 0.00
VIN = -0.08, VOUT = 0.00
VIN = -0.09, VOUT = 0.00
VIN = -0.10, VOUT = 0.00
VIN = -0.11, VOUT = 0.00
VIN = -0.12, VOUT = 0.00
VIN = -0.13, VOUT = 0.00
VIN = -0.14, VOUT = 0.00
VIN = -0.15, VOUT = 0.00
VIN = -0.16, VOUT = 0.00
VIN = -0.17, VOUT = 0.00
VIN = -0.18, VOUT = 0.00
VIN = -0.19, VOUT = 0.00
VIN = -0.20, VOUT = 0.00
VIN = -0.21, VOUT = 0.00
VIN = -0.22, VOUT = 0.00
VIN = -0.23, VOUT = 0.00
VIN = -0.24, VOUT = 0.00
VIN = -0.25, VOUT = 0.00
VIN = -0.26, VOUT = 0.00
VIN = -0.27, VOUT = 0.00
VIN = -0.28, VOUT = 0.00
VIN = -0.29, VOUT = 0.00
VIN = -0.30, VOUT = 0.00
VIN = -0.31, VOUT = 0.00
VIN = -0.32, VOUT = 0.00
VIN = -0.33, VOUT = 0.00
VIN = -0.34, VOUT = 0.00
VIN = -0.35, VOUT = 0.00
VIN = -0.36, VOUT = 0.00
VIN = -0.37, VOUT = 0.00
VIN = -0.38, VOUT = 0.00
VIN = -0.39, VOUT = 0.00
VIN = -0.40, VOUT = 0.00
VIN = -0.41, VOUT = 0.00
VIN = -0.42, VOUT = 0.00
VIN = -0.43, VOUT = 0.00
VIN = -0.44, VOUT = 0.00
VIN = -0.45, VOUT = 0.00
VIN = -0.46, VOUT = 0.00
VIN = -0.47, VOUT = 0.00
VIN = -0.48, VOUT = 0.00
VIN = -0.49, VOUT = 0.00
VIN = -0.50, VOUT = 0.00
VIN = -0.51, VOUT = 0.00
VIN = -0.52, VOUT = 0.00
VIN = -0.53, VOUT = 0.00
VIN = -0.54, VOUT = 0.00
VIN = -0.55, VOUT = 0.00
VIN = -0.56, VOUT = 0.00
VIN = -0.57, VOUT = 0.00
VIN = -0.58, VOUT = 0.00
VIN = -0.59, VOUT = 0.00
VIN = -0.60, VOUT = 0.00
VIN = -0.61, VOUT = 0.00
VIN = -0.62, VOUT = 0.00
VIN = -0.63, VOUT = 0.00
VIN = -0.64, VOUT = 0.00
VIN = -0.65, VOUT = 0.00
VIN = -0.66, VOUT = 0.00
VIN = -0.67, VOUT = 0.00
VIN = -0.68, VOUT = 0.00
VIN = -0.69, VOUT = 0.00
VIN = -0.70, VOUT = 0.00
VIN = -0.71, VOUT = 0.00
VIN = -0.72, VOUT = 0.00
VIN = -0.73, VOUT = 0.00
VIN = -0.74, VOUT = 0.00
VIN = -0.75, VOUT = 0.00
VIN = -0.76, VOUT = 0.00
VIN = -0.77, VOUT = 0.00
VIN = -0.78, VOUT = 0.00
VIN = -0.79, VOUT = 0.00
VIN = -0.80, VOUT = 0.00
VIN = -0.81, VOUT = 0.00
VIN = -0.82, VOUT = 0.00
VIN = -0.83, VOUT = 0.00
VIN = -0.84, VOUT = 0.00
VIN = -0.85, VOUT = 0.00
VIN = -0.86, VOUT = 0.00
VIN = -0.87, VOUT = 0.00
VIN = -0.88, VOUT = 0.00
VIN = -0.89, VOUT = 0.00
VIN = -0.90, VOUT = 0.00
VIN = -0.91, VOUT = 0.00
VIN = -0.92, VOUT = 0.00
VIN = -0.93, VOUT = 0.00
VIN = -0.94, VOUT = 0.00
VIN = -0.95, VOUT = 0.00
VIN = -0.96, VOUT = 0.00
VIN = -0.97, VOUT = 0.00
VIN = -0.98, VOUT = 0.00
VIN = -0.99, VOUT = 0.00
VIN = -1.00, VOUT = 0.00
Barrido fuera de rango:
VIN = -1.99, VOUT = 0.00
VIN = -1.98, VOUT = 0.00
VIN = -1.97, VOUT = 0.00
VIN = -1.96, VOUT = 0.00
VIN = -1.95, VOUT = 0.00
VIN = -1.94, VOUT = 0.00
VIN = -1.93, VOUT = 0.00
VIN = -1.92, VOUT = 0.00
VIN = -1.91, VOUT = 0.00
VIN = -1.90, VOUT = 0.00
VIN = -1.89, VOUT = 0.00
VIN = -1.88, VOUT = 0.00
VIN = -1.87, VOUT = 0.00
VIN = -1.86, VOUT = 0.00
VIN = -1.85, VOUT = 0.00
VIN = -1.84, VOUT = 0.00
VIN = -1.83, VOUT = 0.00
VIN = -1.82, VOUT = 0.00
VIN = -1.81, VOUT = 0.00
VIN = -1.80, VOUT = 0.00
VIN = -1.79, VOUT = 0.00
VIN = -1.78, VOUT = 0.00
VIN = -1.77, VOUT = 0.00
VIN = -1.76, VOUT = 0.00
VIN = -1.75, VOUT = 0.00
VIN = -1.74, VOUT = 0.00
VIN = -1.73, VOUT = 0.00
VIN = -1.72, VOUT = 0.00
VIN = -1.71, VOUT = 0.00
VIN = -1.70, VOUT = 0.00
VIN = -1.69, VOUT = 0.00
VIN = -1.68, VOUT = 0.00
VIN = -1.67, VOUT = 0.00
VIN = -1.66, VOUT = 0.00
VIN = -1.65, VOUT = 0.00
VIN = -1.64, VOUT = 0.00
VIN = -1.63, VOUT = 0.00
VIN = -1.62, VOUT = 0.00
VIN = -1.61, VOUT = 0.00
VIN = -1.60, VOUT = 0.00
VIN = -1.59, VOUT = 0.00
VIN = -1.58, VOUT = 0.00
VIN = -1.57, VOUT = 0.00
VIN = -1.56, VOUT = 0.00
VIN = -1.55, VOUT = 0.00
VIN = -1.54, VOUT = 0.00
VIN = -1.53, VOUT = 0.00
VIN = -1.52, VOUT = 0.00
VIN = -1.51, VOUT = 0.00
VIN = -1.50, VOUT = 0.00
VIN = -1.49, VOUT = 0.00
VIN = -1.48, VOUT = 0.00
VIN = -1.47, VOUT = 0.00
VIN = -1.46, VOUT = 0.00
VIN = -1.45, VOUT = 0.00
VIN = -1.44, VOUT = 0.00
VIN = -1.43, VOUT = 0.00
VIN = -1.42, VOUT = 0.00
VIN = -1.41, VOUT = 0.00
VIN = -1.40, VOUT = 0.00
VIN = -1.39, VOUT = 0.00
VIN = -1.38, VOUT = 0.00
VIN = -1.37, VOUT = 0.00
VIN = -1.36, VOUT = 0.00
VIN = -1.35, VOUT = 0.00
VIN = -1.34, VOUT = 0.00
VIN = -1.33, VOUT = 0.00
VIN = -1.32, VOUT = 0.00
VIN = -1.31, VOUT = 0.00
VIN = -1.30, VOUT = 0.00
VIN = -1.29, VOUT = 0.00
VIN = -1.28, VOUT = 0.00
VIN = -1.27, VOUT = 0.00
VIN = -1.26, VOUT = 0.00
VIN = -1.25, VOUT = 0.00
VIN = -1.24, VOUT = 0.00
VIN = -1.23, VOUT = 0.00
VIN = -1.22, VOUT = 0.00
VIN = -1.21, VOUT = 0.00
VIN = -1.20, VOUT = 0.00
VIN = -1.19, VOUT = 0.00
VIN = -1.18, VOUT = 0.00
VIN = -1.17, VOUT = 0.00
VIN = -1.16, VOUT = 0.00
VIN = -1.15, VOUT = 0.00
VIN = -1.14, VOUT = 0.00
VIN = -1.13, VOUT = 0.00
VIN = -1.12, VOUT = 0.00
VIN = -1.11, VOUT = 0.00
VIN = -1.10, VOUT = 0.00
VIN = -1.09, VOUT = 0.00
VIN = -1.08, VOUT = 0.00
VIN = -1.07, VOUT = 0.00
VIN = -1.06, VOUT = 0.00
VIN = -1.05, VOUT = 0.00
VIN = -1.04, VOUT = 0.00
VIN = -1.03, VOUT = 0.00
VIN = -1.02, VOUT = 0.00
VIN = -1.01, VOUT = 0.00
VIN = -1.00, VOUT = 0.00
VIN = -0.99, VOUT = 0.00
VIN = -0.98, VOUT = 0.00
VIN = -0.97, VOUT = 0.00
VIN = -0.96, VOUT = 0.00
VIN = -0.95, VOUT = 0.00
VIN = -0.94, VOUT = 0.00
VIN = -0.93, VOUT = 0.00
VIN = -0.92, VOUT = 0.00
VIN = -0.91, VOUT = 0.00
VIN = -0.90, VOUT = 0.00
VIN = -0.89, VOUT = 0.00
VIN = -0.88, VOUT = 0.00
VIN = -0.87, VOUT = 0.00
VIN = -0.86, VOUT = 0.00
VIN = -0.85, VOUT = 0.00
VIN = -0.84, VOUT = 0.00
VIN = -0.83, VOUT = 0.00
VIN = -0.82, VOUT = 0.00
VIN = -0.81, VOUT = 0.00
VIN = -0.80, VOUT = 0.00
VIN = -0.79, VOUT = 0.00
VIN = -0.78, VOUT = 0.00
VIN = -0.77, VOUT = 0.00
VIN = -0.76, VOUT = 0.00
VIN = -0.75, VOUT = 0.00
VIN = -0.74, VOUT = 0.00
VIN = -0.73, VOUT = 0.00
VIN = -0.72, VOUT = 0.00
VIN = -0.71, VOUT = 0.00
VIN = -0.70, VOUT = 0.00
VIN = -0.69, VOUT = 0.00
VIN = -0.68, VOUT = 0.00
VIN = -0.67, VOUT = 0.00
VIN = -0.66, VOUT = 0.00
VIN = -0.65, VOUT = 0.00
VIN = -0.64, VOUT = 0.00
VIN = -0.63, VOUT = 0.00
VIN = -0.62, VOUT = 0.00
VIN = -0.61, VOUT = 0.00
VIN = -0.60, VOUT = 0.00
VIN = -0.59, VOUT = 0.00
VIN = -0.58, VOUT = 0.00
VIN = -0.57, VOUT = 0.00
VIN = -0.56, VOUT = 0.00
VIN = -0.55, VOUT = 0.00
VIN = -0.54, VOUT = 0.00
VIN = -0.53, VOUT = 0.00
VIN = -0.52, VOUT = 0.00
VIN = -0.51, VOUT = 0.00
VIN = -0.50, VOUT = 0.00
VIN = -0.49, VOUT = 0.00
VIN = -0.48, VOUT = 0.00
VIN = -0.47, VOUT = 0.00
VIN = -0.46, VOUT = 0.00
VIN = -0.45, VOUT = 0.00
VIN = -0.44, VOUT = 0.00
VIN = -0.43, VOUT = 0.00
VIN = -0.42, VOUT = 0.00
VIN = -0.41, VOUT = 0.00
VIN = -0.40, VOUT = 0.00
VIN = -0.39, VOUT = 0.00
VIN = -0.38, VOUT = 0.00
VIN = -0.37, VOUT = 0.00
VIN = -0.36, VOUT = 0.00
VIN = -0.35, VOUT = 0.00
VIN = -0.34, VOUT = 0.00
VIN = -0.33, VOUT = 0.00
VIN = -0.32, VOUT = 0.00
VIN = -0.31, VOUT = 0.00
VIN = -0.30, VOUT = 0.00
VIN = -0.29, VOUT = 0.00
VIN = -0.28, VOUT = 0.00
VIN = -0.27, VOUT = 0.00
VIN = -0.26, VOUT = 0.00
VIN = -0.25, VOUT = 0.00
VIN = -0.24, VOUT = 0.00
VIN = -0.23, VOUT = 0.00
VIN = -0.22, VOUT = 0.00
VIN = -0.21, VOUT = 0.00
VIN = -0.20, VOUT = 0.00
VIN = -0.19, VOUT = 0.00
VIN = -0.18, VOUT = 0.00
VIN = -0.17, VOUT = 0.00
VIN = -0.16, VOUT = 0.00
VIN = -0.15, VOUT = 0.00
VIN = -0.14, VOUT = 0.00
VIN = -0.13, VOUT = 0.00
VIN = -0.12, VOUT = 0.00
VIN = -0.11, VOUT = 0.00
VIN = -0.10, VOUT = 0.00
VIN = -0.09, VOUT = 0.00
VIN = -0.08, VOUT = 0.00
VIN = -0.07, VOUT = 0.00
VIN = -0.06, VOUT = 0.00
VIN = -0.05, VOUT = 0.00
VIN = -0.04, VOUT = 0.00
VIN = -0.03, VOUT = 0.00
VIN = -0.02, VOUT = 0.00
VIN = -0.01, VOUT = 0.00
VIN = 0.00, VOUT = 0.00
VIN = 0.01, VOUT = 0.00
VIN = 0.02, VOUT = 0.00
VIN = 0.03, VOUT = 0.00
VIN = 0.04, VOUT = 0.00
VIN = 0.05, VOUT = 0.00
VIN = 0.06, VOUT = 0.00
VIN = 0.07, VOUT = 0.00
VIN = 0.08, VOUT = 0.00
VIN = 0.09, VOUT = 0.00
VIN = 0.10, VOUT = 0.00
VIN = 0.11, VOUT = 0.00
VIN = 0.12, VOUT = 0.00
VIN = 0.13, VOUT = 0.00
VIN = 0.14, VOUT = 0.00
VIN = 0.15, VOUT = 0.00
VIN = 0.16, VOUT = 0.00
VIN = 0.17, VOUT = 0.00
VIN = 0.18, VOUT = 0.00
VIN = 0.19, VOUT = 0.00
VIN = 0.20, VOUT = 0.00
VIN = 0.21, VOUT = 0.00
VIN = 0.22, VOUT = 0.00
VIN = 0.23, VOUT = 0.00
VIN = 0.24, VOUT = 0.00
VIN = 0.25, VOUT = 0.00
VIN = 0.26, VOUT = 0.00
VIN = 0.27, VOUT = 0.00
VIN = 0.28, VOUT = 0.00
VIN = 0.29, VOUT = 0.00
VIN = 0.30, VOUT = 0.00
VIN = 0.31, VOUT = 0.00
VIN = 0.32, VOUT = 0.00
VIN = 0.33, VOUT = 0.00
VIN = 0.34, VOUT = 0.00
VIN = 0.35, VOUT = 0.00
VIN = 0.36, VOUT = 0.00
VIN = 0.37, VOUT = 0.00
VIN = 0.38, VOUT = 0.00
VIN = 0.39, VOUT = 0.00
VIN = 0.40, VOUT = 0.00
VIN = 0.41, VOUT = 0.00
VIN = 0.42, VOUT = 0.00
VIN = 0.43, VOUT = 0.00
VIN = 0.44, VOUT = 0.00
VIN = 0.45, VOUT = 0.00
VIN = 0.46, VOUT = 0.00
VIN = 0.47, VOUT = 0.00
VIN = 0.48, VOUT = 0.00
VIN = 0.49, VOUT = 0.00
VIN = 0.50, VOUT = 0.00
VIN = 0.51, VOUT = 1.80
VIN = 0.52, VOUT = 1.80
VIN = 0.53, VOUT = 1.80
VIN = 0.54, VOUT = 1.80
VIN = 0.55, VOUT = 1.80
VIN = 0.56, VOUT = 1.80
VIN = 0.57, VOUT = 1.80
VIN = 0.58, VOUT = 1.80
VIN = 0.59, VOUT = 1.80
VIN = 0.60, VOUT = 1.80
VIN = 0.61, VOUT = 1.80
VIN = 0.62, VOUT = 1.80
VIN = 0.63, VOUT = 1.80
VIN = 0.64, VOUT = 1.80
VIN = 0.65, VOUT = 1.80
VIN = 0.66, VOUT = 1.80
VIN = 0.67, VOUT = 1.80
VIN = 0.68, VOUT = 1.80
VIN = 0.69, VOUT = 1.80
VIN = 0.70, VOUT = 1.80
VIN = 0.71, VOUT = 1.80
VIN = 0.72, VOUT = 1.80
VIN = 0.73, VOUT = 1.80
VIN = 0.74, VOUT = 1.80
VIN = 0.75, VOUT = 1.80
VIN = 0.76, VOUT = 1.80
VIN = 0.77, VOUT = 1.80
VIN = 0.78, VOUT = 1.80
VIN = 0.79, VOUT = 1.80
VIN = 0.80, VOUT = 1.80
VIN = 0.81, VOUT = 1.80
VIN = 0.82, VOUT = 1.80
VIN = 0.83, VOUT = 1.80
VIN = 0.84, VOUT = 1.80
VIN = 0.85, VOUT = 1.80
VIN = 0.86, VOUT = 1.80
VIN = 0.87, VOUT = 1.80
VIN = 0.88, VOUT = 1.80
VIN = 0.89, VOUT = 1.80
VIN = 0.90, VOUT = 1.80
VIN = 0.91, VOUT = 1.80
VIN = 0.92, VOUT = 1.80
VIN = 0.93, VOUT = 1.80
VIN = 0.94, VOUT = 1.80
VIN = 0.95, VOUT = 1.80
VIN = 0.96, VOUT = 1.80
VIN = 0.97, VOUT = 1.80
VIN = 0.98, VOUT = 1.80
VIN = 0.99, VOUT = 1.80
VIN = 1.00, VOUT = 1.80
VIN = 1.01, VOUT = 1.80
VIN = 1.02, VOUT = 1.80
VIN = 1.03, VOUT = 1.80
VIN = 1.04, VOUT = 1.80
VIN = 1.05, VOUT = 1.80
VIN = 1.06, VOUT = 1.80
VIN = 1.07, VOUT = 1.80
VIN = 1.08, VOUT = 1.80
VIN = 1.09, VOUT = 1.80
VIN = 1.10, VOUT = 1.80
VIN = 1.11, VOUT = 1.80
VIN = 1.12, VOUT = 1.80
VIN = 1.13, VOUT = 1.80
VIN = 1.14, VOUT = 1.80
VIN = 1.15, VOUT = 1.80
VIN = 1.16, VOUT = 1.80
VIN = 1.17, VOUT = 1.80
VIN = 1.18, VOUT = 1.80
VIN = 1.19, VOUT = 1.80
VIN = 1.20, VOUT = 1.80
VIN = 1.21, VOUT = 1.80
VIN = 1.22, VOUT = 1.80
VIN = 1.23, VOUT = 1.80
VIN = 1.24, VOUT = 1.80
VIN = 1.25, VOUT = 1.80
VIN = 1.26, VOUT = 1.80
VIN = 1.27, VOUT = 1.80
VIN = 1.28, VOUT = 1.80
VIN = 1.29, VOUT = 1.80
VIN = 1.30, VOUT = 1.80
VIN = 1.31, VOUT = 1.80
VIN = 1.32, VOUT = 1.80
VIN = 1.33, VOUT = 1.80
VIN = 1.34, VOUT = 1.80
VIN = 1.35, VOUT = 1.80
VIN = 1.36, VOUT = 1.80
VIN = 1.37, VOUT = 1.80
VIN = 1.38, VOUT = 1.80
VIN = 1.39, VOUT = 1.80
VIN = 1.40, VOUT = 1.80
VIN = 1.41, VOUT = 1.80
VIN = 1.42, VOUT = 1.80
VIN = 1.43, VOUT = 1.80
VIN = 1.44, VOUT = 1.80
VIN = 1.45, VOUT = 1.80
VIN = 1.46, VOUT = 1.80
VIN = 1.47, VOUT = 1.80
VIN = 1.48, VOUT = 1.80
VIN = 1.49, VOUT = 1.80
VIN = 1.50, VOUT = 1.80
VIN = 1.51, VOUT = 1.80
VIN = 1.52, VOUT = 1.80
VIN = 1.53, VOUT = 1.80
VIN = 1.54, VOUT = 1.80
VIN = 1.55, VOUT = 1.80
VIN = 1.56, VOUT = 1.80
VIN = 1.57, VOUT = 1.80
VIN = 1.58, VOUT = 1.80
VIN = 1.59, VOUT = 1.80
VIN = 1.60, VOUT = 1.80
VIN = 1.61, VOUT = 1.80
VIN = 1.62, VOUT = 1.80
VIN = 1.63, VOUT = 1.80
VIN = 1.64, VOUT = 1.80
VIN = 1.65, VOUT = 1.80
VIN = 1.66, VOUT = 1.80
VIN = 1.67, VOUT = 1.80
VIN = 1.68, VOUT = 1.80
VIN = 1.69, VOUT = 1.80
VIN = 1.70, VOUT = 1.80
VIN = 1.71, VOUT = 1.80
VIN = 1.72, VOUT = 1.80
VIN = 1.73, VOUT = 1.80
VIN = 1.74, VOUT = 1.80
VIN = 1.75, VOUT = 1.80
VIN = 1.76, VOUT = 1.80
VIN = 1.77, VOUT = 1.80
VIN = 1.78, VOUT = 1.80
VIN = 1.79, VOUT = 1.80
VIN = 1.80, VOUT = 1.80
VIN = 1.81, VOUT = 1.80
VIN = 1.82, VOUT = 1.80
VIN = 1.83, VOUT = 1.80
VIN = 1.84, VOUT = 1.80
VIN = 1.85, VOUT = 1.80
VIN = 1.86, VOUT = 1.80
VIN = 1.87, VOUT = 1.80
VIN = 1.88, VOUT = 1.80
VIN = 1.89, VOUT = 1.80
VIN = 1.90, VOUT = 1.80
VIN = 1.91, VOUT = 1.80
VIN = 1.92, VOUT = 1.80
VIN = 1.93, VOUT = 1.80
VIN = 1.94, VOUT = 1.80
VIN = 1.95, VOUT = 1.80
VIN = 1.96, VOUT = 1.80
VIN = 1.97, VOUT = 1.80
VIN = 1.98, VOUT = 1.80
VIN = 1.99, VOUT = 1.80
VIN = 2.00, VOUT = 1.80
Simulation complete via $finish(1) at time 8 NS + 0
./tb/level_shifter_tb.sv:67         $finish;
xcelium> ^C
xcelium> exit
TOOL:	xrun(64)	24.03-s004: Exiting on Jun 18, 2025 at 18:45:21 CEST  (total: 00:02:54)
