xrun(64): 24.03-s004: (c) Copyright 1995-2024 Cadence Design Systems, Inc.
TOOL:	xrun(64)	24.03-s004: Started on Jan 07, 2026 at 10:23:35 CET
xrun
	-f xrun.f
		-clean
		./models/rsync_latch_mismatch.sv
		./tb/rsync_latch_mismatch_tb.sv
		-access +rw
		-gui
		-s
		-input /home/msegper/Documents/TFM/rsync_latch/restore.tcl
xrun: *N,CLEAN: Removing existing directory ./xcelium.d.
file: ./models/rsync_latch_mismatch.sv
	module worklib.rsync_latch:sv
		errors: 0, warnings: 0
file: ./tb/rsync_latch_mismatch_tb.sv
	module worklib.rsync_latch_tb:sv
		errors: 0, warnings: 0
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
	Top level design units:
		cds_rnm_pkg
		$unit_0x1ad891ce
		rsync_latch_tb
	Building instance overlay tables: ....................
        $display("Raw binary mismatch[%0d] = %0d", k, temp);
                                                         |
xmelab: *W,REALCV (./models/rsync_latch_mismatch.sv,124|57): Real argument converted to integer for (%d).
 Done
	Using implicit TMP libraries; associated with library worklib
	Generating native compiled code:
		worklib.rsync_latch:sv <0x5c7b8ead>
			streams: 129, words: 98340
		worklib.rsync_latch_tb:sv <0x06aab04e>
			streams:  90, words: 72439
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                 Instances  Unique
		Modules:                 2       2
		Verilog packages:        1       1
		Registers:              90      90
		Scalar wires:           54       -
		Vectored wires:          9       -
		Always blocks:          28      28
		Initial blocks:          7       7
		Parallel blocks:         1       1
		Pseudo assignments:     63       -
		Assertions:              3       3
		Compilation units:       1       1
		Simulation timescale:  1ps
	Writing initial simulation snapshot: worklib.rsync_latch_tb:sv
xmsim: *W,NOMTDGUI: Multi-Threaded Dumping is disabled for interactive debug mode.
SVSEED default: 1
[DMSINFO] Simulating with Xcelium Mixed-Signal App...

-------------------------------------
Relinquished control to SimVision...
xcelium> 
xcelium> source /eda/cadence/2024-25/RHELx86/XCELIUM_24.03.004/tools/xcelium/files/xmsimrc
xcelium> 
xcelium> # XM-Sim Command File
xcelium> # TOOL:	xmsim(64)	24.03-s004
xcelium> #
xcelium> #
xcelium> # You can restore this configuration with:
xcelium> #
xcelium> #      xrun -f xrun.f -input restore.tcl
xcelium> #
xcelium> 
xcelium> set tcl_prompt1 {puts -nonewline "xcelium> "}
puts -nonewline "xcelium> "
xcelium> set tcl_prompt2 {puts -nonewline "> "}
puts -nonewline "> "
xcelium> set vlog_format %h
%h
xcelium> set vhdl_format %v
%v
xcelium> set real_precision 6
6
xcelium> set display_unit auto
auto
xcelium> set time_unit module
module
xcelium> set heap_garbage_size -200
-200
xcelium> set heap_garbage_time 0
0
xcelium> set assert_report_level note
note
xcelium> set assert_stop_level error
error
xcelium> set autoscope yes
yes
xcelium> set assert_1164_warnings yes
yes
xcelium> set pack_assert_off {}
xcelium> set severity_pack_assert_off {note warning}
note warning
xcelium> set assert_output_stop_level failed
failed
xcelium> set tcl_debug_level 0
0
xcelium> set relax_path_name 1
1
xcelium> set vhdl_vcdmap XX01ZX01X
XX01ZX01X
xcelium> set intovf_severity_level ERROR
ERROR
xcelium> set probe_screen_format 0
0
xcelium> set rangecnst_severity_level ERROR
ERROR
xcelium> set textio_severity_level ERROR
ERROR
xcelium> set vital_timing_checks_on 1
1
xcelium> set vlog_code_show_force 0
0
xcelium> set assert_count_attempts 1
1
xcelium> set tcl_all64 false
false
xcelium> set tcl_runerror_exit false
false
xcelium> set assert_report_incompletes 0
0
xcelium> set show_force 1
1
xcelium> set force_reset_by_reinvoke 0
0
xcelium> set tcl_relaxed_literal 0
0
xcelium> set probe_exclude_patterns {}
xcelium> set probe_packed_limit 4k
4k
xcelium> set probe_unpacked_limit 16k
16k
xcelium> set assert_internal_msg no
no
xcelium> set svseed 1
1
xcelium> set assert_reporting_mode 0
0
xcelium> set vcd_compact_mode 0
0
xcelium> set vhdl_forgen_loopindex_enum_pos 0
0
xcelium> set xmreplay_dc_debug 0
0
xcelium> set tcl_runcmd_interrupt next_command
next_command
xcelium> set tcl_sigval_prefix {#}
#
xcelium> alias . run
xcelium> alias indago verisium
xcelium> alias quit exit
xcelium> database -open -shm -into waves.shm waves -default
Created default SHM database waves
xcelium> probe -create -database waves rsync_latch_tb.dut.vssana rsync_latch_tb.dut.vddana_0p8 rsync_latch_tb.dut.pdb rsync_latch_tb.dut.iref_25ua rsync_latch_tb.dut.dataoutthermb rsync_latch_tb.dut.dataouttherm rsync_latch_tb.dut.dataoutbinb rsync_latch_tb.dut.dataoutbin rsync_latch_tb.dut.datainthermb rsync_latch_tb.dut.dataintherm rsync_latch_tb.dut.datainbinb rsync_latch_tb.dut.datainbin rsync_latch_tb.dut.clkinb_therm_16 rsync_latch_tb.dut.clkinb_therm_15 rsync_latch_tb.dut.clkinb_therm_14 rsync_latch_tb.dut.clkinb_therm_13 rsync_latch_tb.dut.clkinb_therm_12 rsync_latch_tb.dut.clkinb_therm_11 rsync_latch_tb.dut.clkinb_therm_10 rsync_latch_tb.dut.clkinb_therm_9 rsync_latch_tb.dut.clkinb_therm_8 rsync_latch_tb.dut.clkinb_therm_7 rsync_latch_tb.dut.clkinb_therm_6 rsync_latch_tb.dut.clkinb_therm_5 rsync_latch_tb.dut.clkinb_therm_4 rsync_latch_tb.dut.clkinb_therm_3 rsync_latch_tb.dut.clkinb_therm_2 rsync_latch_tb.dut.clkinb_therm_1 rsync_latch_tb.dut.clkinb_therm_0 rsync_latch_tb.dut.clkinb_binary_5 rsync_latch_tb.dut.clkinb_binary_4 rsync_latch_tb.dut.clkinb_binary_3 rsync_latch_tb.dut.clkinb_binary_2 rsync_latch_tb.dut.clkinb_binary_1 rsync_latch_tb.dut.clkinb_binary_0_red rsync_latch_tb.dut.clkinb_binary_0 rsync_latch_tb.dut.clkin_therm_16 rsync_latch_tb.dut.clkin_therm_15 rsync_latch_tb.dut.clkin_therm_14 rsync_latch_tb.dut.clkin_therm_13 rsync_latch_tb.dut.clkin_therm_12 rsync_latch_tb.dut.clkin_therm_11 rsync_latch_tb.dut.clkin_therm_10 rsync_latch_tb.dut.clkin_therm_9 rsync_latch_tb.dut.clkin_therm_8 rsync_latch_tb.dut.clkin_therm_7 rsync_latch_tb.dut.clkin_therm_6 rsync_latch_tb.dut.clkin_therm_5 rsync_latch_tb.dut.clkin_therm_4 rsync_latch_tb.dut.clkin_therm_3 rsync_latch_tb.dut.clkin_therm_2 rsync_latch_tb.dut.clkin_therm_1 rsync_latch_tb.dut.clkin_therm_0 rsync_latch_tb.dut.clkin_binary_5 rsync_latch_tb.dut.clkin_binary_4 rsync_latch_tb.dut.clkin_binary_3 rsync_latch_tb.dut.clkin_binary_2 rsync_latch_tb.dut.clkin_binary_1 rsync_latch_tb.dut.clkin_binary_0_red rsync_latch_tb.dut.clkin_binary_0 rsync_latch_tb.dut.atb_ena rsync_latch_tb.dut.atb1 rsync_latch_tb.dut.atb0
Created probe 1
xcelium> 
xcelium> simvision -input restore.tcl.svcf
xcelium> run
Raw binary mismatch[0] =        2556
Binary mismatch[0]= 0.0056
Raw binary mismatch[1] =         969
Binary mismatch[1]= -0.0103
Raw binary mismatch[2] =        2383
Binary mismatch[2]= 0.0038
Raw binary mismatch[3] =        3209
Binary mismatch[3]= 0.0121
Raw binary mismatch[4] =        3507
Binary mismatch[4]= 0.0151
Raw binary mismatch[5] =        3294
Binary mismatch[5]= 0.0129
Raw binary mismatch[6] =        2788
Binary mismatch[6]= 0.0079
Raw binary mismatch[0] =        2485
Binary mismatch[0]= 0.0049
Raw binary mismatch[1] =        1979
Binary mismatch[1]= -0.0002
Raw binary mismatch[2] =        2629
Binary mismatch[2]= 0.0063
Raw binary mismatch[3] =        2167
Binary mismatch[3]= 0.0017
Raw binary mismatch[4] =        2616
Binary mismatch[4]= 0.0062
Raw binary mismatch[5] =         843
Binary mismatch[5]= -0.0116
Raw binary mismatch[6] =         732
Binary mismatch[6]= -0.0127
Raw binary mismatch[0] =        3560
Binary mismatch[0]= 0.0156
Raw binary mismatch[1] =         360
Binary mismatch[1]= -0.0164
Raw binary mismatch[2] =        1224
Binary mismatch[2]= -0.0078
Raw binary mismatch[3] =        1837
Binary mismatch[3]= -0.0016
Raw binary mismatch[4] =        1470
Binary mismatch[4]= -0.0053
Raw binary mismatch[5] =        1443
Binary mismatch[5]= -0.0056
Raw binary mismatch[6] =        2720
Binary mismatch[6]= 0.0072
Raw binary mismatch[7] =        2736
Binary mismatch[7]= 0.0074
Raw binary mismatch[8] =         496
Binary mismatch[8]= -0.0150
Raw binary mismatch[9] =          56
Binary mismatch[9]= -0.0194
Raw binary mismatch[10] =        1934
Binary mismatch[10]= -0.0007
Raw binary mismatch[11] =         486
Binary mismatch[11]= -0.0151
Raw binary mismatch[12] =        3519
Binary mismatch[12]= 0.0152
Raw binary mismatch[13] =        2045
Binary mismatch[13]= 0.0004
Raw binary mismatch[14] =        2267
Binary mismatch[14]= 0.0027
Raw binary mismatch[15] =         542
Binary mismatch[15]= -0.0146
Raw binary mismatch[16] =         952
Binary mismatch[16]= -0.0105
Raw binary mismatch[0] =        1144
Binary mismatch[0]= -0.0086
Raw binary mismatch[1] =         377
Binary mismatch[1]= -0.0162
Raw binary mismatch[2] =        1266
Binary mismatch[2]= -0.0073
Raw binary mismatch[3] =        1493
Binary mismatch[3]= -0.0051
Raw binary mismatch[4] =         153
Binary mismatch[4]= -0.0185
Raw binary mismatch[5] =         487
Binary mismatch[5]= -0.0151
Raw binary mismatch[6] =        3017
Binary mismatch[6]= 0.0102
Raw binary mismatch[7] =         826
Binary mismatch[7]= -0.0117
Raw binary mismatch[8] =        3196
Binary mismatch[8]= 0.0120
Raw binary mismatch[9] =        1138
Binary mismatch[9]= -0.0086
Raw binary mismatch[10] =        3764
Binary mismatch[10]= 0.0176
Raw binary mismatch[11] =         762
Binary mismatch[11]= -0.0124
Raw binary mismatch[12] =        3305
Binary mismatch[12]= 0.0131
Raw binary mismatch[13] =        3601
Binary mismatch[13]= 0.0160
Raw binary mismatch[14] =        1107
Binary mismatch[14]= -0.0089
Raw binary mismatch[15] =        1458
Binary mismatch[15]= -0.0054
Raw binary mismatch[16] =        2294
Binary mismatch[16]= 0.0029
Test 1: Verificar estado de apagado (Power-Down)
Test 2: Verificar funcionamiento normal
Test 3: Verificar comportamiento de atb_ena
Test 3.1: atb_ena = 2'b00 -> atb0 = 0.00, atb1 = 0.00
Test 3.2: atb_ena = 2'b01 -> atb0 = 0.00, atb1 = 1.00
Test 3.3: atb_ena = 2'b10 -> atb0 = 0.00, atb1 = 1.00
Test 3.4: atb_ena = 2'b11 -> atb0 = 0.00, atb1 = 0.00
Simulación completada.
Simulation complete via $finish(1) at time 70 NS + 0
./tb/rsync_latch_mismatch_tb.sv:223         $finish;
xcelium> reset
SVSEED default: 1
Loaded snapshot worklib.rsync_latch_tb:sv
xcelium> run
Raw binary mismatch[0] =        2556
Binary mismatch[0]= 0.0056
Raw binary mismatch[1] =         969
Binary mismatch[1]= -0.0103
Raw binary mismatch[2] =        2383
Binary mismatch[2]= 0.0038
Raw binary mismatch[3] =        3209
Binary mismatch[3]= 0.0121
Raw binary mismatch[4] =        3507
Binary mismatch[4]= 0.0151
Raw binary mismatch[5] =        3294
Binary mismatch[5]= 0.0129
Raw binary mismatch[6] =        2788
Binary mismatch[6]= 0.0079
Raw binary mismatch[0] =        2485
Binary mismatch[0]= 0.0049
Raw binary mismatch[1] =        1979
Binary mismatch[1]= -0.0002
Raw binary mismatch[2] =        2629
Binary mismatch[2]= 0.0063
Raw binary mismatch[3] =        2167
Binary mismatch[3]= 0.0017
Raw binary mismatch[4] =        2616
Binary mismatch[4]= 0.0062
Raw binary mismatch[5] =         843
Binary mismatch[5]= -0.0116
Raw binary mismatch[6] =         732
Binary mismatch[6]= -0.0127
Raw binary mismatch[0] =        3560
Binary mismatch[0]= 0.0156
Raw binary mismatch[1] =         360
Binary mismatch[1]= -0.0164
Raw binary mismatch[2] =        1224
Binary mismatch[2]= -0.0078
Raw binary mismatch[3] =        1837
Binary mismatch[3]= -0.0016
Raw binary mismatch[4] =        1470
Binary mismatch[4]= -0.0053
Raw binary mismatch[5] =        1443
Binary mismatch[5]= -0.0056
Raw binary mismatch[6] =        2720
Binary mismatch[6]= 0.0072
Raw binary mismatch[7] =        2736
Binary mismatch[7]= 0.0074
Raw binary mismatch[8] =         496
Binary mismatch[8]= -0.0150
Raw binary mismatch[9] =          56
Binary mismatch[9]= -0.0194
Raw binary mismatch[10] =        1934
Binary mismatch[10]= -0.0007
Raw binary mismatch[11] =         486
Binary mismatch[11]= -0.0151
Raw binary mismatch[12] =        3519
Binary mismatch[12]= 0.0152
Raw binary mismatch[13] =        2045
Binary mismatch[13]= 0.0004
Raw binary mismatch[14] =        2267
Binary mismatch[14]= 0.0027
Raw binary mismatch[15] =         542
Binary mismatch[15]= -0.0146
Raw binary mismatch[16] =         952
Binary mismatch[16]= -0.0105
Raw binary mismatch[0] =        1144
Binary mismatch[0]= -0.0086
Raw binary mismatch[1] =         377
Binary mismatch[1]= -0.0162
Raw binary mismatch[2] =        1266
Binary mismatch[2]= -0.0073
Raw binary mismatch[3] =        1493
Binary mismatch[3]= -0.0051
Raw binary mismatch[4] =         153
Binary mismatch[4]= -0.0185
Raw binary mismatch[5] =         487
Binary mismatch[5]= -0.0151
Raw binary mismatch[6] =        3017
Binary mismatch[6]= 0.0102
Raw binary mismatch[7] =         826
Binary mismatch[7]= -0.0117
Raw binary mismatch[8] =        3196
Binary mismatch[8]= 0.0120
Raw binary mismatch[9] =        1138
Binary mismatch[9]= -0.0086
Raw binary mismatch[10] =        3764
Binary mismatch[10]= 0.0176
Raw binary mismatch[11] =         762
Binary mismatch[11]= -0.0124
Raw binary mismatch[12] =        3305
Binary mismatch[12]= 0.0131
Raw binary mismatch[13] =        3601
Binary mismatch[13]= 0.0160
Raw binary mismatch[14] =        1107
Binary mismatch[14]= -0.0089
Raw binary mismatch[15] =        1458
Binary mismatch[15]= -0.0054
Raw binary mismatch[16] =        2294
Binary mismatch[16]= 0.0029
Test 1: Verificar estado de apagado (Power-Down)
Test 2: Verificar funcionamiento normal
Test 3: Verificar comportamiento de atb_ena
Test 3.1: atb_ena = 2'b00 -> atb0 = 0.00, atb1 = 0.00
Test 3.2: atb_ena = 2'b01 -> atb0 = 0.00, atb1 = 1.00
Test 3.3: atb_ena = 2'b10 -> atb0 = 0.00, atb1 = 1.00
Test 3.4: atb_ena = 2'b11 -> atb0 = 0.00, atb1 = 0.00
Simulación completada.
Simulation complete via $finish(1) at time 70 NS + 0
./tb/rsync_latch_mismatch_tb.sv:223         $finish;
xcelium> ^C
xcelium> exit
TOOL:	xrun(64)	24.03-s004: Exiting on Jan 07, 2026 at 10:34:53 CET  (total: 00:11:18)
