xrun(64): 24.03-s004: (c) Copyright 1995-2024 Cadence Design Systems, Inc.
TOOL:	xrun(64)	24.03-s004: Started on Jan 12, 2026 at 12:24:13 CET
xrun
	-f xrun.f
		-clean
		./models/rsync_latch_jitter.sv
		./tb/rsync_latch_tb.sv
		-access +rw
		-gui
		-s
		-input /home/msegper/Documents/TFM/rsync_latch/restore.tcl
xrun: *N,CLEAN: Removing existing directory ./xcelium.d.
file: ./models/rsync_latch_jitter.sv
        int mean = 0;         // Promedio de la distribuci칩n
                 |
xmvlog: *W,VARIST (./models/rsync_latch_jitter.sv,128|17): Local static variable with initializer requires 'static' keyword.
        int std_dev = 1;     // Desviaci칩n est치ndar, sigma
                    |
xmvlog: *W,VARIST (./models/rsync_latch_jitter.sv,129|20): Local static variable with initializer requires 'static' keyword.
	module worklib.rsync_latch:sv
		errors: 0, warnings: 2
file: ./tb/rsync_latch_tb.sv
	module worklib.rsync_latch_tb:sv
		errors: 0, warnings: 0
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
	Top level design units:
		cds_rnm_pkg
		$unit_0x5fecaa8a
		rsync_latch_tb
	Building instance overlay tables: ....................
        $display("jitter temporal = %0d seed = %0d media =%0d sigma = %0d", random_value, seed, mean, std_dev);
                                                                                       |
xmelab: *W,REALCV (./models/rsync_latch_jitter.sv,135|87): Real argument converted to integer for (%d).
 Done
	Using implicit TMP libraries; associated with library worklib
	Generating native compiled code:
		worklib.rsync_latch:sv <0x2a487089>
			streams: 136, words: 108628
		worklib.rsync_latch_tb:sv <0x1a0876aa>
			streams:  90, words: 70933
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                 Instances  Unique
		Modules:                 2       2
		Verilog packages:        1       1
		Registers:              93      93
		Scalar wires:           54       -
		Vectored wires:         13       -
		Always blocks:          30      30
		Initial blocks:          8       8
		Parallel blocks:         3       3
		Pseudo assignments:     63       -
		Assertions:              3       3
		Compilation units:       1       1
		Simulation timescale:  1ps
	Writing initial simulation snapshot: worklib.rsync_latch_tb:sv
xmsim: *W,NOMTDGUI: Multi-Threaded Dumping is disabled for interactive debug mode.
SVSEED default: 1
[DMSINFO] Simulating with Xcelium Mixed-Signal App...

-------------------------------------
Relinquished control to SimVision...
xcelium> 
xcelium> source /eda/cadence/2024-25/RHELx86/XCELIUM_24.03.004/tools/xcelium/files/xmsimrc
xcelium> 
xcelium> # XM-Sim Command File
xcelium> # TOOL:	xmsim(64)	24.03-s004
xcelium> #
xcelium> #
xcelium> # You can restore this configuration with:
xcelium> #
xcelium> #      xrun -f xrun.f -input restore.tcl
xcelium> #
xcelium> 
xcelium> set tcl_prompt1 {puts -nonewline "xcelium> "}
puts -nonewline "xcelium> "
xcelium> set tcl_prompt2 {puts -nonewline "> "}
puts -nonewline "> "
xcelium> set vlog_format %h
%h
xcelium> set vhdl_format %v
%v
xcelium> set real_precision 6
6
xcelium> set display_unit auto
auto
xcelium> set time_unit module
module
xcelium> set heap_garbage_size -200
-200
xcelium> set heap_garbage_time 0
0
xcelium> set assert_report_level note
note
xcelium> set assert_stop_level error
error
xcelium> set autoscope yes
yes
xcelium> set assert_1164_warnings yes
yes
xcelium> set pack_assert_off {}
xcelium> set severity_pack_assert_off {note warning}
note warning
xcelium> set assert_output_stop_level failed
failed
xcelium> set tcl_debug_level 0
0
xcelium> set relax_path_name 1
1
xcelium> set vhdl_vcdmap XX01ZX01X
XX01ZX01X
xcelium> set intovf_severity_level ERROR
ERROR
xcelium> set probe_screen_format 0
0
xcelium> set rangecnst_severity_level ERROR
ERROR
xcelium> set textio_severity_level ERROR
ERROR
xcelium> set vital_timing_checks_on 1
1
xcelium> set vlog_code_show_force 0
0
xcelium> set assert_count_attempts 1
1
xcelium> set tcl_all64 false
false
xcelium> set tcl_runerror_exit false
false
xcelium> set assert_report_incompletes 0
0
xcelium> set show_force 1
1
xcelium> set force_reset_by_reinvoke 0
0
xcelium> set tcl_relaxed_literal 0
0
xcelium> set probe_exclude_patterns {}
xcelium> set probe_packed_limit 4k
4k
xcelium> set probe_unpacked_limit 16k
16k
xcelium> set assert_internal_msg no
no
xcelium> set svseed 1
1
xcelium> set assert_reporting_mode 0
0
xcelium> set vcd_compact_mode 0
0
xcelium> set vhdl_forgen_loopindex_enum_pos 0
0
xcelium> set xmreplay_dc_debug 0
0
xcelium> set tcl_runcmd_interrupt next_command
next_command
xcelium> set tcl_sigval_prefix {#}
#
xcelium> alias . run
xcelium> alias indago verisium
xcelium> alias quit exit
xcelium> database -open -shm -into waves.shm waves -default
Created default SHM database waves
xcelium> probe -create -database waves rsync_latch_tb.dut.vssana rsync_latch_tb.dut.vddana_0p8 rsync_latch_tb.dut.pdb rsync_latch_tb.dut.iref_25ua rsync_latch_tb.dut.dataoutthermb rsync_latch_tb.dut.dataouttherm rsync_latch_tb.dut.dataoutbinb rsync_latch_tb.dut.dataoutbin rsync_latch_tb.dut.datainthermb rsync_latch_tb.dut.dataintherm rsync_latch_tb.dut.datainbinb rsync_latch_tb.dut.datainbin rsync_latch_tb.dut.clkinb_therm_16 rsync_latch_tb.dut.clkinb_therm_15 rsync_latch_tb.dut.clkinb_therm_14 rsync_latch_tb.dut.clkinb_therm_13 rsync_latch_tb.dut.clkinb_therm_12 rsync_latch_tb.dut.clkinb_therm_11 rsync_latch_tb.dut.clkinb_therm_10 rsync_latch_tb.dut.clkinb_therm_9 rsync_latch_tb.dut.clkinb_therm_8 rsync_latch_tb.dut.clkinb_therm_7 rsync_latch_tb.dut.clkinb_therm_6 rsync_latch_tb.dut.clkinb_therm_5 rsync_latch_tb.dut.clkinb_therm_4 rsync_latch_tb.dut.clkinb_therm_3 rsync_latch_tb.dut.clkinb_therm_2 rsync_latch_tb.dut.clkinb_therm_1 rsync_latch_tb.dut.clkinb_therm_0 rsync_latch_tb.dut.clkinb_binary_5 rsync_latch_tb.dut.clkinb_binary_4 rsync_latch_tb.dut.clkinb_binary_3 rsync_latch_tb.dut.clkinb_binary_2 rsync_latch_tb.dut.clkinb_binary_1 rsync_latch_tb.dut.clkinb_binary_0_red rsync_latch_tb.dut.clkinb_binary_0 rsync_latch_tb.dut.clkin_therm_16 rsync_latch_tb.dut.clkin_therm_15 rsync_latch_tb.dut.clkin_therm_14 rsync_latch_tb.dut.clkin_therm_13 rsync_latch_tb.dut.clkin_therm_12 rsync_latch_tb.dut.clkin_therm_11 rsync_latch_tb.dut.clkin_therm_10 rsync_latch_tb.dut.clkin_therm_9 rsync_latch_tb.dut.clkin_therm_8 rsync_latch_tb.dut.clkin_therm_7 rsync_latch_tb.dut.clkin_therm_6 rsync_latch_tb.dut.clkin_therm_5 rsync_latch_tb.dut.clkin_therm_4 rsync_latch_tb.dut.clkin_therm_3 rsync_latch_tb.dut.clkin_therm_2 rsync_latch_tb.dut.clkin_therm_1 rsync_latch_tb.dut.clkin_therm_0 rsync_latch_tb.dut.clkin_binary_5 rsync_latch_tb.dut.clkin_binary_4 rsync_latch_tb.dut.clkin_binary_3 rsync_latch_tb.dut.clkin_binary_2 rsync_latch_tb.dut.clkin_binary_1 rsync_latch_tb.dut.clkin_binary_0_red rsync_latch_tb.dut.clkin_binary_0 rsync_latch_tb.dut.atb_ena rsync_latch_tb.dut.atb1 rsync_latch_tb.dut.atb0
Created probe 1
xcelium> probe -create -database waves rsync_latch_tb.dut.dataoutbin_aux rsync_latch_tb.dut.dataoutbinb_aux rsync_latch_tb.dut.dataouttherm_aux rsync_latch_tb.dut.dataoutthermb_aux
Created probe 2
xcelium> 
xcelium> simvision -input restore.tcl.svcf
xcelium> run
Test 1: Verificar estado de apagado (Power-Down)
jitter temporal =           2 seed = -1808676067 media =0 sigma = 1
jitter temporal =           0 seed = 1074635142 media =0 sigma = 1
jitter temporal =           0 seed = -255198600 media =0 sigma = 1
jitter temporal =          -1 seed = -1418211933 media =0 sigma = 1
Test 2: Verificar funcionamiento normal
jitter temporal =           0 seed = -566389667 media =0 sigma = 1
jitter temporal =           0 seed = -357903175 media =0 sigma = 1
jitter temporal =           0 seed = -678123079 media =0 sigma = 1
jitter temporal =          -1 seed = 1493730122 media =0 sigma = 1
jitter temporal =          -1 seed = -1249168059 media =0 sigma = 1
jitter temporal =          -1 seed = 875096668 media =0 sigma = 1
jitter temporal =           1 seed = -1178521894 media =0 sigma = 1
jitter temporal =           2 seed = 2049298388 media =0 sigma = 1
Test 3: Verificar comportamiento de atb_ena
Test 3.1: atb_ena = 2'b00 -> atb0 = 0.00, atb1 = 0.00
Test 3.2: atb_ena = 2'b01 -> atb0 = 0.00, atb1 = 1.00
Test 3.3: atb_ena = 2'b10 -> atb0 = 0.00, atb1 = 1.00
Test 3.4: atb_ena = 2'b11 -> atb0 = 0.00, atb1 = 0.00
Simulaci칩n completada.
Simulation complete via $finish(1) at time 1400 PS + 0
./tb/rsync_latch_tb.sv:219         $finish;
xcelium> ^C
xcelium> exit
TOOL:	xrun(64)	24.03-s004: Exiting on Jan 12, 2026 at 12:26:10 CET  (total: 00:01:57)
