xrun(64): 24.03-s004: (c) Copyright 1995-2024 Cadence Design Systems, Inc.
TOOL:	xrun(64)	24.03-s004: Started on Nov 11, 2025 at 12:40:18 CET
xrun
	-f xrun.f
		-clean
		./models/driver_cell.sv
		./tb/driver_cell_tb.sv
		-access +rw
		-gui
		-s
		-input /home/msegper/Documents/TFM/driver_cell/restore.tcl
xrun: *N,CLEAN: Removing existing directory ./xcelium.d.
file: ./models/driver_cell.sv
	module worklib.driver_cell:sv
		errors: 0, warnings: 0
file: ./tb/driver_cell_tb.sv
	module worklib.driver_cell_tb:sv
		errors: 0, warnings: 0
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
	Top level design units:
		cds_rnm_pkg
		$unit_0x7577e926
		driver_cell_tb
	Building instance overlay tables: .................... Done
	Using implicit TMP libraries; associated with library worklib
	Generating native compiled code:
		worklib.driver_cell:sv <0x7771218e>
			streams:   7, words:  9424
		worklib.driver_cell_tb:sv <0x7bec415a>
			streams:   9, words: 14833
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                 Instances  Unique
		Modules:                 2       2
		Verilog packages:        1       1
		Registers:              22      22
		Scalar wires:            4       -
		Vectored wires:          8       -
		Always blocks:           4       4
		Initial blocks:          4       4
		Pseudo assignments:      8       -
		Assertions:              3       3
		Compilation units:       1       1
		Simulation timescale:  1ps
	Writing initial simulation snapshot: worklib.driver_cell_tb:sv
xmsim: *W,NOMTDGUI: Multi-Threaded Dumping is disabled for interactive debug mode.

-------------------------------------
Relinquished control to SimVision...
xcelium> 
xcelium> source /eda/cadence/2024-25/RHELx86/XCELIUM_24.03.004/tools/xcelium/files/xmsimrc
xcelium> 
xcelium> # XM-Sim Command File
xcelium> # TOOL:	xmsim(64)	24.03-s004
xcelium> #
xcelium> #
xcelium> # You can restore this configuration with:
xcelium> #
xcelium> #      xrun -f xrun.f -input /home/msegper/Documents/TFM/driver_cell/restore.tcl
xcelium> #
xcelium> 
xcelium> set tcl_prompt1 {puts -nonewline "xcelium> "}
puts -nonewline "xcelium> "
xcelium> set tcl_prompt2 {puts -nonewline "> "}
puts -nonewline "> "
xcelium> set vlog_format %h
%h
xcelium> set vhdl_format %v
%v
xcelium> set real_precision 6
6
xcelium> set display_unit auto
auto
xcelium> set time_unit module
module
xcelium> set heap_garbage_size -200
-200
xcelium> set heap_garbage_time 0
0
xcelium> set assert_report_level note
note
xcelium> set assert_stop_level error
error
xcelium> set autoscope yes
yes
xcelium> set assert_1164_warnings yes
yes
xcelium> set pack_assert_off {}
xcelium> set severity_pack_assert_off {note warning}
note warning
xcelium> set assert_output_stop_level failed
failed
xcelium> set tcl_debug_level 0
0
xcelium> set relax_path_name 1
1
xcelium> set vhdl_vcdmap XX01ZX01X
XX01ZX01X
xcelium> set intovf_severity_level ERROR
ERROR
xcelium> set probe_screen_format 0
0
xcelium> set rangecnst_severity_level ERROR
ERROR
xcelium> set textio_severity_level ERROR
ERROR
xcelium> set vital_timing_checks_on 1
1
xcelium> set vlog_code_show_force 0
0
xcelium> set assert_count_attempts 1
1
xcelium> set tcl_all64 false
false
xcelium> set tcl_runerror_exit false
false
xcelium> set assert_report_incompletes 0
0
xcelium> set show_force 1
1
xcelium> set force_reset_by_reinvoke 0
0
xcelium> set tcl_relaxed_literal 0
0
xcelium> set probe_exclude_patterns {}
xcelium> set probe_packed_limit 4k
4k
xcelium> set probe_unpacked_limit 16k
16k
xcelium> set assert_internal_msg no
no
xcelium> set svseed 1
1
xcelium> set assert_reporting_mode 0
0
xcelium> set vcd_compact_mode 0
0
xcelium> set vhdl_forgen_loopindex_enum_pos 0
0
xcelium> set xmreplay_dc_debug 0
0
xcelium> set tcl_runcmd_interrupt next_command
next_command
xcelium> set tcl_sigval_prefix {#}
#
xcelium> alias . run
xcelium> alias indago verisium
xcelium> alias quit exit
xcelium> database -open -shm -into waves.shm waves -default
Created default SHM database waves
xcelium> probe -create -database waves driver_cell_tb.dut.databinout driver_cell_tb.dut.vssana driver_cell_tb.dut.vddana_1p8 driver_cell_tb.dut.vddana_0p8 driver_cell_tb.dut.pdb driver_cell_tb.dut.datathermoutb driver_cell_tb.dut.datathermout driver_cell_tb.dut.datathermb driver_cell_tb.dut.datatherm driver_cell_tb.dut.datainb driver_cell_tb.dut.datain driver_cell_tb.dut.databinoutb
Created probe 1
xcelium> 
xcelium> simvision -input restore.tcl.svcf
xcelium> run
Iniciando tests...
Test 1: Verificación de límites de alimentación
Test 2: Estado apagado (pdb = 0)
databinout = zzzzzzzz, databinoutb = zzzzzzzz, datathermout = zzzzzzzzzzzzzzzzz, datathermoutb = zzzzzzzzzzzzzzzzz
Test 3: Estado encendido (pdb = 1)
databinout = 11001100, databinoutb = 00110011, datathermout = 11110000111100001, datathermoutb = 00001111000011110
Test 5: Propagación de datos binarios
databinout = 10101010, databinoutb = 01010101
Test 6: Propagación de datos termométricos
datathermout = 10101010101010101, datathermoutb = 01010101010101010
Tests completados.
Simulation complete via $finish(1) at time 80 NS + 0
./tb/driver_cell_tb.sv:85         $finish;
xcelium> ^C
xcelium> exit
TOOL:	xrun(64)	24.03-s004: Exiting on Nov 11, 2025 at 12:44:59 CET  (total: 00:04:41)
