xrun(64): 24.03-s004: (c) Copyright 1995-2024 Cadence Design Systems, Inc.
TOOL:	xrun(64)	24.03-s004: Started on Feb 09, 2026 at 23:44:19 CET
xrun
	-f xrun.f
		-clean
		./models/driver_cell_all_non_linearities.sv
		./tb/driver_cell_tb.sv
		-access +rw
		-gui
		-s
		-input /home/msegper/Documents/TFM/driver_cell/restore.tcl
	-s
xrun: *N,CLEAN: Removing existing directory ./xcelium.d.
file: ./models/driver_cell_all_non_linearities.sv
        int mean = 0;         // Promedio de la distribución
                 |
xmvlog: *W,VARIST (./models/driver_cell_all_non_linearities.sv,72|17): Local static variable with initializer requires 'static' keyword.
        int std_dev = 1;     // Desviación estándar, sigma =1ps
                    |
xmvlog: *W,VARIST (./models/driver_cell_all_non_linearities.sv,73|20): Local static variable with initializer requires 'static' keyword.
        int mean = 0;         // Promedio de la distribución
                 |
xmvlog: *W,VARIST (./models/driver_cell_all_non_linearities.sv,88|17): Local static variable with initializer requires 'static' keyword.
        int std_dev = 10;     // Desviación estándar, sigma
                    |
xmvlog: *W,VARIST (./models/driver_cell_all_non_linearities.sv,89|20): Local static variable with initializer requires 'static' keyword.
	module worklib.driver_cell:sv
		errors: 0, warnings: 4
file: ./tb/driver_cell_tb.sv
	module worklib.driver_cell_tb:sv
		errors: 0, warnings: 0
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
	Top level design units:
		cds_rnm_pkg
		$unit_0x5f8f37e3
		driver_cell_tb
	Building instance overlay tables: ....................
        $display("jitter temporal %s = %0d seed = %0d media =%0d sigma = %0d", type_jitter, random_value, seed, mean, std_dev);
                                                                                                       |
xmelab: *W,REALCV (./models/driver_cell_all_non_linearities.sv,80|103): Real argument converted to integer for (%d).
        $display("mismatch temporal %s = %0d seed = %0d media =%0d sigma = %0d", type_mismatch, random_value, seed, mean, std_dev);
                                                                                                           |
xmelab: *W,REALCV (./models/driver_cell_all_non_linearities.sv,99|107): Real argument converted to integer for (%d).
 Done
	Using implicit TMP libraries; associated with library worklib
	Generating native compiled code:
		worklib.driver_cell:sv <0x48ddecda>
			streams:  15, words: 22338
		worklib.driver_cell_tb:sv <0x4191c8f7>
			streams:   9, words: 15849
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                 Instances  Unique
		Modules:                 2       2
		Verilog packages:        1       1
		Registers:              39      39
		Scalar wires:            4       -
		Vectored wires:          8       -
		Always blocks:           6       6
		Initial blocks:          8       8
		Pseudo assignments:      8       -
		Assertions:              3       3
		Compilation units:       1       1
		Simulation timescale:  1ps
	Writing initial simulation snapshot: worklib.driver_cell_tb:sv
xmsim: *W,NOMTDGUI: Multi-Threaded Dumping is disabled for interactive debug mode.
SVSEED default: 1
xcelium> 
xcelium> source /eda/cadence/2024-25/RHELx86/XCELIUM_24.03.004/tools/xcelium/files/xmsimrc
xcelium> 
xcelium> # XM-Sim Command File
xcelium> # TOOL:	xmsim(64)	24.03-s004
xcelium> #
xcelium> #
xcelium> # You can restore this configuration with:
xcelium> #
xcelium> #      xrun -f xrun.f -input restore.tcl
xcelium> #
xcelium> 
xcelium> set tcl_prompt1 {puts -nonewline "xcelium> "}
puts -nonewline "xcelium> "
xcelium> set tcl_prompt2 {puts -nonewline "> "}
puts -nonewline "> "
xcelium> set vlog_format %h
%h
xcelium> set vhdl_format %v
%v
xcelium> set real_precision 6
6
xcelium> set display_unit auto
auto
xcelium> set time_unit module
module
xcelium> set heap_garbage_size -200
-200
xcelium> set heap_garbage_time 0
0
xcelium> set assert_report_level note
note
xcelium> set assert_stop_level error
error
xcelium> set autoscope yes
yes
xcelium> set assert_1164_warnings yes
yes
xcelium> set pack_assert_off {}
xcelium> set severity_pack_assert_off {note warning}
note warning
xcelium> set assert_output_stop_level failed
failed
xcelium> set tcl_debug_level 0
0
xcelium> set relax_path_name 1
1
xcelium> set vhdl_vcdmap XX01ZX01X
XX01ZX01X
xcelium> set intovf_severity_level ERROR
ERROR
xcelium> set probe_screen_format 0
0
xcelium> set rangecnst_severity_level ERROR
ERROR
xcelium> set textio_severity_level ERROR
ERROR
xcelium> set vital_timing_checks_on 1
1
xcelium> set vlog_code_show_force 0
0
xcelium> set assert_count_attempts 1
1
xcelium> set tcl_all64 false
false
xcelium> set tcl_runerror_exit false
false
xcelium> set assert_report_incompletes 0
0
xcelium> set show_force 1
1
xcelium> set force_reset_by_reinvoke 0
0
xcelium> set tcl_relaxed_literal 0
0
xcelium> set probe_exclude_patterns {}
xcelium> set probe_packed_limit 4k
4k
xcelium> set probe_unpacked_limit 16k
16k
xcelium> set assert_internal_msg no
no
xcelium> set svseed 1
1
xcelium> set assert_reporting_mode 0
0
xcelium> set vcd_compact_mode 0
0
xcelium> set vhdl_forgen_loopindex_enum_pos 0
0
xcelium> set xmreplay_dc_debug 0
0
xcelium> set tcl_runcmd_interrupt next_command
next_command
xcelium> set tcl_sigval_prefix {#}
#
xcelium> alias . run
xcelium> alias indago verisium
xcelium> alias quit exit
xcelium> database -open -shm -into waves.shm waves -default
Created default SHM database waves
xcelium> probe -create -database waves driver_cell_tb.dut.databinout driver_cell_tb.dut.vssana driver_cell_tb.dut.vddana_1p8 driver_cell_tb.dut.vddana_0p8 driver_cell_tb.dut.pdb driver_cell_tb.dut.datathermoutb driver_cell_tb.dut.datathermout driver_cell_tb.dut.datathermb driver_cell_tb.dut.datatherm driver_cell_tb.dut.datainb driver_cell_tb.dut.datain driver_cell_tb.dut.databinoutb
Created probe 1
xcelium> 
xcelium> simvision -input restore.tcl.svcf
xmsim: *E,TCLERR: SimVision initialization failed.
xcelium> 
-------------------------------------
Relinquished control to SimVision...
# Restoring simulation environment...
xcelium> input -quiet .reinvoke.sim
xcelium> file delete .reinvoke.sim
xcelium> run
mismatch temporal databinout =           0 seed = 65102178 media =0 sigma = 10
mismatch temporal datathermout =           7 seed = 1990666696 media =0 sigma = 10
Iniciando tests...
Test 1: Verificación de límites de alimentación
xmsim: *W,ASRTST (./models/driver_cell_all_non_linearities.sv,31): (time 200 PS) Assertion driver_cell_tb.dut.vddana_1p8_boundaries has failed
Input voltge vddana_1p8 is out of bounds: 1.90 V
xmsim: *W,WARSEV (./models/driver_cell_all_non_linearities.sv,121): (time 200 PS).
driver_cell_tb.dut
Input signals boundaries are not correct: vddana_1p8_check=0, vddana_0p8_check=1, vssana_check=1,
xmsim: *W,ASRTST (./models/driver_cell_all_non_linearities.sv,42): (time 400 PS) Assertion driver_cell_tb.dut.vddana_0p8_boundaries has failed
Input voltge vddana_0p8 is out of bounds: 0.70 V
xmsim: *W,WARSEV (./models/driver_cell_all_non_linearities.sv,121): (time 400 PS).
driver_cell_tb.dut
Input signals boundaries are not correct: vddana_1p8_check=1, vddana_0p8_check=0, vssana_check=1,
xmsim: *W,ASRTST (./models/driver_cell_all_non_linearities.sv,55): (time 600 PS) Assertion driver_cell_tb.dut.vssana_boundaries has failed
Input voltge vssana is out of bounds: -0.10 V
xmsim: *W,WARSEV (./models/driver_cell_all_non_linearities.sv,121): (time 600 PS).
driver_cell_tb.dut
Input signals boundaries are not correct: vddana_1p8_check=1, vddana_0p8_check=1, vssana_check=0,
Test 2: Estado apagado (pdb = 0)
jitter temporal datathermout =           0 seed = 677759301 media =0 sigma = 1
jitter temporal databinout =           0 seed = 686896801 media =0 sigma = 1
databinout = zzzzzzz, databinoutb = zzzzzzz, datathermout = zzzzzzzzzzzzzzzzz, datathermoutb = zzzzzzzzzzzzzzzzz
Test 3: Estado encendido (pdb = 1)
jitter temporal datathermout =          -1 seed = -1350050770 media =0 sigma = 1
jitter temporal databinout =           1 seed = -2128088571 media =0 sigma = 1
databinout = 1001100, databinoutb = 0110011, datathermout = 11110000111100001, datathermoutb = 00001111000011110
jitter temporal datathermout =           2 seed = -1854032267 media =0 sigma = 1
jitter temporal databinout =           0 seed = -678322366 media =0 sigma = 1
databinout = 0101010, databinoutb = 1010101, datathermout = 10101010101010101, datathermoutb = 01010101010101010
Tests completados.
Simulation complete via $finish(1) at time 1400 PS + 0
./tb/driver_cell_tb.sv:91         $finish;
xcelium> ^C
xcelium> exit
...Regained control from SimVision
-------------------------------------
TOOL:	xrun(64)	24.03-s004: Exiting on Feb 11, 2026 at 12:08:41 CET  (total: 36:24:22)
