xrun(64): 24.03-s004: (c) Copyright 1995-2024 Cadence Design Systems, Inc.
TOOL:	xrun(64)	24.03-s004: Started on Jan 03, 2026 at 14:39:01 CET
xrun
	-f xrun.f
		-clean
		./models/driver_cell_mismatch.sv
		./tb/driver_cell_mismatch_tb.sv
		-access +rw
		-gui
		-s
		-input /home/msegper/Documents/TFM/driver_cell/restore.tcl
xrun: *N,CLEAN: Removing existing directory ./xcelium.d.
file: ./models/driver_cell_mismatch.sv
	module worklib.driver_cell:sv
		errors: 0, warnings: 0
file: ./tb/driver_cell_mismatch_tb.sv
	module worklib.driver_cell_tb:sv
		errors: 0, warnings: 0
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
	Top level design units:
		cds_rnm_pkg
		$unit_0x3d03b44e
		driver_cell_tb
	Building instance overlay tables: ....................
        $display("Raw binary mismatch[%0d] = %0d", k, temp);
                                                         |
xmelab: *W,REALCV (./models/driver_cell_mismatch.sv,71|57): Real argument converted to integer for (%d).
 Done
	Using implicit TMP libraries; associated with library worklib
	Generating native compiled code:
		worklib.driver_cell:sv <0x675eecee>
			streams:   9, words: 15484
		worklib.driver_cell_tb:sv <0x7e9102a1>
			streams:  13, words: 24245
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                 Instances  Unique
		Modules:                 2       2
		Verilog packages:        1       1
		Registers:              47      47
		Scalar wires:            4       -
		Vectored wires:          8       -
		Always blocks:           4       4
		Initial blocks:          5       5
		Pseudo assignments:     12       -
		Assertions:              3       3
		Compilation units:       1       1
		Simulation timescale:  1ps
	Writing initial simulation snapshot: worklib.driver_cell_tb:sv
xmsim: *W,NOMTDGUI: Multi-Threaded Dumping is disabled for interactive debug mode.
SVSEED default: 1
[DMSINFO] Simulating with Xcelium Mixed-Signal App...

-------------------------------------
Relinquished control to SimVision...
xcelium> 
xcelium> source /eda/cadence/2024-25/RHELx86/XCELIUM_24.03.004/tools/xcelium/files/xmsimrc
xcelium> 
xcelium> # XM-Sim Command File
xcelium> # TOOL:	xmsim(64)	24.03-s004
xcelium> #
xcelium> #
xcelium> # You can restore this configuration with:
xcelium> #
xcelium> #      xrun -f xrun.f -input restore.tcl
xcelium> #
xcelium> 
xcelium> set tcl_prompt1 {puts -nonewline "xcelium> "}
puts -nonewline "xcelium> "
xcelium> set tcl_prompt2 {puts -nonewline "> "}
puts -nonewline "> "
xcelium> set vlog_format %h
%h
xcelium> set vhdl_format %v
%v
xcelium> set real_precision 6
6
xcelium> set display_unit auto
auto
xcelium> set time_unit module
module
xcelium> set heap_garbage_size -200
-200
xcelium> set heap_garbage_time 0
0
xcelium> set assert_report_level note
note
xcelium> set assert_stop_level error
error
xcelium> set autoscope yes
yes
xcelium> set assert_1164_warnings yes
yes
xcelium> set pack_assert_off {}
xcelium> set severity_pack_assert_off {note warning}
note warning
xcelium> set assert_output_stop_level failed
failed
xcelium> set tcl_debug_level 0
0
xcelium> set relax_path_name 1
1
xcelium> set vhdl_vcdmap XX01ZX01X
XX01ZX01X
xcelium> set intovf_severity_level ERROR
ERROR
xcelium> set probe_screen_format 0
0
xcelium> set rangecnst_severity_level ERROR
ERROR
xcelium> set textio_severity_level ERROR
ERROR
xcelium> set vital_timing_checks_on 1
1
xcelium> set vlog_code_show_force 0
0
xcelium> set assert_count_attempts 1
1
xcelium> set tcl_all64 false
false
xcelium> set tcl_runerror_exit false
false
xcelium> set assert_report_incompletes 0
0
xcelium> set show_force 1
1
xcelium> set force_reset_by_reinvoke 0
0
xcelium> set tcl_relaxed_literal 0
0
xcelium> set probe_exclude_patterns {}
xcelium> set probe_packed_limit 4k
4k
xcelium> set probe_unpacked_limit 16k
16k
xcelium> set assert_internal_msg no
no
xcelium> set svseed 1
1
xcelium> set assert_reporting_mode 0
0
xcelium> set vcd_compact_mode 0
0
xcelium> set vhdl_forgen_loopindex_enum_pos 0
0
xcelium> set xmreplay_dc_debug 0
0
xcelium> set tcl_runcmd_interrupt next_command
next_command
xcelium> set tcl_sigval_prefix {#}
#
xcelium> alias . run
xcelium> alias indago verisium
xcelium> alias quit exit
xcelium> database -open -shm -into waves.shm waves -default
Created default SHM database waves
xcelium> probe -create -database waves driver_cell_tb.dut.databinout driver_cell_tb.dut.vssana driver_cell_tb.dut.vddana_1p8 driver_cell_tb.dut.vddana_0p8 driver_cell_tb.dut.pdb driver_cell_tb.dut.datathermoutb driver_cell_tb.dut.datathermout driver_cell_tb.dut.datathermb driver_cell_tb.dut.datatherm driver_cell_tb.dut.datainb driver_cell_tb.dut.datain driver_cell_tb.dut.databinoutb
Created probe 1
xcelium> 
xcelium> simvision -input restore.tcl.svcf
xcelium> run
Raw binary mismatch[0] =        1936
Binary mismatch[0]= -0.0006
Raw binary mismatch[1] =        3068
Binary mismatch[1]= 0.0107
Raw binary mismatch[2] =        3437
Binary mismatch[2]= 0.0144
Raw binary mismatch[3] =         773
Binary mismatch[3]= -0.0123
Raw binary mismatch[4] =         699
Binary mismatch[4]= -0.0130
Raw binary mismatch[5] =        1935
Binary mismatch[5]= -0.0006
Raw binary mismatch[6] =        1043
Binary mismatch[6]= -0.0096
Raw binary mismatch[0] =        3926
Binary mismatch[0]= 0.0193
Raw binary mismatch[1] =        1599
Binary mismatch[1]= -0.0040
Raw binary mismatch[2] =        2933
Binary mismatch[2]= 0.0093
Raw binary mismatch[3] =        1604
Binary mismatch[3]= -0.0040
Raw binary mismatch[4] =         492
Binary mismatch[4]= -0.0151
Raw binary mismatch[5] =        1869
Binary mismatch[5]= -0.0013
Raw binary mismatch[6] =        2517
Binary mismatch[6]= 0.0052
Raw binary mismatch[0] =         761
Binary mismatch[0]= -0.0124
Raw binary mismatch[1] =        1253
Binary mismatch[1]= -0.0075
Raw binary mismatch[2] =        3588
Binary mismatch[2]= 0.0159
Raw binary mismatch[3] =        3875
Binary mismatch[3]= 0.0187
Raw binary mismatch[4] =         309
Binary mismatch[4]= -0.0169
Raw binary mismatch[5] =         332
Binary mismatch[5]= -0.0167
Raw binary mismatch[6] =         715
Binary mismatch[6]= -0.0129
Raw binary mismatch[7] =        2562
Binary mismatch[7]= 0.0056
Raw binary mismatch[8] =         167
Binary mismatch[8]= -0.0183
Raw binary mismatch[9] =        3575
Binary mismatch[9]= 0.0158
Raw binary mismatch[10] =        2617
Binary mismatch[10]= 0.0062
Raw binary mismatch[11] =        3452
Binary mismatch[11]= 0.0145
Raw binary mismatch[12] =         811
Binary mismatch[12]= -0.0119
Raw binary mismatch[13] =        1192
Binary mismatch[13]= -0.0081
Raw binary mismatch[14] =         686
Binary mismatch[14]= -0.0131
Raw binary mismatch[15] =        2570
Binary mismatch[15]= 0.0057
Raw binary mismatch[16] =        1192
Binary mismatch[16]= -0.0081
Raw binary mismatch[0] =         686
Binary mismatch[0]= -0.0131
Raw binary mismatch[1] =        1689
Binary mismatch[1]= -0.0031
Raw binary mismatch[2] =        2096
Binary mismatch[2]= 0.0010
Raw binary mismatch[3] =         561
Binary mismatch[3]= -0.0144
Raw binary mismatch[4] =        1283
Binary mismatch[4]= -0.0072
Raw binary mismatch[5] =        3763
Binary mismatch[5]= 0.0176
Raw binary mismatch[6] =         896
Binary mismatch[6]= -0.0110
Raw binary mismatch[7] =        3078
Binary mismatch[7]= 0.0108
Raw binary mismatch[8] =        1454
Binary mismatch[8]= -0.0055
Raw binary mismatch[9] =        1536
Binary mismatch[9]= -0.0046
Raw binary mismatch[10] =         500
Binary mismatch[10]= -0.0150
Raw binary mismatch[11] =        3218
Binary mismatch[11]= 0.0122
Raw binary mismatch[12] =        2560
Binary mismatch[12]= 0.0056
Raw binary mismatch[13] =        1395
Binary mismatch[13]= -0.0060
Raw binary mismatch[14] =        2710
Binary mismatch[14]= 0.0071
Raw binary mismatch[15] =        1517
Binary mismatch[15]= -0.0048
Raw binary mismatch[16] =        2617
Binary mismatch[16]= 0.0062
Iniciando tests...
Test 1: Verificación de límites de alimentación
Test 2: Estado apagado (pdb = 0)
Valores de databinout:
databinout[0] = `wrealZState, databinoutb[0] = `wrealZState
databinout[1] = `wrealZState, databinoutb[1] = `wrealZState
databinout[2] = `wrealZState, databinoutb[2] = `wrealZState
databinout[3] = `wrealZState, databinoutb[3] = `wrealZState
databinout[4] = `wrealZState, databinoutb[4] = `wrealZState
databinout[5] = `wrealZState, databinoutb[5] = `wrealZState
databinout[6] = `wrealZState, databinoutb[6] = `wrealZState
Valores de datathermout:
datathermout[0] = `wrealZState, datathermoutb[0] = `wrealZState
datathermout[1] = `wrealZState, datathermoutb[1] = `wrealZState
datathermout[2] = `wrealZState, datathermoutb[2] = `wrealZState
datathermout[3] = `wrealZState, datathermoutb[3] = `wrealZState
datathermout[4] = `wrealZState, datathermoutb[4] = `wrealZState
datathermout[5] = `wrealZState, datathermoutb[5] = `wrealZState
datathermout[6] = `wrealZState, datathermoutb[6] = `wrealZState
datathermout[7] = `wrealZState, datathermoutb[7] = `wrealZState
datathermout[8] = `wrealZState, datathermoutb[8] = `wrealZState
datathermout[9] = `wrealZState, datathermoutb[9] = `wrealZState
datathermout[10] = `wrealZState, datathermoutb[10] = `wrealZState
datathermout[11] = `wrealZState, datathermoutb[11] = `wrealZState
datathermout[12] = `wrealZState, datathermoutb[12] = `wrealZState
datathermout[13] = `wrealZState, datathermoutb[13] = `wrealZState
datathermout[14] = `wrealZState, datathermoutb[14] = `wrealZState
datathermout[15] = `wrealZState, datathermoutb[15] = `wrealZState
datathermout[16] = `wrealZState, datathermoutb[16] = `wrealZState
datathermout[17] = 0.0000, datathermoutb[17] = 0.0000
Test 3: Estado encendido (pdb = 1)
Valores de databinout:
databinout[0] = 0.0000, databinoutb[0] = 1.0193
databinout[1] = 0.0000, databinoutb[1] = 0.9960
databinout[2] = 1.0144, databinoutb[2] = 0.0000
databinout[3] = 0.9877, databinoutb[3] = 0.0000
databinout[4] = 0.0000, databinoutb[4] = 0.9849
databinout[5] = 0.0000, databinoutb[5] = 0.9987
databinout[6] = 0.9904, databinoutb[6] = 0.0000
Valores de datathermout:
datathermout[0] = 0.9876, datathermoutb[0] = 0.0000
datathermout[1] = 0.0000, datathermoutb[1] = 0.9969
datathermout[2] = 0.0000, datathermoutb[2] = 1.0010
datathermout[3] = 0.0000, datathermoutb[3] = 0.9856
datathermout[4] = 0.0000, datathermoutb[4] = 0.9928
datathermout[5] = 0.9833, datathermoutb[5] = 0.0000
datathermout[6] = 0.9871, datathermoutb[6] = 0.0000
datathermout[7] = 1.0056, datathermoutb[7] = 0.0000
datathermout[8] = 0.9817, datathermoutb[8] = 0.0000
datathermout[9] = 0.0000, datathermoutb[9] = 0.9954
datathermout[10] = 0.0000, datathermoutb[10] = 0.9850
datathermout[11] = 0.0000, datathermoutb[11] = 1.0122
datathermout[12] = 0.0000, datathermoutb[12] = 1.0056
datathermout[13] = 0.9919, datathermoutb[13] = 0.0000
datathermout[14] = 0.9869, datathermoutb[14] = 0.0000
datathermout[15] = 1.0057, datathermoutb[15] = 0.0000
datathermout[16] = 0.9919, datathermoutb[16] = 0.0000
datathermout[17] = 0.0000, datathermoutb[17] = 0.0000
Test 5: Propagación de datos binarios
Valores de databinout:
databinout[0] = 0.0000, databinoutb[0] = 1.0193
databinout[1] = 1.0107, databinoutb[1] = 0.0000
databinout[2] = 0.0000, databinoutb[2] = 1.0093
databinout[3] = 0.9877, databinoutb[3] = 0.0000
databinout[4] = 0.0000, databinoutb[4] = 0.9849
databinout[5] = 0.9993, databinoutb[5] = 0.0000
databinout[6] = 0.0000, databinoutb[6] = 1.0052
Test 6: Propagación de datos termométricos
Valores de datathermout:
datathermout[0] = 0.9876, datathermoutb[0] = 0.0000
datathermout[1] = 0.0000, datathermoutb[1] = 0.9969
datathermout[2] = 1.0159, datathermoutb[2] = 0.0000
datathermout[3] = 0.0000, datathermoutb[3] = 0.9856
datathermout[4] = 0.9831, datathermoutb[4] = 0.0000
datathermout[5] = 0.0000, datathermoutb[5] = 1.0176
datathermout[6] = 0.9871, datathermoutb[6] = 0.0000
datathermout[7] = 0.0000, datathermoutb[7] = 1.0108
datathermout[8] = 0.9817, datathermoutb[8] = 0.0000
datathermout[9] = 0.0000, datathermoutb[9] = 0.9954
datathermout[10] = 1.0062, datathermoutb[10] = 0.0000
datathermout[11] = 0.0000, datathermoutb[11] = 1.0122
datathermout[12] = 0.9881, datathermoutb[12] = 0.0000
datathermout[13] = 0.0000, datathermoutb[13] = 0.9940
datathermout[14] = 0.9869, datathermoutb[14] = 0.0000
datathermout[15] = 0.0000, datathermoutb[15] = 0.9952
datathermout[16] = 0.9919, datathermoutb[16] = 0.0000
datathermout[17] = 0.0000, datathermoutb[17] = 0.0000
Tests completados.
Simulation complete via $finish(1) at time 80 NS + 0
./tb/driver_cell_mismatch_tb.sv:106         $finish;
xcelium> ^C
xcelium> exit
TOOL:	xrun(64)	24.03-s004: Exiting on Jan 03, 2026 at 14:44:20 CET  (total: 00:05:19)
